[Killed] StringLiteral
lib/guard/index.ts:23:67
 
 /** SQL 读取类首词白名单（大小写不敏感；首词必须命中，否则视为非读） */
 const SQL_READ_HEADS = new Set([
-  'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+  'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', "", 'help', 'table',
 ]);
 
killedBy: classifyStatement: SQL 注释剥离 【现行为：注释内写词误触发语句体扫描（body 正则作用于原始语句）】
statusReason: expected '只读通道（query）出现非读取语句（set），需要确认' to contain '写操作关键字'

[Survived] StringLiteral
lib/guard/index.ts:23:13
 
 /** SQL 读取类首词白名单（大小写不敏感；首词必须命中，否则视为非读） */
 const SQL_READ_HEADS = new Set([
-  'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+  'select', "", 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
 ]);
 

[Killed] Regex
lib/guard/index.ts:27:20
 ]);
 
 /** DDL：隐式提交、不可回滚 */
-const SQL_DDL_RE = /^\s*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
+const SQL_DDL_RE = /\s*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
 /** DML：修改数据 */
 const SQL_DML_RE = /^\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
killedBy: classifyStatement: SQL 注释剥离 【现行为：前导块注释使 DDL 漏判，execute 通道降级 warning】
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Survived] Regex
lib/guard/index.ts:27:20
 ]);
 
 /** DDL：隐式提交、不可回滚 */
-const SQL_DDL_RE = /^\s*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
+const SQL_DDL_RE = /^\S*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
 /** DML：修改数据 */
 const SQL_DML_RE = /^\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;

[Survived] Regex
lib/guard/index.ts:31:22
 /** DML：修改数据 */
 const SQL_DML_RE = /^\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
 /** 维护类（oracle/dm 等：shutdown/startup/analyze 等） */
-const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+const SQL_MAINT_RE = /\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
 
 /** 读取语句内出现即 danger 的片段（多语句、文件读写、全局设置、跨行锁读） */

[Killed] Regex
lib/guard/index.ts:34:30
 const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
 
 /** 读取语句内出现即 danger 的片段（多语句、文件读写、全局设置、跨行锁读） */
-const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\S+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
 /** 读语句体内出现写关键字即 danger（WITH...DELETE / EXPLAIN ANALYZE DELETE 等） */
 const SQL_WRITE_BODY_RE = /\b(insert|update|delete|merge|drop|alter|truncate)\b/i;
killedBy: classifyStatement: SQL 系 读语句内的危险片段升级为 danger
statusReason: expected 'none' to be 'danger' // Object.is equality

[Survived] Regex
lib/guard/index.ts:34:30
 const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
 
 /** 读取语句内出现即 danger 的片段（多语句、文件读写、全局设置、跨行锁读） */
-const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s[\s\S]*\bfor\s+update\b/i;
 /** 读语句体内出现写关键字即 danger（WITH...DELETE / EXPLAIN ANALYZE DELETE 等） */
 const SQL_WRITE_BODY_RE = /\b(insert|update|delete|merge|drop|alter|truncate)\b/i;

[Killed] ArrayDeclaration
lib/guard/index.ts:42:54
 const MONGO_READ_OPS: ReadonlySet<string> = READ_OPS;
 
 /** MongoDB 写操作清单（适配器未导出，此处按 DANGEROUS_OPS 之外的写命令复述） */
-const MONGO_WRITE_OPS: ReadonlySet<string> = new Set([
-  'insert', 'insertOne', 'insertMany',
-  'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
-  'deleteOne',
-  'createCollection', 'renameCollection', 'mapReduce',
-]);
+const MONGO_WRITE_OPS: ReadonlySet<string> = new Set([]);
 
 /** 首个 SQL 关键字（剥掉注释与括号） */
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'none' to be 'warning' // Object.is equality

[Killed] StringLiteral
lib/guard/index.ts:43:3
 
 /** MongoDB 写操作清单（适配器未导出，此处按 DANGEROUS_OPS 之外的写命令复述） */
 const MONGO_WRITE_OPS: ReadonlySet<string> = new Set([
-  'insert', 'insertOne', 'insertMany',
+  "", 'insertOne', 'insertMany',
   'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
   'deleteOne',
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'none' to be 'warning' // Object.is equality

[Survived] StringLiteral
lib/guard/index.ts:44:30
 /** MongoDB 写操作清单（适配器未导出，此处按 DANGEROUS_OPS 之外的写命令复述） */
 const MONGO_WRITE_OPS: ReadonlySet<string> = new Set([
   'insert', 'insertOne', 'insertMany',
-  'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+  'updateOne', 'updateMany', "", 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
   'deleteOne',
   'createCollection', 'renameCollection', 'mapReduce',

[Survived] StringLiteral
lib/guard/index.ts:44:44
 /** MongoDB 写操作清单（适配器未导出，此处按 DANGEROUS_OPS 之外的写命令复述） */
 const MONGO_WRITE_OPS: ReadonlySet<string> = new Set([
   'insert', 'insertOne', 'insertMany',
-  'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+  'updateOne', 'updateMany', 'replaceOne', "", 'findAndModify', 'bulkWrite',
   'deleteOne',
   'createCollection', 'renameCollection', 'mapReduce',

[Survived] StringLiteral
lib/guard/index.ts:46:43
   'insert', 'insertOne', 'insertMany',
   'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
   'deleteOne',
-  'createCollection', 'renameCollection', 'mapReduce',
+  'createCollection', 'renameCollection', "",
 ]);
 

[Killed] BlockStatement
lib/guard/index.ts:50:52
 ]);
 
 /** 首个 SQL 关键字（剥掉注释与括号） */
-export function sqlHead(statement: string): string {
-  const s = statement
-    .replace(/\/\*[\s\S]*?\*\//g, ' ')
-    .replace(/--[^\n]*/g, ' ')
-    .replace(/#[^\n]*/g, ' ')
-    .trim();
-  const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
-  return m?.[1]?.toLowerCase() ?? '';
-}
+export function sqlHead(statement: string): string {}
 
 /** 语句 SHA256（challenge 绑定用；trim 后哈希） */
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected { needConfirmation: true, …(4) } to match object { rowCount: 1 }
(5 matching properties omitted from actual)

[Survived] MethodExpression
lib/guard/index.ts:51:13
 
 /** 首个 SQL 关键字（剥掉注释与括号） */
 export function sqlHead(statement: string): string {
-  const s = statement
-    .replace(/\/\*[\s\S]*?\*\//g, ' ')
-    .replace(/--[^\n]*/g, ' ')
-    .replace(/#[^\n]*/g, ' ')
-    .trim();
+  const s = statement.replace(/\/\*[\s\S]*?\*\//g, ' ').replace(/--[^\n]*/g, ' ').replace(/#[^\n]*/g, ' ');
   const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
   return m?.[1]?.toLowerCase() ?? '';

[Killed] Regex
lib/guard/index.ts:52:14
 /** 首个 SQL 关键字（剥掉注释与括号） */
 export function sqlHead(statement: string): string {
   const s = statement
-    .replace(/\/\*[\s\S]*?\*\//g, ' ')
+    .replace(/\/\*[\S\S]*?\*\//g, ' ')
     .replace(/--[^\n]*/g, ' ')
     .replace(/#[^\n]*/g, ' ')
killedBy: sqlHead 白盒：注释剥离与首词提取 跨行块注释完整剥离后取首词
statusReason: expected '' to be 'select' // Object.is equality

[Survived] StringLiteral
lib/guard/index.ts:53:27
 export function sqlHead(statement: string): string {
   const s = statement
     .replace(/\/\*[\s\S]*?\*\//g, ' ')
-    .replace(/--[^\n]*/g, ' ')
+    .replace(/--[^\n]*/g, "")
     .replace(/#[^\n]*/g, ' ')
     .trim();

[Killed] Regex
lib/guard/index.ts:56:13
     .replace(/--[^\n]*/g, ' ')
     .replace(/#[^\n]*/g, ' ')
     .trim();
-  const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+  const m = /^[\s(]([a-zA-Z_]+)/.exec(s);
   return m?.[1]?.toLowerCase() ?? '';
 }
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] LogicalOperator
lib/guard/index.ts:57:10
     .replace(/#[^\n]*/g, ' ')
     .trim();
   const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
-  return m?.[1]?.toLowerCase() ?? '';
+  return m?.[1]?.toLowerCase() && '';
 }
 
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] MethodExpression
lib/guard/index.ts:57:10
     .replace(/#[^\n]*/g, ' ')
     .trim();
   const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
-  return m?.[1]?.toLowerCase() ?? '';
+  return m?.[1]?.toUpperCase() ?? '';
 }
 
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/guard/index.ts:61:58
 }
 
 /** 语句 SHA256（challenge 绑定用；trim 后哈希） */
-export function statementHash(statement: string): string {
-  return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
-}
+export function statementHash(statement: string): string {}
 
 /**
killedBy: statementHash trim 后哈希，稳定一致
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] MethodExpression
lib/guard/index.ts:62:38
 
 /** 语句 SHA256（challenge 绑定用；trim 后哈希） */
 export function statementHash(statement: string): string {
-  return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
+  return createHash('sha256').update(statement, 'utf8').digest('hex');
 }
 
killedBy: statementHash trim 后哈希，稳定一致
statusReason: expected '6c84380b12b4e53a6f33452893817f9bd0565…' to be 'ef7da6123bdbf15adae1f06d75386f5a24b62…' // Object.is equality

[Killed] BlockStatement
lib/guard/index.ts:70:107
  * （只读通道混入写）；execute 通道 SELECT 类放行（如 SELECT ... INTO 之外
  * 的合法场景由各适配器会话级只读兜底）。
  */
-export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {
-  if (kind === 'redis') return classifyRedis(statement, op);
-  if (kind === 'mongodb') return classifyMongo(statement, op);
-  return classifySql(statement, op);
-}
+export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {}
 
 /* ---------------- SQL 系（mysql/postgresql/gaussdb/sqlite/oracle/dmdb） ---------------- */
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] ConditionalExpression
lib/guard/index.ts:71:7
  * 的合法场景由各适配器会话级只读兜底）。
  */
 export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {
-  if (kind === 'redis') return classifyRedis(statement, op);
+  if (true) return classifyRedis(statement, op);
   if (kind === 'mongodb') return classifyMongo(statement, op);
   return classifySql(statement, op);
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'warning', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/guard/index.ts:71:7
  * 的合法场景由各适配器会话级只读兜底）。
  */
 export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {
-  if (kind === 'redis') return classifyRedis(statement, op);
+  if (kind !== 'redis') return classifyRedis(statement, op);
   if (kind === 'mongodb') return classifyMongo(statement, op);
   return classifySql(statement, op);
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'warning', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/guard/index.ts:72:7
  */
 export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {
   if (kind === 'redis') return classifyRedis(statement, op);
-  if (kind === 'mongodb') return classifyMongo(statement, op);
+  if (true) return classifyMongo(statement, op);
   return classifySql(statement, op);
 }
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/guard/index.ts:72:7
  */
 export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {
   if (kind === 'redis') return classifyRedis(statement, op);
-  if (kind === 'mongodb') return classifyMongo(statement, op);
+  if (false) return classifyMongo(statement, op);
   return classifySql(statement, op);
 }
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:80:7
 
 function classifySql(statement: string, op: 'query' | 'execute'): GuardVerdict {
   const head = sqlHead(statement);
-  if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+  if (true) return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
 
   const isRead = SQL_READ_HEADS.has(head);
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/guard/index.ts:80:7
 
 function classifySql(statement: string, op: 'query' | 'execute'): GuardVerdict {
   const head = sqlHead(statement);
-  if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+  if (head !== '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
 
   const isRead = SQL_READ_HEADS.has(head);
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/guard/index.ts:83:15
   if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
 
   const isRead = SQL_READ_HEADS.has(head);
-  if (isRead) {
-    if (SQL_HIDDEN_DANGER_RE.test(statement)) {
-      return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
-    }
-    // 读头不等于只读：WITH...DELETE / EXPLAIN ANALYZE DELETE 语句体内含写关键字
-    if (SQL_WRITE_BODY_RE.test(statement)) {
-      return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
-    }
-    return { level: 'none' };
-  }
+  if (isRead) {}
 
   if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/guard/index.ts:83:7
   if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
 
   const isRead = SQL_READ_HEADS.has(head);
-  if (isRead) {
+  if (true) {
     if (SQL_HIDDEN_DANGER_RE.test(statement)) {
       return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
killedBy: classifyStatement: SQL 系 DDL 为 danger，原因是 DDL 不可回滚
statusReason: expected '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLA…' to contain '不可回滚'

[Killed] ConditionalExpression
lib/guard/index.ts:84:9
 
   const isRead = SQL_READ_HEADS.has(head);
   if (isRead) {
-    if (SQL_HIDDEN_DANGER_RE.test(statement)) {
+    if (true) {
       return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
     }
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/guard/index.ts:84:9
 
   const isRead = SQL_READ_HEADS.has(head);
   if (isRead) {
-    if (SQL_HIDDEN_DANGER_RE.test(statement)) {
+    if (false) {
       return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
     }
killedBy: classifyStatement: SQL 系 读语句内的危险片段升级为 danger
statusReason: expected 'none' to be 'danger' // Object.is equality

[Killed] StringLiteral
lib/guard/index.ts:85:23
   const isRead = SQL_READ_HEADS.has(head);
   if (isRead) {
     if (SQL_HIDDEN_DANGER_RE.test(statement)) {
-      return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
+      return { level: "", reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
     }
     // 读头不等于只读：WITH...DELETE / EXPLAIN ANALYZE DELETE 语句体内含写关键字
killedBy: classifyStatement: SQL 系 读语句内的危险片段升级为 danger
statusReason: expected '' to be 'danger' // Object.is equality

[Killed] BlockStatement
lib/guard/index.ts:88:44
       return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
     }
     // 读头不等于只读：WITH...DELETE / EXPLAIN ANALYZE DELETE 语句体内含写关键字
-    if (SQL_WRITE_BODY_RE.test(statement)) {
-      return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
-    }
+    if (SQL_WRITE_BODY_RE.test(statement)) {}
     return { level: 'none' };
   }
killedBy: classifyStatement: SQL 注释剥离 【现行为：注释内写词误触发语句体扫描（body 正则作用于原始语句）】
statusReason: expected 'none' to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:88:9
       return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
     }
     // 读头不等于只读：WITH...DELETE / EXPLAIN ANALYZE DELETE 语句体内含写关键字
-    if (SQL_WRITE_BODY_RE.test(statement)) {
+    if (true) {
       return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
     }
killedBy: classifyStatement: SQL 系 普通 SELECT 为 none
statusReason: expected { level: 'danger', …(1) } to match object { level: 'none' }
(1 matching property omitted from actual)

[Killed] StringLiteral
lib/guard/index.ts:89:41
     }
     // 读头不等于只读：WITH...DELETE / EXPLAIN ANALYZE DELETE 语句体内含写关键字
     if (SQL_WRITE_BODY_RE.test(statement)) {
-      return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
+      return { level: 'danger', reason: "" };
     }
     return { level: 'none' };
killedBy: classifyStatement: SQL 注释剥离 【现行为：注释内写词误触发语句体扫描（body 正则作用于原始语句）】
statusReason: expected '' to contain '写操作关键字'

[Killed] ConditionalExpression
lib/guard/index.ts:94:7
     return { level: 'none' };
   }
 
-  if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+  if (false) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
   if (SQL_DML_RE.test(statement)) {
     if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
killedBy: classifyStatement: SQL 系 DDL 为 danger，原因是 DDL 不可回滚
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:94:7
     return { level: 'none' };
   }
 
-  if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+  if (true) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
   if (SQL_DML_RE.test(statement)) {
     if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
killedBy: classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:95:7
   }
 
   if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
-  if (SQL_DML_RE.test(statement)) {
+  if (true) {
     if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
     return { level: 'warning', reason: '写操作将修改数据' };
killedBy: classifyStatement: SQL 系 维护命令为 danger
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Survived] ConditionalExpression
lib/guard/index.ts:95:7
   }
 
   if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
-  if (SQL_DML_RE.test(statement)) {
+  if (false) {
     if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
     return { level: 'warning', reason: '写操作将修改数据' };

[Killed] EqualityOperator
lib/guard/index.ts:96:9
 
   if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
   if (SQL_DML_RE.test(statement)) {
-    if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+    if (op !== 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
     return { level: 'warning', reason: '写操作将修改数据' };
   }
killedBy: classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:96:9
 
   if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
   if (SQL_DML_RE.test(statement)) {
-    if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+    if (false) return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
     return { level: 'warning', reason: '写操作将修改数据' };
   }
killedBy: classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:99:7
     if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
     return { level: 'warning', reason: '写操作将修改数据' };
   }
-  if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+  if (true) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
 
   // 未知关键字：execute 通道 warning（适配器只读兜底），query 通道 danger
killedBy: classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:99:7
     if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
     return { level: 'warning', reason: '写操作将修改数据' };
   }
-  if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+  if (false) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
 
   // 未知关键字：execute 通道 warning（适配器只读兜底），query 通道 danger
killedBy: classifyStatement: SQL 系 维护命令为 danger
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:102:7
   if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
 
   // 未知关键字：execute 通道 warning（适配器只读兜底），query 通道 danger
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+  if (true) return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
   return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
 }
killedBy: classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] EqualityOperator
lib/guard/index.ts:102:7
   if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
 
   // 未知关键字：execute 通道 warning（适配器只读兜底），query 通道 danger
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+  if (op !== 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
   return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
 }
killedBy: classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] BlockStatement
lib/guard/index.ts:108:82
 
 /* ---------------- Redis ---------------- */
 
-function classifyRedis(statement: string, op: 'query' | 'execute'): GuardVerdict {
-  const parts = parseRedisCommand(statement);
-  const head = (parts[0] ?? '').toUpperCase();
-  if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
-
-  if (DANGEROUS_COMMANDS.has(head)) {
-    return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
-  }
-  if (WRITE_COMMANDS.has(head)) {
-    if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
-    return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
-  }
-  if (READ_COMMANDS.has(head)) return { level: 'none' };
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
-  return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
-}
+function classifyRedis(statement: string, op: 'query' | 'execute'): GuardVerdict {}
 
 /* ---------------- MongoDB ---------------- */
killedBy: classifyStatement: Redis 危险命令 danger（13 项清单）
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] MethodExpression
lib/guard/index.ts:110:16
 
 function classifyRedis(statement: string, op: 'query' | 'execute'): GuardVerdict {
   const parts = parseRedisCommand(statement);
-  const head = (parts[0] ?? '').toUpperCase();
+  const head = (parts[0] ?? '').toLowerCase();
   if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
 
killedBy: classifyStatement: Redis 危险命令 danger（13 项清单）
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] LogicalOperator
lib/guard/index.ts:110:17
 
 function classifyRedis(statement: string, op: 'query' | 'execute'): GuardVerdict {
   const parts = parseRedisCommand(statement);
-  const head = (parts[0] ?? '').toUpperCase();
+  const head = (parts[0] && '').toUpperCase();
   if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
 
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'none' // Object.is equality

[Killed] EqualityOperator
lib/guard/index.ts:111:7
 function classifyRedis(statement: string, op: 'query' | 'execute'): GuardVerdict {
   const parts = parseRedisCommand(statement);
   const head = (parts[0] ?? '').toUpperCase();
-  if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+  if (head !== '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
 
   if (DANGEROUS_COMMANDS.has(head)) {
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'none' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:111:7
 function classifyRedis(statement: string, op: 'query' | 'execute'): GuardVerdict {
   const parts = parseRedisCommand(statement);
   const head = (parts[0] ?? '').toUpperCase();
-  if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+  if (true) return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
 
   if (DANGEROUS_COMMANDS.has(head)) {
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'none' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:113:7
   const head = (parts[0] ?? '').toUpperCase();
   if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
 
-  if (DANGEROUS_COMMANDS.has(head)) {
+  if (true) {
     return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
   }
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'none' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:113:7
   const head = (parts[0] ?? '').toUpperCase();
   if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
 
-  if (DANGEROUS_COMMANDS.has(head)) {
+  if (false) {
     return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
   }
killedBy: classifyStatement: Redis 危险命令 danger（13 项清单）
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:116:7
   if (DANGEROUS_COMMANDS.has(head)) {
     return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
   }
-  if (WRITE_COMMANDS.has(head)) {
+  if (true) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'none' // Object.is equality

[Survived] ConditionalExpression
lib/guard/index.ts:116:7
   if (DANGEROUS_COMMANDS.has(head)) {
     return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
   }
-  if (WRITE_COMMANDS.has(head)) {
+  if (false) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };

[Killed] EqualityOperator
lib/guard/index.ts:117:9
     return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
   }
   if (WRITE_COMMANDS.has(head)) {
-    if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+    if (op !== 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
   }
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'warning' // Object.is equality
