[NoCoverage] StringLiteral
lib/guard/index.ts:52:35
-     return m?.[1]?.toLowerCase() ?? '';
+     return m?.[1]?.toLowerCase() ?? "Stryker was here!";

[NoCoverage] ObjectLiteral
lib/guard/index.ts:75:27
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === '') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:75:36
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === '') return { level: "", reason: '无法解析语句关键字，按危险语句处理' };

[NoCoverage] StringLiteral
lib/guard/index.ts:75:54
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === '') return { level: 'danger', reason: "" };

[NoCoverage] StringLiteral
lib/guard/index.ts:101:29
-     const head = (parts[0] ?? '').toUpperCase();
+     const head = (parts[0] ?? "Stryker was here!").toUpperCase();

[NoCoverage] ObjectLiteral
lib/guard/index.ts:102:27
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === '') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:102:36
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === '') return { level: "", reason: '无法解析 Redis 命令，按危险命令处理' };

[NoCoverage] StringLiteral
lib/guard/index.ts:102:54
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === '') return { level: 'danger', reason: "" };

[NoCoverage] StringLiteral
lib/guard/index.ts:122:67
-         head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
+         head = Object.keys(parsed as Record<string, unknown>)[0] ?? "Stryker was here!";

[NoCoverage] ObjectLiteral
lib/guard/index.ts:127:27
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === '') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:127:36
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === '') return { level: "", reason: '无法解析 MongoDB 命令，按危险命令处理' };

[NoCoverage] StringLiteral
lib/guard/index.ts:127:54
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === '') return { level: 'danger', reason: "" };

[NoCoverage] ArithmeticOperator
lib/guard/index.ts:170:47
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+       const interval = opts?.sweepIntervalMs ?? 60 / 1000;

[NoCoverage] BlockStatement
lib/guard/index.ts:171:23
-       if (interval > 0) {
-         this.timer = setInterval(() => this.sweep(), interval);
-         this.timer.unref?.();
-       }
+       if (interval > 0) {}

[NoCoverage] ArrowFunction
lib/guard/index.ts:172:32
-         this.timer = setInterval(() => this.sweep(), interval);
+         this.timer = setInterval(() => undefined, interval);

[NoCoverage] OptionalChaining
lib/guard/index.ts:173:7
-         this.timer.unref?.();
+         this.timer.unref();

[NoCoverage] BlockStatement
lib/guard/index.ts:210:21
-       if (this.timer) {
-         clearInterval(this.timer);
-         this.timer = undefined;
-       }
+       if (this.timer) {}

[NoCoverage] CallExpression
lib/guard/index.ts:211:7
-         clearInterval(this.timer);
+         ;

[Survived] Regex
lib/guard/index.ts:47:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[^\s\S]*?\*\//g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] MethodExpression
lib/guard/index.ts:46:13
-     const s = statement
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
-       .replace(/--[^\n]*/g, ' ')
-       .replace(/#[^\n]*/g, ' ')
-       .trim();
+     const s = statement.replace(/\/\*[\s\S]*?\*\//g, ' ').replace(/--[^\n]*/g, ' ').replace(/#[^\n]*/g, ' ');
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] BlockStatement
lib/guard/index.ts:45:52
-   export function sqlHead(statement: string): string {
-     const s = statement
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
-       .replace(/--[^\n]*/g, ' ')
-       .replace(/#[^\n]*/g, ' ')
-       .trim();
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
-     return m?.[1]?.toLowerCase() ?? '';
-   }
+   export function sqlHead(statement: string): string {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:47:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\s\S]\*\//g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:48:14
-       .replace(/--[^\n]*/g, ' ')
+       .replace(/--[^\n]/g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:47:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\S\S]*?\*\//g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] StringLiteral
lib/guard/index.ts:47:35
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\s\S]*?\*\//g, "")
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:47:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\s\s]*?\*\//g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:48:14
-       .replace(/--[^\n]*/g, ' ')
+       .replace(/--[\n]*/g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:49:14
-       .replace(/#[^\n]*/g, ' ')
+       .replace(/#[^\n]/g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] StringLiteral
lib/guard/index.ts:48:27
-       .replace(/--[^\n]*/g, ' ')
+       .replace(/--[^\n]*/g, "")
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:49:14
-       .replace(/#[^\n]*/g, ' ')
+       .replace(/#[\n]*/g, ' ')
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] StringLiteral
lib/guard/index.ts:49:26
-       .replace(/#[^\n]*/g, ' ')
+       .replace(/#[^\n]*/g, "")
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:51:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /[\s(]*([a-zA-Z_]+)/.exec(s);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:51:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /^[\s(]([a-zA-Z_]+)/.exec(s);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:51:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /^[^\s(]*([a-zA-Z_]+)/.exec(s);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:51:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /^[\S(]*([a-zA-Z_]+)/.exec(s);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:51:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /^[\s(]*([a-zA-Z_])/.exec(s);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] Regex
lib/guard/index.ts:51:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /^[\s(]*([^a-zA-Z_]+)/.exec(s);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] LogicalOperator
lib/guard/index.ts:52:10
-     return m?.[1]?.toLowerCase() ?? '';
+     return m?.[1]?.toLowerCase() && '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] MethodExpression
lib/guard/index.ts:52:10
-     return m?.[1]?.toLowerCase() ?? '';
+     return m?.[1]?.toUpperCase() ?? '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:52:10
-     return m?.[1]?.toLowerCase() ?? '';
+     return m?.[1].toLowerCase() ?? '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:52:10
-     return m?.[1]?.toLowerCase() ?? '';
+     return m[1]?.toLowerCase() ?? '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] BlockStatement
lib/guard/index.ts:56:58
-   export function statementHash(statement: string): string {
-     return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
-   }
+   export function statementHash(statement: string): string {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] StringLiteral
lib/guard/index.ts:57:21
-     return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
+     return createHash("").update(statement.trim(), 'utf8').digest('hex');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] MethodExpression
lib/guard/index.ts:57:38
-     return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
+     return createHash('sha256').update(statement, 'utf8').digest('hex');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] StringLiteral
lib/guard/index.ts:57:56
-     return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
+     return createHash('sha256').update(statement.trim(), "").digest('hex');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] StringLiteral
lib/guard/index.ts:57:71
-     return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
+     return createHash('sha256').update(statement.trim(), 'utf8').digest("");
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] BlockStatement
lib/guard/index.ts:65:107
-   export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {
-     if (kind === 'redis') return classifyRedis(statement);
-     if (kind === 'mongodb') return classifyMongo(statement);
-     return classifySql(statement, op);
-   }
+   export function classifyStatement(kind: DbKind, statement: string, op: 'query' | 'execute'): GuardVerdict {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 26 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:66:7
-     if (kind === 'redis') return classifyRedis(statement);
+     if (true) return classifyRedis(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 26 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:66:7
-     if (kind === 'redis') return classifyRedis(statement);
+     if (false) return classifyRedis(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 26 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:66:7
-     if (kind === 'redis') return classifyRedis(statement);
+     if (kind !== 'redis') return classifyRedis(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:66:16
-     if (kind === 'redis') return classifyRedis(statement);
+     if (kind === "") return classifyRedis(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 26 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:67:7
-     if (kind === 'mongodb') return classifyMongo(statement);
+     if (false) return classifyMongo(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 22 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:67:7
-     if (kind === 'mongodb') return classifyMongo(statement);
+     if (true) return classifyMongo(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 22 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:67:7
-     if (kind === 'mongodb') return classifyMongo(statement);
+     if (kind !== 'mongodb') return classifyMongo(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 22 more tests!

[Survived] StringLiteral
lib/guard/index.ts:67:16
-     if (kind === 'mongodb') return classifyMongo(statement);
+     if (kind === "") return classifyMongo(statement);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 22 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:75:7
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (true) return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] BlockStatement
lib/guard/index.ts:73:80
-   function classifySql(statement: string, op: 'query' | 'execute'): GuardVerdict {
-     const head = sqlHead(statement);
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
-     const isRead = SQL_READ_HEADS.has(head);
-     if (isRead) {
-       if (SQL_HIDDEN_DANGER_RE.test(statement)) {
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
-       }
-       return { level: 'none' };
-     }
-     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
-     if (SQL_DML_RE.test(statement)) {
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
-       return { level: 'warning', reason: '写操作将修改数据' };
-     }
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
-     // 未知关键字：execute 通道 warning（适配器只读兜底），query 通道 danger
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
-     return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
-   }
+   function classifySql(statement: string, op: 'query' | 'execute'): GuardVerdict {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:75:7
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (false) return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:75:7
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head !== '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] StringLiteral
lib/guard/index.ts:75:16
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === "Stryker was here!") return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:78:7
-     if (isRead) {
+     if (true) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:78:7
-     if (isRead) {
+     if (false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 19 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:79:9
-       if (SQL_HIDDEN_DANGER_RE.test(statement)) {
+       if (false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 6 more tests!

[Survived] BlockStatement
lib/guard/index.ts:79:47
-       if (SQL_HIDDEN_DANGER_RE.test(statement)) {
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
-       }
+       if (SQL_HIDDEN_DANGER_RE.test(statement)) {}
Tests ran:
    classifyStatement: SQL 系 读语句内的危险片段升级为 danger

[Survived] BlockStatement
lib/guard/index.ts:78:15
-     if (isRead) {
-       if (SQL_HIDDEN_DANGER_RE.test(statement)) {
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
-       }
-       return { level: 'none' };
-     }
+     if (isRead) {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 6 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:79:9
-       if (SQL_HIDDEN_DANGER_RE.test(statement)) {
+       if (true) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 6 more tests!

[Survived] ObjectLiteral
lib/guard/index.ts:80:14
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
+         return {};
Tests ran:
    classifyStatement: SQL 系 读语句内的危险片段升级为 danger

[Survived] StringLiteral
lib/guard/index.ts:80:23
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
+         return { level: "", reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
Tests ran:
    classifyStatement: SQL 系 读语句内的危险片段升级为 danger

[Survived] StringLiteral
lib/guard/index.ts:80:41
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
+         return { level: 'danger', reason: "" };
Tests ran:
    classifyStatement: SQL 系 读语句内的危险片段升级为 danger

[Survived] ObjectLiteral
lib/guard/index.ts:82:12
-       return { level: 'none' };
+       return {};
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 5 more tests!

[Survived] StringLiteral
lib/guard/index.ts:82:21
-       return { level: 'none' };
+       return { level: "" };
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 5 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:85:7
-     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+     if (true) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:85:7
-     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+     if (false) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] ObjectLiteral
lib/guard/index.ts:85:42
-     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+     if (SQL_DDL_RE.test(statement)) return {};
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:86:7
-     if (SQL_DML_RE.test(statement)) {
+     if (true) {
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 3 more tests!

[Survived] StringLiteral
lib/guard/index.ts:85:51
-     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+     if (SQL_DDL_RE.test(statement)) return { level: "", reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] StringLiteral
lib/guard/index.ts:85:69
-     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: 'DDL 不可回滚（隐式提交），可能破坏表结构或数据' };
+     if (SQL_DDL_RE.test(statement)) return { level: 'danger', reason: "" };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:86:7
-     if (SQL_DML_RE.test(statement)) {
+     if (false) {
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 3 more tests!

[Survived] BlockStatement
lib/guard/index.ts:86:35
-     if (SQL_DML_RE.test(statement)) {
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
-       return { level: 'warning', reason: '写操作将修改数据' };
-     }
+     if (SQL_DML_RE.test(statement)) {}
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 1 more test!

[Survived] ConditionalExpression
lib/guard/index.ts:87:9
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (true) return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 1 more test!

[Survived] ConditionalExpression
lib/guard/index.ts:87:9
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (false) return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 1 more test!
