[Killed] ConditionalExpression
lib/guard/index.ts:117:9
     return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
   }
   if (WRITE_COMMANDS.has(head)) {
-    if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+    if (true) return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
   }
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ObjectLiteral
lib/guard/index.ts:118:12
   }
   if (WRITE_COMMANDS.has(head)) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
-    return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
+    return {};
   }
   if (READ_COMMANDS.has(head)) return { level: 'none' };
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected undefined to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:120:7
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
   }
-  if (READ_COMMANDS.has(head)) return { level: 'none' };
+  if (true) return { level: 'none' };
   if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
   return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
killedBy: classifyStatement: Redis 未知命令 fail-closed：query 通道 danger、execute 通道 warning
statusReason: expected 'none' to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:120:7
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
   }
-  if (READ_COMMANDS.has(head)) return { level: 'none' };
+  if (false) return { level: 'none' };
   if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
   return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
killedBy: classifyStatement: Redis 读命令 none、写命令 warning
statusReason: expected 'danger' to be 'none' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:121:7
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
   }
   if (READ_COMMANDS.has(head)) return { level: 'none' };
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
+  if (false) return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
   return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
 }
killedBy: classifyStatement: Redis 未知命令 fail-closed：query 通道 danger、execute 通道 warning
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] EqualityOperator
lib/guard/index.ts:121:7
     return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
   }
   if (READ_COMMANDS.has(head)) return { level: 'none' };
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
+  if (op !== 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
   return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
 }
killedBy: classifyStatement: Redis 未知命令 fail-closed：query 通道 danger、execute 通道 warning
statusReason: expected 'warning' to be 'danger' // Object.is equality

[Killed] BlockStatement
lib/guard/index.ts:128:82
 /* ---------------- MongoDB ---------------- */
 
 /** MongoDB 命令：JSON 对象，首键为操作名 */
-function classifyMongo(statement: string, op: 'query' | 'execute'): GuardVerdict {
-  let head = '';
-  try {
-    const parsed: unknown = JSON.parse(statement);
-    if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-      head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
-    }
-  } catch {
-    return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
-  }
-  if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
-
-  if (DANGEROUS_OPS.has(head)) {
-    return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
-  }
-  if (MONGO_WRITE_OPS.has(head)) {
-    if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
-    return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
-  }
-  if (MONGO_READ_OPS.has(head)) return { level: 'none' };
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
-  return { level: 'none' };
-}
+function classifyMongo(statement: string, op: 'query' | 'execute'): GuardVerdict {}
 
 /* ---------------- ChallengeStore ---------------- */
killedBy: classifyStatement: MongoDB 危险操作 danger（8 项清单）
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] BlockStatement
lib/guard/index.ts:130:7
 /** MongoDB 命令：JSON 对象，首键为操作名 */
 function classifyMongo(statement: string, op: 'query' | 'execute'): GuardVerdict {
   let head = '';
-  try {
-    const parsed: unknown = JSON.parse(statement);
-    if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-      head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
-    }
-  } catch {
+  try {} catch {
     return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
   }
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] EqualityOperator
lib/guard/index.ts:132:19
   let head = '';
   try {
     const parsed: unknown = JSON.parse(statement);
-    if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+    if (parsed && typeof parsed !== 'object' && !Array.isArray(parsed)) {
       head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
     }
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] BlockStatement
lib/guard/index.ts:132:73
   let head = '';
   try {
     const parsed: unknown = JSON.parse(statement);
-    if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-      head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
-    }
+    if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {}
   } catch {
     return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] LogicalOperator
lib/guard/index.ts:133:14
   try {
     const parsed: unknown = JSON.parse(statement);
     if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-      head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
+      head = Object.keys(parsed as Record<string, unknown>)[0] && '';
     }
   } catch {
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[NoCoverage] StringLiteral
lib/guard/index.ts:133:67
   try {
     const parsed: unknown = JSON.parse(statement);
     if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-      head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
+      head = Object.keys(parsed as Record<string, unknown>)[0] ?? "Stryker was here!";
     }
   } catch {

[Survived] BlockStatement
lib/guard/index.ts:135:11
     if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
       head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
     }
-  } catch {
-    return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
-  }
+  } catch {}
   if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
 

[Killed] ConditionalExpression
lib/guard/index.ts:138:7
   } catch {
     return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
   }
-  if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+  if (true) return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
 
   if (DANGEROUS_OPS.has(head)) {
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] EqualityOperator
lib/guard/index.ts:138:7
   } catch {
     return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
   }
-  if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+  if (head !== '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
 
   if (DANGEROUS_OPS.has(head)) {
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:140:7
   }
   if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
 
-  if (DANGEROUS_OPS.has(head)) {
+  if (false) {
     return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
   }
killedBy: classifyStatement: MongoDB 危险操作 danger（8 项清单）
statusReason: expected 'none' to be 'danger' // Object.is equality

[Killed] BlockStatement
lib/guard/index.ts:140:32
   }
   if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
 
-  if (DANGEROUS_OPS.has(head)) {
-    return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
-  }
+  if (DANGEROUS_OPS.has(head)) {}
   if (MONGO_WRITE_OPS.has(head)) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
killedBy: classifyStatement: MongoDB 危险操作 danger（8 项清单）
statusReason: expected 'none' to be 'danger' // Object.is equality

[Killed] ObjectLiteral
lib/guard/index.ts:141:12
   if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
 
   if (DANGEROUS_OPS.has(head)) {
-    return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
+    return {};
   }
   if (MONGO_WRITE_OPS.has(head)) {
killedBy: classifyStatement: MongoDB 危险操作 danger（8 项清单）
statusReason: expected undefined to be 'danger' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:143:7
   if (DANGEROUS_OPS.has(head)) {
     return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
   }
-  if (MONGO_WRITE_OPS.has(head)) {
+  if (true) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'none' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:143:7
   if (DANGEROUS_OPS.has(head)) {
     return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
   }
-  if (MONGO_WRITE_OPS.has(head)) {
+  if (false) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'none' to be 'warning' // Object.is equality

[Killed] EqualityOperator
lib/guard/index.ts:144:9
     return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
   }
   if (MONGO_WRITE_OPS.has(head)) {
-    if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+    if (op !== 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:144:9
     return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
   }
   if (MONGO_WRITE_OPS.has(head)) {
-    if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+    if (true) return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'warning' // Object.is equality

[Killed] ObjectLiteral
lib/guard/index.ts:145:12
   }
   if (MONGO_WRITE_OPS.has(head)) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
-    return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
+    return {};
   }
   if (MONGO_READ_OPS.has(head)) return { level: 'none' };
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected undefined to be 'warning' // Object.is equality

[Killed] StringLiteral
lib/guard/index.ts:145:21
   }
   if (MONGO_WRITE_OPS.has(head)) {
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
-    return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
+    return { level: "", reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
   if (MONGO_READ_OPS.has(head)) return { level: 'none' };
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected '' to be 'warning' // Object.is equality

[Killed] ConditionalExpression
lib/guard/index.ts:147:7
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
-  if (MONGO_READ_OPS.has(head)) return { level: 'none' };
+  if (false) return { level: 'none' };
   if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
   return { level: 'none' };
killedBy: classifyStatement: MongoDB 写操作 warning、读操作 none
statusReason: expected 'danger' to be 'none' // Object.is equality

[Survived] ConditionalExpression
lib/guard/index.ts:147:7
     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
-  if (MONGO_READ_OPS.has(head)) return { level: 'none' };
+  if (true) return { level: 'none' };
   if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
   return { level: 'none' };

[NoCoverage] ConditionalExpression
lib/guard/index.ts:148:7
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
   if (MONGO_READ_OPS.has(head)) return { level: 'none' };
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+  if (false) return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
   return { level: 'none' };
 }

[NoCoverage] ConditionalExpression
lib/guard/index.ts:148:7
     return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
   }
   if (MONGO_READ_OPS.has(head)) return { level: 'none' };
-  if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+  if (true) return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
   return { level: 'none' };
 }

[Killed] BooleanLiteral
lib/guard/index.ts:188:22
   private readonly nowFn: () => number;
   private readonly map = new Map<string, Challenge>();
   private timer: NodeJS.Timeout | undefined;
-  private disposed = false;
+  private disposed = true;
 
   constructor(opts?: ChallengeStoreOptions) {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: ChallengeStore 已关闭

[Killed] BlockStatement
lib/guard/index.ts:190:45
   private timer: NodeJS.Timeout | undefined;
   private disposed = false;
 
-  constructor(opts?: ChallengeStoreOptions) {
-    this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
-    this.nowFn = opts?.now ?? (() => Date.now());
-    const interval = opts?.sweepIntervalMs ?? 60 * 1000;
-    if (interval > 0) {
-      this.timer = setInterval(() => this.sweep(), interval);
-      this.timer.unref?.();
-    }
-  }
+  constructor(opts?: ChallengeStoreOptions) {}
 
   /** 生成绑定语句+作用域的一次性 challenge */
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected { ok: false, …(2) } to match object { ok: false, …(1) }
(1 matching property omitted from actual)

[Killed] OptionalChaining
lib/guard/index.ts:191:16
   private disposed = false;
 
   constructor(opts?: ChallengeStoreOptions) {
-    this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+    this.ttl = opts.ttlMs ?? 5 * 60 * 1000;
     this.nowFn = opts?.now ?? (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: Cannot read properties of undefined (reading 'ttlMs')

[Killed] LogicalOperator
lib/guard/index.ts:191:16
   private disposed = false;
 
   constructor(opts?: ChallengeStoreOptions) {
-    this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+    this.ttl = opts?.ttlMs && 5 * 60 * 1000;
     this.nowFn = opts?.now ?? (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
killedBy: ChallengeStore sweep 清理过期项
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
lib/guard/index.ts:192:18
 
   constructor(opts?: ChallengeStoreOptions) {
     this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
-    this.nowFn = opts?.now ?? (() => Date.now());
+    this.nowFn = opts.now ?? (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
     if (interval > 0) {
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: Cannot read properties of undefined (reading 'now')

[Killed] LogicalOperator
lib/guard/index.ts:192:18
 
   constructor(opts?: ChallengeStoreOptions) {
     this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
-    this.nowFn = opts?.now ?? (() => Date.now());
+    this.nowFn = opts?.now && (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
     if (interval > 0) {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: this.nowFn is not a function

[Killed] OptionalChaining
lib/guard/index.ts:193:22
   constructor(opts?: ChallengeStoreOptions) {
     this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
     this.nowFn = opts?.now ?? (() => Date.now());
-    const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+    const interval = opts.sweepIntervalMs ?? 60 * 1000;
     if (interval > 0) {
       this.timer = setInterval(() => this.sweep(), interval);
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: Cannot read properties of undefined (reading 'sweepIntervalMs')

[Survived] ArithmeticOperator
lib/guard/index.ts:193:47
   constructor(opts?: ChallengeStoreOptions) {
     this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
     this.nowFn = opts?.now ?? (() => Date.now());
-    const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+    const interval = opts?.sweepIntervalMs ?? 60 / 1000;
     if (interval > 0) {
       this.timer = setInterval(() => this.sweep(), interval);

[Survived] EqualityOperator
lib/guard/index.ts:194:9
     this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
     this.nowFn = opts?.now ?? (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
-    if (interval > 0) {
+    if (interval >= 0) {
       this.timer = setInterval(() => this.sweep(), interval);
       this.timer.unref?.();

[Survived] EqualityOperator
lib/guard/index.ts:194:9
     this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
     this.nowFn = opts?.now ?? (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
-    if (interval > 0) {
+    if (interval <= 0) {
       this.timer = setInterval(() => this.sweep(), interval);
       this.timer.unref?.();

[Survived] ArrowFunction
lib/guard/index.ts:195:32
     this.nowFn = opts?.now ?? (() => Date.now());
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
     if (interval > 0) {
-      this.timer = setInterval(() => this.sweep(), interval);
+      this.timer = setInterval(() => undefined, interval);
       this.timer.unref?.();
     }

[Survived] OptionalChaining
lib/guard/index.ts:196:7
     const interval = opts?.sweepIntervalMs ?? 60 * 1000;
     if (interval > 0) {
       this.timer = setInterval(() => this.sweep(), interval);
-      this.timer.unref?.();
+      this.timer.unref();
     }
   }

[Killed] BlockStatement
lib/guard/index.ts:201:64
   }
 
   /** 生成绑定语句+作用域的一次性 challenge */
-  create(statement: string, scope?: ChallengeScope): Challenge {
-    if (this.disposed) throw new Error('ChallengeStore 已关闭');
-    const now = this.nowFn();
-    const ch: Challenge = {
-      id: 'c_' + randomBytes(12).toString('hex'),
-      statementHash: statementHash(statement),
-      createdAt: now,
-      expiresAt: now + this.ttl,
-      ...(scope ? { connId: scope.connId, projectKey: scope.projectKey } : {}),
-    };
-    this.map.set(ch.id, ch);
-    return ch;
-  }
+  create(statement: string, scope?: ChallengeScope): Challenge {}
 
   /** 一次性消费：存在 + 未过期 + hash 与作用域一致才通过，且立即失效；否则 false（不改状态） */
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: Cannot destructure property 'id' of 'this.challenges.create(...)' as it is undefined.

[Killed] ConditionalExpression
lib/guard/index.ts:202:9
 
   /** 生成绑定语句+作用域的一次性 challenge */
   create(statement: string, scope?: ChallengeScope): Challenge {
-    if (this.disposed) throw new Error('ChallengeStore 已关闭');
+    if (true) throw new Error('ChallengeStore 已关闭');
     const now = this.nowFn();
     const ch: Challenge = {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: ChallengeStore 已关闭

[Killed] ConditionalExpression
lib/guard/index.ts:202:9
 
   /** 生成绑定语句+作用域的一次性 challenge */
   create(statement: string, scope?: ChallengeScope): Challenge {
-    if (this.disposed) throw new Error('ChallengeStore 已关闭');
+    if (false) throw new Error('ChallengeStore 已关闭');
     const now = this.nowFn();
     const ch: Challenge = {
killedBy: DbToolService.dispose dispose 后 ChallengeStore 停用（create 抛错）
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
lib/guard/index.ts:205:11
     if (this.disposed) throw new Error('ChallengeStore 已关闭');
     const now = this.nowFn();
     const ch: Challenge = {
-      id: 'c_' + randomBytes(12).toString('hex'),
+      id: "" + randomBytes(12).toString('hex'),
       statementHash: statementHash(statement),
       createdAt: now,
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: expected '880ae2f658672698c2d30994' to match /^c_[0-9a-f]{24}$/

[Killed] ArithmeticOperator
lib/guard/index.ts:208:18
       id: 'c_' + randomBytes(12).toString('hex'),
       statementHash: statementHash(statement),
       createdAt: now,
-      expiresAt: now + this.ttl,
+      expiresAt: now - this.ttl,
       ...(scope ? { connId: scope.connId, projectKey: scope.projectKey } : {}),
     };
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起

[Killed] CallExpression
lib/guard/index.ts:211:5
       expiresAt: now + this.ttl,
       ...(scope ? { connId: scope.connId, projectKey: scope.projectKey } : {}),
     };
-    this.map.set(ch.id, ch);
+    ;
     return ch;
   }
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起

[Killed] BlockStatement
lib/guard/index.ts:216:75
   }
 
   /** 一次性消费：存在 + 未过期 + hash 与作用域一致才通过，且立即失效；否则 false（不改状态） */
-  consume(id: string, statement: string, scope?: ChallengeScope): boolean {
-    const ch = this.map.get(id);
-    if (!ch) return false;
-    this.map.delete(id); // 无论成败都取走，防重放探测
-    if (this.nowFn() > ch.expiresAt) return false;
-    if (ch.statementHash !== statementHash(statement)) return false;
-    // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
-    if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
-    if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
-    return true;
-  }
+  consume(id: string, statement: string, scope?: ChallengeScope): boolean {}
 
   /** 清理过期项 */
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起

[Killed] ConditionalExpression
lib/guard/index.ts:218:9
   /** 一次性消费：存在 + 未过期 + hash 与作用域一致才通过，且立即失效；否则 false（不改状态） */
   consume(id: string, statement: string, scope?: ChallengeScope): boolean {
     const ch = this.map.get(id);
-    if (!ch) return false;
+    if (true) return false;
     this.map.delete(id); // 无论成败都取走，防重放探测
     if (this.nowFn() > ch.expiresAt) return false;
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起

[Killed] ConditionalExpression
lib/guard/index.ts:218:9
   /** 一次性消费：存在 + 未过期 + hash 与作用域一致才通过，且立即失效；否则 false（不改状态） */
   consume(id: string, statement: string, scope?: ChallengeScope): boolean {
     const ch = this.map.get(id);
-    if (!ch) return false;
+    if (false) return false;
     this.map.delete(id); // 无论成败都取走，防重放探测
     if (this.nowFn() > ch.expiresAt) return false;
killedBy: DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'INVALID_CHALLENGE' }

[Killed] CallExpression
lib/guard/index.ts:219:5
   consume(id: string, statement: string, scope?: ChallengeScope): boolean {
     const ch = this.map.get(id);
     if (!ch) return false;
-    this.map.delete(id); // 无论成败都取走，防重放探测
+    ; // 无论成败都取走，防重放探测
     if (this.nowFn() > ch.expiresAt) return false;
     if (ch.statementHash !== statementHash(statement)) return false;
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: true, data: { …(2) } } to match object { Object (ok, code) }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/guard/index.ts:220:9
     const ch = this.map.get(id);
     if (!ch) return false;
     this.map.delete(id); // 无论成败都取走，防重放探测
-    if (this.nowFn() > ch.expiresAt) return false;
+    if (false) return false;
     if (ch.statementHash !== statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
killedBy: ChallengeStore TTL 过期后 consume 失败
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/guard/index.ts:220:45
     const ch = this.map.get(id);
     if (!ch) return false;
     this.map.delete(id); // 无论成败都取走，防重放探测
-    if (this.nowFn() > ch.expiresAt) return false;
+    if (this.nowFn() > ch.expiresAt) return true;
     if (ch.statementHash !== statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
killedBy: ChallengeStore TTL 过期后 consume 失败
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/guard/index.ts:221:63
     if (!ch) return false;
     this.map.delete(id); // 无论成败都取走，防重放探测
     if (this.nowFn() > ch.expiresAt) return false;
-    if (ch.statementHash !== statementHash(statement)) return false;
+    if (ch.statementHash !== statementHash(statement)) return true;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
     if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
killedBy: DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Killed] EqualityOperator
lib/guard/index.ts:221:9
     if (!ch) return false;
     this.map.delete(id); // 无论成败都取走，防重放探测
     if (this.nowFn() > ch.expiresAt) return false;
-    if (ch.statementHash !== statementHash(statement)) return false;
+    if (ch.statementHash === statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
     if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
lib/guard/index.ts:223:36
     if (this.nowFn() > ch.expiresAt) return false;
     if (ch.statementHash !== statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
-    if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+    if (ch.connId !== undefined && ch.connId === scope?.connId) return false;
     if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
     return true;
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/guard/index.ts:223:9
     if (this.nowFn() > ch.expiresAt) return false;
     if (ch.statementHash !== statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
-    if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+    if (true) return false;
     if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
     return true;
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)
