[Survived] EqualityOperator
lib/guard/index.ts:87:9
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (op !== 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 1 more test!

[Survived] StringLiteral
lib/guard/index.ts:87:16
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (op === "") return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 1 more test!

[Survived] ObjectLiteral
lib/guard/index.ts:87:32
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (op === 'query') return {};
Tests ran:
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] StringLiteral
lib/guard/index.ts:87:41
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (op === 'query') return { level: "", reason: '只读通道（query）出现写语句，需要确认' };
Tests ran:
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] StringLiteral
lib/guard/index.ts:87:59
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (op === 'query') return { level: 'danger', reason: "" };
Tests ran:
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] ObjectLiteral
lib/guard/index.ts:88:12
-       return { level: 'warning', reason: '写操作将修改数据' };
+       return {};
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] ConditionalExpression
lib/guard/index.ts:90:7
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+     if (true) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
Tests ran:
    classifyStatement: SQL 系 维护命令为 danger
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:88:21
-       return { level: 'warning', reason: '写操作将修改数据' };
+       return { level: "", reason: '写操作将修改数据' };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] ConditionalExpression
lib/guard/index.ts:90:7
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+     if (false) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
Tests ran:
    classifyStatement: SQL 系 维护命令为 danger
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:88:40
-       return { level: 'warning', reason: '写操作将修改数据' };
+       return { level: 'warning', reason: "" };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] StringLiteral
lib/guard/index.ts:90:53
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+     if (SQL_MAINT_RE.test(statement)) return { level: "", reason: '维护/管理命令影响服务器状态，需要确认' };
Tests ran:
    classifyStatement: SQL 系 维护命令为 danger

[Survived] ObjectLiteral
lib/guard/index.ts:90:44
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+     if (SQL_MAINT_RE.test(statement)) return {};
Tests ran:
    classifyStatement: SQL 系 维护命令为 danger

[Survived] StringLiteral
lib/guard/index.ts:90:71
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: "" };
Tests ran:
    classifyStatement: SQL 系 维护命令为 danger

[Survived] ConditionalExpression
lib/guard/index.ts:93:7
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (true) return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] EqualityOperator
lib/guard/index.ts:93:7
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (op !== 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:93:14
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (op === "") return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] ConditionalExpression
lib/guard/index.ts:93:7
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (false) return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] ObjectLiteral
lib/guard/index.ts:93:30
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (op === 'query') return {};
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:93:39
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (op === 'query') return { level: "", reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] ObjectLiteral
lib/guard/index.ts:94:10
-     return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
+     return {};
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:93:57
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (op === 'query') return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:94:19
-     return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
+     return { level: "", reason: `未识别的语句类型（${head}），请确认后执行` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:94:38
-     return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
+     return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] MethodExpression
lib/guard/index.ts:101:16
-     const head = (parts[0] ?? '').toUpperCase();
+     const head = (parts[0] ?? '').toLowerCase();
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] BlockStatement
lib/guard/index.ts:99:57
-   function classifyRedis(statement: string): GuardVerdict {
-     const parts = parseRedisCommand(statement);
-     const head = (parts[0] ?? '').toUpperCase();
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
-     if (DANGEROUS_COMMANDS.has(head)) {
-       return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
-     }
-     if (WRITE_COMMANDS.has(head)) {
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
-     }
-     if (READ_COMMANDS.has(head)) return { level: 'none' };
-     return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
-   }
+   function classifyRedis(statement: string): GuardVerdict {}
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] LogicalOperator
lib/guard/index.ts:101:17
-     const head = (parts[0] ?? '').toUpperCase();
+     const head = (parts[0] && '').toUpperCase();
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] ConditionalExpression
lib/guard/index.ts:102:7
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (true) return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] ConditionalExpression
lib/guard/index.ts:102:7
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (false) return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] EqualityOperator
lib/guard/index.ts:102:7
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head !== '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] StringLiteral
lib/guard/index.ts:102:16
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === "Stryker was here!") return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] ConditionalExpression
lib/guard/index.ts:104:7
-     if (DANGEROUS_COMMANDS.has(head)) {
+     if (true) {
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] ConditionalExpression
lib/guard/index.ts:104:7
-     if (DANGEROUS_COMMANDS.has(head)) {
+     if (false) {
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] BlockStatement
lib/guard/index.ts:104:37
-     if (DANGEROUS_COMMANDS.has(head)) {
-       return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
-     }
+     if (DANGEROUS_COMMANDS.has(head)) {}
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] ObjectLiteral
lib/guard/index.ts:105:12
-       return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
+       return {};
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] StringLiteral
lib/guard/index.ts:105:21
-       return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
+       return { level: "", reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] StringLiteral
lib/guard/index.ts:105:39
-       return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
+       return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] ConditionalExpression
lib/guard/index.ts:107:7
-     if (WRITE_COMMANDS.has(head)) {
+     if (true) {
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
    classifyStatement: Redis 未知命令 warning

[Survived] ConditionalExpression
lib/guard/index.ts:107:7
-     if (WRITE_COMMANDS.has(head)) {
+     if (false) {
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
    classifyStatement: Redis 未知命令 warning

[Survived] BlockStatement
lib/guard/index.ts:107:33
-     if (WRITE_COMMANDS.has(head)) {
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
-     }
+     if (WRITE_COMMANDS.has(head)) {}
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] ObjectLiteral
lib/guard/index.ts:108:12
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
+       return {};
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] StringLiteral
lib/guard/index.ts:108:21
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
+       return { level: "", reason: `Redis 写命令 ${head} 将修改数据` };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] StringLiteral
lib/guard/index.ts:108:40
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
+       return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] ConditionalExpression
lib/guard/index.ts:110:7
-     if (READ_COMMANDS.has(head)) return { level: 'none' };
+     if (true) return { level: 'none' };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
    classifyStatement: Redis 未知命令 warning

[Survived] ConditionalExpression
lib/guard/index.ts:110:7
-     if (READ_COMMANDS.has(head)) return { level: 'none' };
+     if (false) return { level: 'none' };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
    classifyStatement: Redis 未知命令 warning

[Survived] ObjectLiteral
lib/guard/index.ts:110:39
-     if (READ_COMMANDS.has(head)) return { level: 'none' };
+     if (READ_COMMANDS.has(head)) return {};
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] StringLiteral
lib/guard/index.ts:110:48
-     if (READ_COMMANDS.has(head)) return { level: 'none' };
+     if (READ_COMMANDS.has(head)) return { level: "" };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] ObjectLiteral
lib/guard/index.ts:111:10
-     return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
+     return {};
Tests ran:
    classifyStatement: Redis 未知命令 warning

[Survived] StringLiteral
lib/guard/index.ts:111:38
-     return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
+     return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: Redis 未知命令 warning

[Survived] StringLiteral
lib/guard/index.ts:111:19
-     return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
+     return { level: "", reason: `未识别的 Redis 命令（${head}），请确认后执行` };
Tests ran:
    classifyStatement: Redis 未知命令 warning

[Survived] BlockStatement
lib/guard/index.ts:117:57
-   function classifyMongo(statement: string): GuardVerdict {
-     let head = '';
-     try {
-       const parsed: unknown = JSON.parse(statement);
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-         head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
-       }
-     } catch {
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
-     }
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
-     if (DANGEROUS_OPS.has(head)) {
-       return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
-     }
-     if (MONGO_WRITE_OPS.has(head)) {
-       return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
-     }
-     return { level: 'none' };
-   }
+   function classifyMongo(statement: string): GuardVerdict {}
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none
    classifyStatement: MongoDB 非法 JSON danger

[Survived] StringLiteral
lib/guard/index.ts:118:14
-     let head = '';
+     let head = "Stryker was here!";
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none
    classifyStatement: MongoDB 非法 JSON danger

[Survived] BlockStatement
lib/guard/index.ts:119:7
-     try {
-       const parsed: unknown = JSON.parse(statement);
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-         head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
-       }
-     } catch {
+     try {} catch {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none
    classifyStatement: MongoDB 非法 JSON danger

[Survived] ConditionalExpression
lib/guard/index.ts:121:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (true) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:121:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (false) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] LogicalOperator
lib/guard/index.ts:121:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && typeof parsed === 'object' || !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:121:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (true && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] LogicalOperator
lib/guard/index.ts:121:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed || typeof parsed === 'object' && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:121:19
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && true && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] EqualityOperator
lib/guard/index.ts:121:19
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && typeof parsed !== 'object' && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:121:37
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && typeof parsed === "" && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] BooleanLiteral
lib/guard/index.ts:121:49
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && typeof parsed === 'object' && Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] BlockStatement
lib/guard/index.ts:124:11
-     } catch {
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
-     }
+     } catch {}
Tests ran:
    classifyStatement: MongoDB 非法 JSON danger

[Survived] BlockStatement
lib/guard/index.ts:121:73
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
-         head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
-       }
+       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {}
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] LogicalOperator
lib/guard/index.ts:122:14
-         head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
+         head = Object.keys(parsed as Record<string, unknown>)[0] && '';
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ObjectLiteral
lib/guard/index.ts:125:12
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
+       return {};
Tests ran:
    classifyStatement: MongoDB 非法 JSON danger

[Survived] StringLiteral
lib/guard/index.ts:125:21
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
+       return { level: "", reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 非法 JSON danger

[Survived] ConditionalExpression
lib/guard/index.ts:127:7
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (true) return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:125:39
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
+       return { level: 'danger', reason: "" };
Tests ran:
    classifyStatement: MongoDB 非法 JSON danger

[Survived] ConditionalExpression
lib/guard/index.ts:127:7
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (false) return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:127:16
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === "Stryker was here!") return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] EqualityOperator
lib/guard/index.ts:127:7
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head !== '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:129:7
-     if (DANGEROUS_OPS.has(head)) {
+     if (true) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:129:7
-     if (DANGEROUS_OPS.has(head)) {
+     if (false) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] BlockStatement
lib/guard/index.ts:129:32
-     if (DANGEROUS_OPS.has(head)) {
-       return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
-     }
+     if (DANGEROUS_OPS.has(head)) {}
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）

[Survived] ObjectLiteral
lib/guard/index.ts:130:12
-       return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
+       return {};
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）

[Survived] StringLiteral
lib/guard/index.ts:130:21
-       return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
+       return { level: "", reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）

[Survived] StringLiteral
lib/guard/index.ts:130:39
-       return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
+       return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）

[Survived] ConditionalExpression
lib/guard/index.ts:132:7
-     if (MONGO_WRITE_OPS.has(head)) {
+     if (true) {
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:132:7
-     if (MONGO_WRITE_OPS.has(head)) {
+     if (false) {
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] BlockStatement
lib/guard/index.ts:132:34
-     if (MONGO_WRITE_OPS.has(head)) {
-       return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
-     }
+     if (MONGO_WRITE_OPS.has(head)) {}
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ObjectLiteral
lib/guard/index.ts:133:12
-       return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
+       return {};
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:133:21
-       return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
+       return { level: "", reason: `MongoDB 写操作 ${head} 将修改数据` };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ObjectLiteral
lib/guard/index.ts:135:10
-     return { level: 'none' };
+     return {};
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:133:40
-       return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
+       return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:135:19
-     return { level: 'none' };
+     return { level: "" };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] LogicalOperator
lib/guard/index.ts:168:16
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+       this.ttl = opts?.ttlMs && 5 * 60 * 1000;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] BlockStatement
lib/guard/index.ts:167:45
-     constructor(opts?: ChallengeStoreOptions) {
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
-       this.nowFn = opts?.now ?? (() => Date.now());
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
-       if (interval > 0) {
-         this.timer = setInterval(() => this.sweep(), interval);
-         this.timer.unref?.();
-       }
-     }
+     constructor(opts?: ChallengeStoreOptions) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] BooleanLiteral
lib/guard/index.ts:165:22
-     private disposed = false;
+     private disposed = true;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:168:16
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+       this.ttl = opts.ttlMs ?? 5 * 60 * 1000;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] ArithmeticOperator
lib/guard/index.ts:168:31
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+       this.ttl = opts?.ttlMs ?? 5 * 60 / 1000;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] ArithmeticOperator
lib/guard/index.ts:168:31
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+       this.ttl = opts?.ttlMs ?? 5 / 60 * 1000;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] LogicalOperator
lib/guard/index.ts:169:18
-       this.nowFn = opts?.now ?? (() => Date.now());
+       this.nowFn = opts?.now && (() => Date.now());
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:169:18
-       this.nowFn = opts?.now ?? (() => Date.now());
+       this.nowFn = opts.now ?? (() => Date.now());
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!
