[Survived] ArrowFunction
lib/guard/index.ts:169:32
-       this.nowFn = opts?.now ?? (() => Date.now());
+       this.nowFn = opts?.now ?? (() => undefined);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] LogicalOperator
lib/guard/index.ts:170:22
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+       const interval = opts?.sweepIntervalMs && 60 * 1000;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:170:22
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+       const interval = opts.sweepIntervalMs ?? 60 * 1000;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:171:9
-       if (interval > 0) {
+       if (true) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:171:9
-       if (interval > 0) {
+       if (false) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:171:9
-       if (interval > 0) {
+       if (interval >= 0) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] BlockStatement
lib/guard/index.ts:178:40
-     create(statement: string): Challenge {
-       if (this.disposed) throw new Error('ChallengeStore 已关闭');
-       const now = this.nowFn();
-       const ch: Challenge = {
-         id: 'c_' + randomBytes(12).toString('hex'),
-         statementHash: statementHash(statement),
-         createdAt: now,
-         expiresAt: now + this.ttl,
-       };
-       this.map.set(ch.id, ch);
-       return ch;
-     }
+     create(statement: string): Challenge {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:171:9
-       if (interval > 0) {
+       if (interval <= 0) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] StringLiteral
lib/guard/index.ts:179:40
-       if (this.disposed) throw new Error('ChallengeStore 已关闭');
+       if (this.disposed) throw new Error("");
Tests ran:
    ChallengeStore dispose 后不可再用

[Survived] ConditionalExpression
lib/guard/index.ts:179:9
-       if (this.disposed) throw new Error('ChallengeStore 已关闭');
+       if (true) throw new Error('ChallengeStore 已关闭');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:179:9
-       if (this.disposed) throw new Error('ChallengeStore 已关闭');
+       if (false) throw new Error('ChallengeStore 已关闭');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 15 more tests!

[Survived] ObjectLiteral
lib/guard/index.ts:181:27
-       const ch: Challenge = {
-         id: 'c_' + randomBytes(12).toString('hex'),
-         statementHash: statementHash(statement),
-         createdAt: now,
-         expiresAt: now + this.ttl,
-       };
+       const ch: Challenge = {};
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] StringLiteral
lib/guard/index.ts:182:11
-         id: 'c_' + randomBytes(12).toString('hex'),
+         id: "" + randomBytes(12).toString('hex'),
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] StringLiteral
lib/guard/index.ts:182:43
-         id: 'c_' + randomBytes(12).toString('hex'),
+         id: 'c_' + randomBytes(12).toString(""),
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] ArithmeticOperator
lib/guard/index.ts:185:18
-         expiresAt: now + this.ttl,
+         expiresAt: now - this.ttl,
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] CallExpression
lib/guard/index.ts:187:5
-       this.map.set(ch.id, ch);
+       ;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] BlockStatement
lib/guard/index.ts:192:51
-     consume(id: string, statement: string): boolean {
-       const ch = this.map.get(id);
-       if (!ch) return false;
-       this.map.delete(id); // 无论成败都取走，防重放探测
-       if (this.nowFn() > ch.expiresAt) return false;
-       return ch.statementHash === statementHash(statement);
-     }
+     consume(id: string, statement: string): boolean {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] BooleanLiteral
lib/guard/index.ts:194:9
-       if (!ch) return false;
+       if (ch) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:194:9
-       if (!ch) return false;
+       if (true) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:194:9
-       if (!ch) return false;
+       if (false) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] BooleanLiteral
lib/guard/index.ts:194:21
-       if (!ch) return false;
+       if (!ch) return true;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    ChallengeStore 一次性：consume 成功后立即失效
  and 2 more tests!

[Survived] CallExpression
lib/guard/index.ts:195:5
-       this.map.delete(id); // 无论成败都取走，防重放探测
+       ; // 无论成败都取走，防重放探测
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:196:9
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (true) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] BooleanLiteral
lib/guard/index.ts:196:45
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (this.nowFn() > ch.expiresAt) return true;
Tests ran:
    ChallengeStore TTL 过期后 consume 失败

[Survived] ConditionalExpression
lib/guard/index.ts:196:9
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (false) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:196:9
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (this.nowFn() <= ch.expiresAt) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:196:9
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (this.nowFn() >= ch.expiresAt) return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] BlockStatement
lib/guard/index.ts:201:17
-     sweep(): void {
-       const now = this.nowFn();
-       for (const [id, ch] of this.map) {
-         if (now > ch.expiresAt) this.map.delete(id);
-       }
-     }
+     sweep(): void {}
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] BlockStatement
lib/guard/index.ts:203:38
-       for (const [id, ch] of this.map) {
-         if (now > ch.expiresAt) this.map.delete(id);
-       }
+       for (const [id, ch] of this.map) {}
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] ConditionalExpression
lib/guard/index.ts:197:12
-       return ch.statementHash === statementHash(statement);
+       return true;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:197:12
-       return ch.statementHash === statementHash(statement);
+       return false;
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:204:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (true) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] ConditionalExpression
lib/guard/index.ts:204:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (false) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:197:12
-       return ch.statementHash === statementHash(statement);
+       return ch.statementHash !== statementHash(statement);
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:204:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now >= ch.expiresAt) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:204:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now <= ch.expiresAt) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] CallExpression
lib/guard/index.ts:204:31
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now > ch.expiresAt) ;
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\s|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\S*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s(global|persist)|select\s+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\S+.*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\supdate\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+.*\bfor\S+update\b/i;
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:38:13
-     'insert', 'insertOne', 'insertMany',
+     'insert', "", 'insertMany',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:38:26
-     'insert', 'insertOne', 'insertMany',
+     'insert', 'insertOne', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:39:3
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
+     "", 'updateMany', 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:39:16
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
+     'updateOne', "", 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:39:30
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
+     'updateOne', 'updateMany', "", 'findOneAndUpdate', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:39:44
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', "", 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:39:64
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:40:3
-     'deleteOne',
+     "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:41:3
-     'createCollection', 'renameCollection',
+     "", 'renameCollection',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:41:23
-     'createCollection', 'renameCollection',
+     'createCollection', "",
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/guard/index.ts:210:9
-       if (this.timer) {
+       if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/guard/index.ts:210:9
-       if (this.timer) {
+       if (false) {
Ran all tests for this mutant.

[Survived] CallExpression
lib/guard/index.ts:214:5
-       this.map.clear();
+       ;
Ran all tests for this mutant.

[Survived] BlockStatement
lib/store/audit.ts:35:46
-     append(entry: AuditEntryInput): AuditEntry {
-       const full: AuditEntry = { ...entry, ts: entry.ts ?? new Date().toISOString() };
-       fs.appendFileSync(this.file, JSON.stringify(full) + '\n', 'utf8');
-       return full;
-     }
+     append(entry: AuditEntryInput): AuditEntry {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 24 more tests!

[Survived] ObjectLiteral
lib/store/audit.ts:36:30
-       const full: AuditEntry = { ...entry, ts: entry.ts ?? new Date().toISOString() };
+       const full: AuditEntry = {};
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 24 more tests!

[Survived] BlockStatement
lib/store/audit.ts:30:28
-     constructor(dir: string) {
-       this.file = path.join(dir, 'audit.jsonl');
-     }
+     constructor(dir: string) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] StringLiteral
lib/store/audit.ts:31:32
-       this.file = path.join(dir, 'audit.jsonl');
+       this.file = path.join(dir, "");
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] LogicalOperator
lib/store/audit.ts:36:46
-       const full: AuditEntry = { ...entry, ts: entry.ts ?? new Date().toISOString() };
+       const full: AuditEntry = { ...entry, ts: entry.ts && new Date().toISOString() };
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 24 more tests!

[Survived] StringLiteral
lib/store/audit.ts:37:57
-       fs.appendFileSync(this.file, JSON.stringify(full) + '\n', 'utf8');
+       fs.appendFileSync(this.file, JSON.stringify(full) + "", 'utf8');
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 24 more tests!

[Survived] BlockStatement
lib/store/audit.ts:42:33
-     tail(n: number): AuditEntry[] {
-       if (!fs.existsSync(this.file)) return [];
-       const lines = fs.readFileSync(this.file, 'utf8').split('\n');
-       const out: AuditEntry[] = [];
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
-         const line = lines[i]?.trim();
-         if (!line) continue;
-         try {
-           out.push(JSON.parse(line) as AuditEntry);
-         } catch {
-           // 跳过损坏行
-         }
-       }
-       return out.reverse();
-     }
+     tail(n: number): AuditEntry[] {}
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 6 more tests!

[Survived] StringLiteral
lib/store/audit.ts:37:63
-       fs.appendFileSync(this.file, JSON.stringify(full) + '\n', 'utf8');
+       fs.appendFileSync(this.file, JSON.stringify(full) + '\n', "");
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 24 more tests!

[Survived] ArrayDeclaration
lib/store/audit.ts:43:43
-       if (!fs.existsSync(this.file)) return [];
+       if (!fs.existsSync(this.file)) return ["Stryker was here"];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 1 more test!

[Survived] ConditionalExpression
lib/store/audit.ts:43:9
-       if (!fs.existsSync(this.file)) return [];
+       if (true) return [];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 6 more tests!

[Survived] BooleanLiteral
lib/store/audit.ts:43:9
-       if (!fs.existsSync(this.file)) return [];
+       if (fs.existsSync(this.file)) return [];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 6 more tests!

[Survived] ConditionalExpression
lib/store/audit.ts:43:9
-       if (!fs.existsSync(this.file)) return [];
+       if (false) return [];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 6 more tests!

[Survived] StringLiteral
lib/store/audit.ts:44:46
-       const lines = fs.readFileSync(this.file, 'utf8').split('\n');
+       const lines = fs.readFileSync(this.file, "").split('\n');
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] StringLiteral
lib/store/audit.ts:44:60
-       const lines = fs.readFileSync(this.file, 'utf8').split('\n');
+       const lines = fs.readFileSync(this.file, 'utf8').split("");
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ArrayDeclaration
lib/store/audit.ts:45:31
-       const out: AuditEntry[] = [];
+       const out: AuditEntry[] = ["Stryker was here"];
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ArithmeticOperator
lib/store/audit.ts:46:18
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length + 1; i >= 0 && out.length < n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/audit.ts:46:36
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; false; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] LogicalOperator
lib/store/audit.ts:46:36
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i >= 0 || out.length < n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/audit.ts:46:36
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; true && out.length < n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] EqualityOperator
lib/store/audit.ts:46:36
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i > 0 && out.length < n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] EqualityOperator
lib/store/audit.ts:46:36
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i < 0 && out.length < n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/audit.ts:46:46
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i >= 0 && true; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] EqualityOperator
lib/store/audit.ts:46:46
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i >= 0 && out.length >= n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] EqualityOperator
lib/store/audit.ts:46:46
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i >= 0 && out.length <= n; i--) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] UpdateOperator
lib/store/audit.ts:46:62
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+       for (let i = lines.length - 1; i >= 0 && out.length < n; i++) {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] BlockStatement
lib/store/audit.ts:46:67
-       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
-         const line = lines[i]?.trim();
-         if (!line) continue;
-         try {
-           out.push(JSON.parse(line) as AuditEntry);
-         } catch {
-           // 跳过损坏行
-         }
-       }
+       for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {}
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!
