[Killed] ConditionalExpression
lib/guard/index.ts:224:9
     if (ch.statementHash !== statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
     if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
-    if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+    if (true) return false;
     return true;
   }
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
lib/guard/index.ts:224:9
     if (ch.statementHash !== statementHash(statement)) return false;
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
     if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
-    if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+    if (ch.projectKey !== undefined || ch.projectKey !== scope?.projectKey) return false;
     return true;
   }
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
lib/guard/index.ts:225:12
     // 作用域绑定：创建时带 scope 则消费时必须完全一致（防同语句跨连接/跨项目重放）
     if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
     if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
-    return true;
+    return false;
   }
 
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Survived] BlockStatement
lib/guard/index.ts:229:17
   }
 
   /** 清理过期项 */
-  sweep(): void {
-    const now = this.nowFn();
-    for (const [id, ch] of this.map) {
-      if (now > ch.expiresAt) this.map.delete(id);
-    }
-  }
+  sweep(): void {}
 
   dispose(): void {

[Survived] BlockStatement
lib/guard/index.ts:231:38
   /** 清理过期项 */
   sweep(): void {
     const now = this.nowFn();
-    for (const [id, ch] of this.map) {
-      if (now > ch.expiresAt) this.map.delete(id);
-    }
+    for (const [id, ch] of this.map) {}
   }
 

[Survived] EqualityOperator
lib/guard/index.ts:232:11
   sweep(): void {
     const now = this.nowFn();
     for (const [id, ch] of this.map) {
-      if (now > ch.expiresAt) this.map.delete(id);
+      if (now <= ch.expiresAt) this.map.delete(id);
     }
   }

[Survived] EqualityOperator
lib/guard/index.ts:232:11
   sweep(): void {
     const now = this.nowFn();
     for (const [id, ch] of this.map) {
-      if (now > ch.expiresAt) this.map.delete(id);
+      if (now >= ch.expiresAt) this.map.delete(id);
     }
   }

[Killed] BlockStatement
lib/guard/index.ts:236:19
     }
   }
 
-  dispose(): void {
-    this.disposed = true;
-    if (this.timer) {
-      clearInterval(this.timer);
-      this.timer = undefined;
-    }
-    this.map.clear();
-  }
+  dispose(): void {}
 }
 
killedBy: DbToolService.dispose dispose 后 ChallengeStore 停用（create 抛错）
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
lib/guard/index.ts:237:21
   }
 
   dispose(): void {
-    this.disposed = true;
+    this.disposed = false;
     if (this.timer) {
       clearInterval(this.timer);
killedBy: DbToolService.dispose dispose 后 ChallengeStore 停用（create 抛错）
statusReason: expected [Function] to throw an error

[Survived] ConditionalExpression
lib/guard/index.ts:238:9
 
   dispose(): void {
     this.disposed = true;
-    if (this.timer) {
+    if (true) {
       clearInterval(this.timer);
       this.timer = undefined;

[Survived] ConditionalExpression
lib/guard/index.ts:238:9
 
   dispose(): void {
     this.disposed = true;
-    if (this.timer) {
+    if (false) {
       clearInterval(this.timer);
       this.timer = undefined;

[Survived] CallExpression
lib/guard/index.ts:239:7
   dispose(): void {
     this.disposed = true;
     if (this.timer) {
-      clearInterval(this.timer);
+      ;
       this.timer = undefined;
     }

[Survived] CallExpression
lib/guard/index.ts:242:5
       clearInterval(this.timer);
       this.timer = undefined;
     }
-    this.map.clear();
+    ;
   }
 }
