[Killed] BlockStatement
lib/manager.ts:72:71
   challenges?: ChallengeStore;
 }
 
-function assertNonEmpty(v: string | undefined, label: string): string {
-  const s = typeof v === 'string' ? v.trim() : '';
-  if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
-  return s;
-}
+function assertNonEmpty(v: string | undefined, label: string): string {}
 
 /* ---------------- 服务核心 ---------------- */
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
lib/manager.ts:73:13
 }
 
 function assertNonEmpty(v: string | undefined, label: string): string {
-  const s = typeof v === 'string' ? v.trim() : '';
+  const s = false ? v.trim() : '';
   if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
   return s;
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
lib/manager.ts:73:13
 }
 
 function assertNonEmpty(v: string | undefined, label: string): string {
-  const s = typeof v === 'string' ? v.trim() : '';
+  const s = typeof v !== 'string' ? v.trim() : '';
   if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
   return s;
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: 缺少必填参数: sql

[Killed] ConditionalExpression
lib/manager.ts:74:7
 
 function assertNonEmpty(v: string | undefined, label: string): string {
   const s = typeof v === 'string' ? v.trim() : '';
-  if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+  if (true) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
   return s;
 }
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
lib/manager.ts:74:7
 
 function assertNonEmpty(v: string | undefined, label: string): string {
   const s = typeof v === 'string' ? v.trim() : '';
-  if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+  if (s !== '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
   return s;
 }
killedBy: DbToolService: 构造与错误契约 必填参数为空白或非字符串 → INVALID_ARGUMENT，消息含字段名
statusReason: promise resolved "{ needConfirmation: true, …(4) }" instead of rejecting

[Killed] BooleanLiteral
lib/manager.ts:84:22
   private readonly adapterCache = new Map<string, Promise<DatabaseAdapter>>();
   readonly challenges: ChallengeStore;
   private readonly resolver: (kind: DbKind) => Promise<AdapterFactory>;
-  private disposed = false;
+  private disposed = true;
 
   constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
killedBy: DbToolService: 构造与错误契约 仅注入 adapterResolver（不传 challenges）→ 默认 ChallengeStore 走危险确认流程
statusReason: 服务已关闭

[Killed] BlockStatement
lib/manager.ts:86:73
   private readonly resolver: (kind: DbKind) => Promise<AdapterFactory>;
   private disposed = false;
 
-  constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
-    this.resolver = opts?.adapterResolver ?? getAdapter;
-    this.challenges = opts?.challenges ?? new ChallengeStore();
-  }
+  constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {}
 
   /* -- 连接管理（无需授权） -- */
killedBy: DbToolService: 构造与错误契约 必填参数为空白或非字符串 → INVALID_ARGUMENT，消息含字段名
statusReason: Cannot read properties of undefined (reading 'dispose')

[Killed] LogicalOperator
lib/manager.ts:87:21
   private disposed = false;
 
   constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
-    this.resolver = opts?.adapterResolver ?? getAdapter;
+    this.resolver = opts?.adapterResolver && getAdapter;
     this.challenges = opts?.challenges ?? new ChallengeStore();
   }
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: mysql 查询失败: connect ECONNREFUSED 127.0.0.1:3306

[Killed] OptionalChaining
lib/manager.ts:87:21
   private disposed = false;
 
   constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
-    this.resolver = opts?.adapterResolver ?? getAdapter;
+    this.resolver = opts.adapterResolver ?? getAdapter;
     this.challenges = opts?.challenges ?? new ChallengeStore();
   }
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: Cannot read properties of undefined (reading 'adapterResolver')

[Killed] LogicalOperator
lib/manager.ts:88:23
 
   constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
     this.resolver = opts?.adapterResolver ?? getAdapter;
-    this.challenges = opts?.challenges ?? new ChallengeStore();
+    this.challenges = opts?.challenges && new ChallengeStore();
   }
 
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: expected undefined to be defined

[Killed] OptionalChaining
lib/manager.ts:88:23
 
   constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
     this.resolver = opts?.adapterResolver ?? getAdapter;
-    this.challenges = opts?.challenges ?? new ChallengeStore();
+    this.challenges = opts.challenges ?? new ChallengeStore();
   }
 
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: Cannot read properties of undefined (reading 'challenges')

[Killed] BlockStatement
lib/manager.ts:93:39
 
   /* -- 连接管理（无需授权） -- */
 
-  listConnections(): ConnectionMeta[] {
-    return this.store.connections.list();
-  }
+  listConnections(): ConnectionMeta[] {}
 
   createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {
killedBy: DbToolService: 构造与错误契约 默认构造（不传 opts）成功，listConnections 与默认 ChallengeStore 可用
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
lib/manager.ts:97:96
     return this.store.connections.list();
   }
 
-  createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {
-    const meta = this.store.connections.create(input);
-    this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
-    return meta;
-  }
+  createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {}
 
   updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {
killedBy: DbToolService: 构造与错误契约 createConnection 写入审计：projectPathKey 为空、ok=true、confirmed=false
statusReason: expected undefined to match object { projectPathKey: '', …(6) }

[Killed] BooleanLiteral
lib/manager.ts:99:76
 
   createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {
     const meta = this.store.connections.create(input);
-    this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+    this.audit('', input.id, 'create_connection', input.id, 'none', false, false);
     return meta;
   }
killedBy: DbToolService: 构造与错误契约 createConnection 写入审计：projectPathKey 为空、ok=true、confirmed=false
statusReason: expected { projectPathKey: '', …(7) } to match object { projectPathKey: '', …(6) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/manager.ts:99:69
 
   createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {
     const meta = this.store.connections.create(input);
-    this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+    this.audit('', input.id, 'create_connection', input.id, 'none', true, true);
     return meta;
   }
killedBy: DbToolService: 构造与错误契约 createConnection 写入审计：projectPathKey 为空、ok=true、confirmed=false
statusReason: expected { projectPathKey: '', …(7) } to match object { projectPathKey: '', …(6) }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/manager.ts:103:108
     return meta;
   }
 
-  updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {
-    const meta = this.store.connections.update(id, patch);
-    if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
-    // url/凭证/ssl 变更后旧适配器仍持旧连接串，必须作废重建
-    void this.dropAdapters(id);
-    this.audit('', id, 'update_connection', id, 'none', false, true);
-    return meta;
-  }
+  updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {}
 
   removeConnection(id: string): boolean {
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
lib/manager.ts:105:9
 
   updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {
     const meta = this.store.connections.update(id, patch);
-    if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+    if (true) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     // url/凭证/ssl 变更后旧适配器仍持旧连接串，必须作废重建
     void this.dropAdapters(id);
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
lib/manager.ts:105:9
 
   updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {
     const meta = this.store.connections.update(id, patch);
-    if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+    if (meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     // url/凭证/ssl 变更后旧适配器仍持旧连接串，必须作废重建
     void this.dropAdapters(id);
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] BooleanLiteral
lib/manager.ts:108:57
     if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     // url/凭证/ssl 变更后旧适配器仍持旧连接串，必须作废重建
     void this.dropAdapters(id);
-    this.audit('', id, 'update_connection', id, 'none', false, true);
+    this.audit('', id, 'update_connection', id, 'none', true, true);
     return meta;
   }

[Survived] BooleanLiteral
lib/manager.ts:108:64
     if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     // url/凭证/ssl 变更后旧适配器仍持旧连接串，必须作废重建
     void this.dropAdapters(id);
-    this.audit('', id, 'update_connection', id, 'none', false, true);
+    this.audit('', id, 'update_connection', id, 'none', false, false);
     return meta;
   }

[Killed] BlockStatement
lib/manager.ts:112:41
     return meta;
   }
 
-  removeConnection(id: string): boolean {
-    const ok = this.store.connections.remove(id);
-    if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
-    void this.dropAdapters(id);
-    this.audit('', id, 'remove_connection', id, 'none', false, true);
-    return ok;
-  }
+  removeConnection(id: string): boolean {}
 
   async testConnection(id: string): Promise<TestConnectResult> {
killedBy: DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
lib/manager.ts:114:9
 
   removeConnection(id: string): boolean {
     const ok = this.store.connections.remove(id);
-    if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+    if (true) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     void this.dropAdapters(id);
     this.audit('', id, 'remove_connection', id, 'none', false, true);
killedBy: DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
statusReason: 连接不存在: c1

[Killed] BooleanLiteral
lib/manager.ts:114:9
 
   removeConnection(id: string): boolean {
     const ok = this.store.connections.remove(id);
-    if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+    if (ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     void this.dropAdapters(id);
     this.audit('', id, 'remove_connection', id, 'none', false, true);
killedBy: DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
statusReason: expected function to throw an error, but it didn't

[Survived] BooleanLiteral
lib/manager.ts:116:64
     const ok = this.store.connections.remove(id);
     if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     void this.dropAdapters(id);
-    this.audit('', id, 'remove_connection', id, 'none', false, true);
+    this.audit('', id, 'remove_connection', id, 'none', false, false);
     return ok;
   }

[Survived] BooleanLiteral
lib/manager.ts:116:57
     const ok = this.store.connections.remove(id);
     if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
     void this.dropAdapters(id);
-    this.audit('', id, 'remove_connection', id, 'none', false, true);
+    this.audit('', id, 'remove_connection', id, 'none', true, true);
     return ok;
   }

[NoCoverage] BlockStatement
lib/manager.ts:120:64
     return ok;
   }
 
-  async testConnection(id: string): Promise<TestConnectResult> {
-    const rc = this.requireConn(id);
-    try {
-      const factory = await this.resolver(rc.meta.kind);
-      const adapter = await factory(rc);
-      try {
-        return await adapter.testConnect();
-      } finally {
-        await adapter.close().catch(() => {});
-      }
-    } catch (e) {
-      throw this.toDriverError(e);
-    }
-  }
+  async testConnection(id: string): Promise<TestConnectResult> {}
 
   /* -- 授权管理 -- */

[NoCoverage] BlockStatement
lib/manager.ts:122:9
 
   async testConnection(id: string): Promise<TestConnectResult> {
     const rc = this.requireConn(id);
-    try {
-      const factory = await this.resolver(rc.meta.kind);
-      const adapter = await factory(rc);
-      try {
-        return await adapter.testConnect();
-      } finally {
-        await adapter.close().catch(() => {});
-      }
-    } catch (e) {
+    try {} catch (e) {
       throw this.toDriverError(e);
     }

[NoCoverage] BlockStatement
lib/manager.ts:125:11
     try {
       const factory = await this.resolver(rc.meta.kind);
       const adapter = await factory(rc);
-      try {
-        return await adapter.testConnect();
-      } finally {
+      try {} finally {
         await adapter.close().catch(() => {});
       }

[NoCoverage] BlockStatement
lib/manager.ts:127:17
       const adapter = await factory(rc);
       try {
         return await adapter.testConnect();
-      } finally {
-        await adapter.close().catch(() => {});
-      }
+      } finally {}
     } catch (e) {
       throw this.toDriverError(e);

[NoCoverage] BlockStatement
lib/manager.ts:130:17
       } finally {
         await adapter.close().catch(() => {});
       }
-    } catch (e) {
-      throw this.toDriverError(e);
-    }
+    } catch (e) {}
   }
 

[Killed] BlockStatement
lib/manager.ts:137:75
 
   /* -- 授权管理 -- */
 
-  grantsFor(projectPath: string): { connId: string; mode: 'ro' | 'rw' }[] {
-    return this.store.grants.grantsFor(normalizeProjectKey(projectPath));
-  }
+  grantsFor(projectPath: string): { connId: string; mode: 'ro' | 'rw' }[] {}
 
   grant(projectPath: string, connId: string, mode: 'ro' | 'rw'): void {
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected undefined to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] BlockStatement
lib/manager.ts:141:71
     return this.store.grants.grantsFor(normalizeProjectKey(projectPath));
   }
 
-  grant(projectPath: string, connId: string, mode: 'ro' | 'rw'): void {
-    const key = normalizeProjectKey(projectPath);
-    this.store.grants.grant(key, connId, mode);
-    // 授权模式变更（含 rw→ro 降级）必须作废旧会话适配器，否则降级不生效
-    void this.dropAdapters(connId);
-    this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
-  }
+  grant(projectPath: string, connId: string, mode: 'ro' | 'rw'): void {}
 
   revokeGrant(projectPath: string, connId: string): void {
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ { connId: 'c1', mode: 'rw' } ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] CallExpression
lib/manager.ts:143:5
 
   grant(projectPath: string, connId: string, mode: 'ro' | 'rw'): void {
     const key = normalizeProjectKey(projectPath);
-    this.store.grants.grant(key, connId, mode);
+    ;
     // 授权模式变更（含 rw→ro 降级）必须作废旧会话适配器，否则降级不生效
     void this.dropAdapters(connId);
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ { connId: 'c1', mode: 'rw' } ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Survived] BooleanLiteral
lib/manager.ts:146:77
     this.store.grants.grant(key, connId, mode);
     // 授权模式变更（含 rw→ro 降级）必须作废旧会话适配器，否则降级不生效
     void this.dropAdapters(connId);
-    this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+    this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, false);
   }
 

[Survived] BooleanLiteral
lib/manager.ts:146:70
     this.store.grants.grant(key, connId, mode);
     // 授权模式变更（含 rw→ro 降级）必须作废旧会话适配器，否则降级不生效
     void this.dropAdapters(connId);
-    this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+    this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', true, true);
   }
 

[Survived] BlockStatement
lib/manager.ts:149:58
     this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
   }
 
-  revokeGrant(projectPath: string, connId: string): void {
-    const key = normalizeProjectKey(projectPath);
-    this.store.grants.revoke(key, connId);
-    void this.dropAdapters(connId);
-    this.audit(key, connId, 'revoke', connId, 'none', false, true);
-  }
+  revokeGrant(projectPath: string, connId: string): void {}
 
   /* -- 浏览（ro 即可） -- */

[Survived] CallExpression
lib/manager.ts:151:5
 
   revokeGrant(projectPath: string, connId: string): void {
     const key = normalizeProjectKey(projectPath);
-    this.store.grants.revoke(key, connId);
+    ;
     void this.dropAdapters(connId);
     this.audit(key, connId, 'revoke', connId, 'none', false, true);

[Survived] BooleanLiteral
lib/manager.ts:153:55
     const key = normalizeProjectKey(projectPath);
     this.store.grants.revoke(key, connId);
     void this.dropAdapters(connId);
-    this.audit(key, connId, 'revoke', connId, 'none', false, true);
+    this.audit(key, connId, 'revoke', connId, 'none', true, true);
   }
 

[Survived] BooleanLiteral
lib/manager.ts:153:62
     const key = normalizeProjectKey(projectPath);
     this.store.grants.revoke(key, connId);
     void this.dropAdapters(connId);
-    this.audit(key, connId, 'revoke', connId, 'none', false, true);
+    this.audit(key, connId, 'revoke', connId, 'none', false, false);
   }
 

[Killed] BlockStatement
lib/manager.ts:158:87
 
   /* -- 浏览（ro 即可） -- */
 
-  async databases(projectPath: string | undefined, connId: string): Promise<string[]> {
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.listDatabases();
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
-      return result;
-    } catch (e) {
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
-  }
+  async databases(projectPath: string | undefined, connId: string): Promise<string[]> {}
 
   async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {
killedBy: 业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
statusReason: expected undefined to deeply equal [ 'app', 'test' ]

[Survived] BooleanLiteral
lib/manager.ts:159:72
   /* -- 浏览（ro 即可） -- */
 
   async databases(projectPath: string | undefined, connId: string): Promise<string[]> {
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
+    const { key, adapter } = await this.authorize(projectPath, connId, true);
     try {
       const result = await adapter.listDatabases();

[Killed] BlockStatement
lib/manager.ts:160:9
 
   async databases(projectPath: string | undefined, connId: string): Promise<string[]> {
     const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.listDatabases();
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
-      return result;
-    } catch (e) {
+    try {} catch (e) {
       this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
       throw this.toDriverError(e);
killedBy: 业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
statusReason: expected undefined to deeply equal [ 'app', 'test' ]

[Survived] BooleanLiteral
lib/manager.ts:162:76
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.listDatabases();
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false);
       return result;
     } catch (e) {

[Survived] BooleanLiteral
lib/manager.ts:162:69
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.listDatabases();
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+      this.audit(key, connId, 'databases', 'listDatabases', 'none', true, true);
       return result;
     } catch (e) {

[NoCoverage] BlockStatement
lib/manager.ts:164:17
       const result = await adapter.listDatabases();
       this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
       return result;
-    } catch (e) {
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] BooleanLiteral
lib/manager.ts:165:69
       this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'databases', 'listDatabases', 'none', true, false, this.errText(e));
       throw this.toDriverError(e);
     }

[NoCoverage] BooleanLiteral
lib/manager.ts:165:76
       this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true, this.errText(e));
       throw this.toDriverError(e);
     }

[Killed] BlockStatement
lib/manager.ts:170:106
     }
   }
 
-  async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.listTables(database);
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
-      return result;
-    } catch (e) {
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
-  }
+  async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {}
 
   async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {
killedBy: 业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
statusReason: Target cannot be null or undefined.

[Survived] BooleanLiteral
lib/manager.ts:171:72
   }
 
   async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
+    const { key, adapter } = await this.authorize(projectPath, connId, true);
     try {
       const result = await adapter.listTables(database);

[Killed] BlockStatement
lib/manager.ts:172:9
 
   async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {
     const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.listTables(database);
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
-      return result;
-    } catch (e) {
+    try {} catch (e) {
       this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
       throw this.toDriverError(e);
killedBy: 业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
statusReason: Target cannot be null or undefined.

[Survived] LogicalOperator
lib/manager.ts:174:41
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.listTables(database);
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+      this.audit(key, connId, 'tables', database && 'default', 'none', false, true);
       return result;
     } catch (e) {

[Survived] BooleanLiteral
lib/manager.ts:174:79
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.listTables(database);
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false);
       return result;
     } catch (e) {

[NoCoverage] BlockStatement
lib/manager.ts:176:17
       const result = await adapter.listTables(database);
       this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
       return result;
-    } catch (e) {
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] LogicalOperator
lib/manager.ts:177:41
       this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'tables', database && 'default', 'none', false, false, this.errText(e));
       throw this.toDriverError(e);
     }

[NoCoverage] BooleanLiteral
lib/manager.ts:177:72
       this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'tables', database ?? 'default', 'none', true, false, this.errText(e));
       throw this.toDriverError(e);
     }

[Killed] BlockStatement
lib/manager.ts:182:122
     }
   }
 
-  async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {
-    const t = assertNonEmpty(table, 'table');
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.describeTable(t, database);
-      this.audit(key, connId, 'schema', t, 'none', false, true);
-      return result;
-    } catch (e) {
-      this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
-  }
+  async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {}
 
   async preview(
killedBy: 业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
statusReason: Target cannot be null or undefined.

[Survived] StringLiteral
lib/manager.ts:183:37
   }
 
   async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {
-    const t = assertNonEmpty(table, 'table');
+    const t = assertNonEmpty(table, "");
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {

[Survived] BooleanLiteral
lib/manager.ts:184:72
 
   async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {
     const t = assertNonEmpty(table, 'table');
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
+    const { key, adapter } = await this.authorize(projectPath, connId, true);
     try {
       const result = await adapter.describeTable(t, database);

[Killed] BlockStatement
lib/manager.ts:185:9
   async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {
     const t = assertNonEmpty(table, 'table');
     const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.describeTable(t, database);
-      this.audit(key, connId, 'schema', t, 'none', false, true);
-      return result;
-    } catch (e) {
+    try {} catch (e) {
       this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
       throw this.toDriverError(e);
killedBy: 业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
statusReason: Target cannot be null or undefined.

[Survived] BooleanLiteral
lib/manager.ts:187:59
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.describeTable(t, database);
-      this.audit(key, connId, 'schema', t, 'none', false, true);
+      this.audit(key, connId, 'schema', t, 'none', false, false);
       return result;
     } catch (e) {
