[Survived] MethodExpression
lib/store/audit.ts:47:20
-         const line = lines[i]?.trim();
+         const line = lines[i];
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] OptionalChaining
lib/store/audit.ts:47:20
-         const line = lines[i]?.trim();
+         const line = lines[i].trim();
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] BooleanLiteral
lib/store/audit.ts:48:11
-         if (!line) continue;
+         if (line) continue;
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/audit.ts:48:11
-         if (!line) continue;
+         if (true) continue;
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/audit.ts:48:11
-         if (!line) continue;
+         if (false) continue;
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] BlockStatement
lib/store/audit.ts:49:11
-         try {
-           out.push(JSON.parse(line) as AuditEntry);
-         } catch {
+         try {} catch {
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] CallExpression
lib/store/audit.ts:50:9
-           out.push(JSON.parse(line) as AuditEntry);
+           ;
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[Survived] MethodExpression
lib/store/audit.ts:55:12
-       return out.reverse();
+       return out;
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state
    DbToolService: 浏览与审计 危险确认与执行都留审计
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 2 more tests!

[NoCoverage] StringLiteral
lib/store/connections.ts:56:25
-     const creds = m[2] ?? '';
+     const creds = m[2] ?? "Stryker was here!";

[NoCoverage] ObjectLiteral
lib/store/connections.ts:156:56
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (password !== undefined) this.secrets.set(id, {});

[Survived] BlockStatement
lib/store/connections.ts:53:48
-   export function redactUrl(url: string): string {
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
-     if (!m) return url;
-     const creds = m[2] ?? '';
-     const idx = creds.lastIndexOf(':');
-     if (idx < 0) return url; // 无密码段
-     return `${m[1]}${creds.slice(0, idx + 1)}***@${url.slice(m[0].length)}`;
-   }
+   export function redactUrl(url: string): string {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] Regex
lib/store/connections.ts:54:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
+     const m = url.match(/([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] Regex
lib/store/connections.ts:54:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
+     const m = url.match(/^([^a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] Regex
lib/store/connections.ts:54:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
+     const m = url.match(/^([a-z][a-z0-9+.-]:\/\/)([^/]*)@/i);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] Regex
lib/store/connections.ts:54:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
+     const m = url.match(/^([a-z][^a-z0-9+.-]*:\/\/)([^/]*)@/i);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] Regex
lib/store/connections.ts:54:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
+     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/])@/i);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] Regex
lib/store/connections.ts:54:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/]*)@/i);
+     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([/]*)@/i);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] BooleanLiteral
lib/store/connections.ts:55:7
-     if (!m) return url;
+     if (m) return url;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:55:7
-     if (!m) return url;
+     if (true) return url;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:55:7
-     if (!m) return url;
+     if (false) return url;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 29 more tests!

[Survived] LogicalOperator
lib/store/connections.ts:56:17
-     const creds = m[2] ?? '';
+     const creds = m[2] && '';
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] StringLiteral
lib/store/connections.ts:57:33
-     const idx = creds.lastIndexOf(':');
+     const idx = creds.lastIndexOf("");
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:58:7
-     if (idx < 0) return url; // 无密码段
+     if (true) return url; // 无密码段
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:58:7
-     if (idx < 0) return url; // 无密码段
+     if (false) return url; // 无密码段
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:58:7
-     if (idx < 0) return url; // 无密码段
+     if (idx <= 0) return url; // 无密码段
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:58:7
-     if (idx < 0) return url; // 无密码段
+     if (idx >= 0) return url; // 无密码段
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] StringLiteral
lib/store/connections.ts:59:10
-     return `${m[1]}${creds.slice(0, idx + 1)}***@${url.slice(m[0].length)}`;
+     return ``;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] MethodExpression
lib/store/connections.ts:59:20
-     return `${m[1]}${creds.slice(0, idx + 1)}***@${url.slice(m[0].length)}`;
+     return `${m[1]}${creds}***@${url.slice(m[0].length)}`;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] ArithmeticOperator
lib/store/connections.ts:59:35
-     return `${m[1]}${creds.slice(0, idx + 1)}***@${url.slice(m[0].length)}`;
+     return `${m[1]}${creds.slice(0, idx - 1)}***@${url.slice(m[0].length)}`;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] MethodExpression
lib/store/connections.ts:59:50
-     return `${m[1]}${creds.slice(0, idx + 1)}***@${url.slice(m[0].length)}`;
+     return `${m[1]}${creds.slice(0, idx + 1)}***@${url}`;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 28 more tests!

[Survived] BlockStatement
lib/store/connections.ts:65:3
-   } {
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
-       return { clean: fields, password: undefined };
-     }
-     const { [PASSWORD_KEY]: password, ...clean } = fields;
-     return { clean, password: password as string };
-   }
+   } {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:66:7
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (true) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:66:18
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (!fields || false) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:66:7
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (false) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] LogicalOperator
lib/store/connections.ts:66:7
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (!fields && typeof fields[PASSWORD_KEY] !== 'string') {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] BooleanLiteral
lib/store/connections.ts:66:7
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (fields || typeof fields[PASSWORD_KEY] !== 'string') {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:66:18
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (!fields || typeof fields[PASSWORD_KEY] === 'string') {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] StringLiteral
lib/store/connections.ts:66:50
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (!fields || typeof fields[PASSWORD_KEY] !== "") {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:70:10
-     return { clean, password: password as string };
+     return {};
Tests ran:
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
    SecretsBox 任何公开 API 返回值与元数据文件的序列化结果都不含密码

[Survived] BlockStatement
lib/store/connections.ts:66:60
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
-       return { clean: fields, password: undefined };
-     }
+     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 27 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:67:12
-       return { clean: fields, password: undefined };
+       return {};
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 27 more tests!

[Survived] BlockStatement
lib/store/connections.ts:74:50
-   function toMeta(rec: ConnRecord): ConnectionMeta {
-     const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
-     if (rec.name !== undefined) meta.name = rec.name;
-     if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
-     if (rec.fields) {
-       const { host, port, database } = rec.fields;
-       if (typeof host === 'string') meta.host = host;
-       if (typeof port === 'number') meta.port = port;
-       if (typeof database === 'string') meta.database = database;
-     }
-     return meta;
-   }
+   function toMeta(rec: ConnRecord): ConnectionMeta {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:75:32
-     const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
+     const meta: ConnectionMeta = {};
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:76:7
-     if (rec.name !== undefined) meta.name = rec.name;
+     if (true) meta.name = rec.name;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:76:7
-     if (rec.name !== undefined) meta.name = rec.name;
+     if (false) meta.name = rec.name;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:76:7
-     if (rec.name !== undefined) meta.name = rec.name;
+     if (rec.name === undefined) meta.name = rec.name;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:77:7
-     if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
+     if (true) meta.safeUrl = rec.urlSafe;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:77:7
-     if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
+     if (false) meta.safeUrl = rec.urlSafe;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:77:7
-     if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
+     if (rec.urlSafe === undefined) meta.safeUrl = rec.urlSafe;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] BlockStatement
lib/store/connections.ts:78:19
-     if (rec.fields) {
-       const { host, port, database } = rec.fields;
-       if (typeof host === 'string') meta.host = host;
-       if (typeof port === 'number') meta.port = port;
-       if (typeof database === 'string') meta.database = database;
-     }
+     if (rec.fields) {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:78:7
-     if (rec.fields) {
+     if (false) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:78:7
-     if (rec.fields) {
+     if (true) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:80:9
-       if (typeof host === 'string') meta.host = host;
+       if (true) meta.host = host;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:80:9
-       if (typeof host === 'string') meta.host = host;
+       if (false) meta.host = host;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:80:9
-       if (typeof host === 'string') meta.host = host;
+       if (typeof host !== 'string') meta.host = host;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] StringLiteral
lib/store/connections.ts:80:25
-       if (typeof host === 'string') meta.host = host;
+       if (typeof host === "") meta.host = host;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:81:9
-       if (typeof port === 'number') meta.port = port;
+       if (true) meta.port = port;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:81:9
-       if (typeof port === 'number') meta.port = port;
+       if (false) meta.port = port;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:81:9
-       if (typeof port === 'number') meta.port = port;
+       if (typeof port !== 'number') meta.port = port;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] StringLiteral
lib/store/connections.ts:81:25
-       if (typeof port === 'number') meta.port = port;
+       if (typeof port === "") meta.port = port;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:82:9
-       if (typeof database === 'string') meta.database = database;
+       if (true) meta.database = database;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:82:9
-       if (typeof database === 'string') meta.database = database;
+       if (false) meta.database = database;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:82:9
-       if (typeof database === 'string') meta.database = database;
+       if (typeof database !== 'string') meta.database = database;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] StringLiteral
lib/store/connections.ts:82:29
-       if (typeof database === 'string') meta.database = database;
+       if (typeof database === "") meta.database = database;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] BlockStatement
lib/store/connections.ts:94:5
-     ) {
-       this.file = path.join(dir, 'connections.json');
-     }
+     ) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:99:49
-       return readJson<ConnectionsFile>(this.file, { connections: [] });
+       return readJson<ConnectionsFile>(this.file, {});
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] BlockStatement
lib/store/connections.ts:98:35
-     private load(): ConnectionsFile {
-       return readJson<ConnectionsFile>(this.file, { connections: [] });
-     }
+     private load(): ConnectionsFile {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] StringLiteral
lib/store/connections.ts:95:32
-       this.file = path.join(dir, 'connections.json');
+       this.file = path.join(dir, "");
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] ArrayDeclaration
lib/store/connections.ts:99:64
-       return readJson<ConnectionsFile>(this.file, { connections: [] });
+       return readJson<ConnectionsFile>(this.file, { connections: ["Stryker was here"] });
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 37 more tests!

[Survived] BlockStatement
lib/store/connections.ts:102:45
-     private save(data: ConnectionsFile): void {
-       writeJsonAtomic(this.file, data);
-     }
+     private save(data: ConnectionsFile): void {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] CallExpression
lib/store/connections.ts:103:5
-       writeJsonAtomic(this.file, data);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] BlockStatement
lib/store/connections.ts:106:78
-     private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {
-       return data.connections.find((c) => c.id === id);
-     }
+     private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
  and 31 more tests!

[Survived] ArrowFunction
lib/store/connections.ts:107:34
-       return data.connections.find((c) => c.id === id);
+       return data.connections.find(() => undefined);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
  and 31 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:107:41
-       return data.connections.find((c) => c.id === id);
+       return data.connections.find((c) => false);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 19 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:107:41
-       return data.connections.find((c) => c.id === id);
+       return data.connections.find((c) => true);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 19 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:107:41
-       return data.connections.find((c) => c.id === id);
+       return data.connections.find((c) => c.id !== id);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 19 more tests!

[Survived] BlockStatement
lib/store/connections.ts:114:47
-     get(id: string): ConnectionMeta | undefined {
-       const rec = this.findRec(this.load(), id);
-       return rec ? toMeta(rec) : undefined;
-     }
+     get(id: string): ConnectionMeta | undefined {}
Tests ran:
    ConnectionStore list / get 返回脱敏数据，get 不存在返回 undefined
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
    SecretsBox 任何公开 API 返回值与元数据文件的序列化结果都不含密码

[Survived] BlockStatement
lib/store/connections.ts:110:28
-     list(): ConnectionMeta[] {
-       return this.load().connections.map(toMeta);
-     }
+     list(): ConnectionMeta[] {}
Tests ran:
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
  and 8 more tests!

[Survived] BlockStatement
lib/store/connections.ts:122:39
-       if (this.findRec(data, input.id)) {
-         throw new Error(`连接已存在: ${input.id}`);
-       }
+       if (this.findRec(data, input.id)) {}
Tests ran:
    ConnectionStore create 重复 id 抛错
