[Survived] BooleanLiteral
lib/manager.ts:187:52
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.describeTable(t, database);
-      this.audit(key, connId, 'schema', t, 'none', false, true);
+      this.audit(key, connId, 'schema', t, 'none', true, true);
       return result;
     } catch (e) {

[NoCoverage] BlockStatement
lib/manager.ts:189:17
       const result = await adapter.describeTable(t, database);
       this.audit(key, connId, 'schema', t, 'none', false, true);
       return result;
-    } catch (e) {
-      this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] BooleanLiteral
lib/manager.ts:190:52
       this.audit(key, connId, 'schema', t, 'none', false, true);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'schema', t, 'none', true, false, this.errText(e));
       throw this.toDriverError(e);
     }

[NoCoverage] BooleanLiteral
lib/manager.ts:190:59
       this.audit(key, connId, 'schema', t, 'none', false, true);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'schema', t, 'none', false, true, this.errText(e));
       throw this.toDriverError(e);
     }

[Killed] BlockStatement
lib/manager.ts:202:27
     limit?: number,
     database?: string,
     offset?: number,
-  ): Promise<QueryResult> {
-    const t = assertNonEmpty(table, 'table');
-    const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
-    const off = Math.max(0, Math.floor(Number(offset) || 0));
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.previewRows(t, capped, database, off);
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
-      return result;
-    } catch (e) {
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
-  }
+  ): Promise<QueryResult> {}
 
   /* -- SQL 控制台（guard + challenge） -- */
killedBy: DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
lib/manager.ts:204:20
     offset?: number,
   ): Promise<QueryResult> {
     const t = assertNonEmpty(table, 'table');
-    const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+    const capped = Math.min(1, Math.min(50, Math.floor(Number(limit) || 10)));
     const off = Math.max(0, Math.floor(Number(offset) || 0));
     const { key, adapter } = await this.authorize(projectPath, connId, false);
killedBy: DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
statusReason: expected 1 to be 50 // Object.is equality

[Killed] ConditionalExpression
lib/manager.ts:204:56
     offset?: number,
   ): Promise<QueryResult> {
     const t = assertNonEmpty(table, 'table');
-    const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+    const capped = Math.max(1, Math.min(50, Math.floor(false)));
     const off = Math.max(0, Math.floor(Number(offset) || 0));
     const { key, adapter } = await this.authorize(projectPath, connId, false);
killedBy: DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
statusReason: expected 1 to be 50 // Object.is equality

[Survived] LogicalOperator
lib/manager.ts:205:40
   ): Promise<QueryResult> {
     const t = assertNonEmpty(table, 'table');
     const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
-    const off = Math.max(0, Math.floor(Number(offset) || 0));
+    const off = Math.max(0, Math.floor(Number(offset) && 0));
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {

[Survived] MethodExpression
lib/manager.ts:205:17
   ): Promise<QueryResult> {
     const t = assertNonEmpty(table, 'table');
     const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
-    const off = Math.max(0, Math.floor(Number(offset) || 0));
+    const off = Math.min(0, Math.floor(Number(offset) || 0));
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {

[Survived] BooleanLiteral
lib/manager.ts:206:72
     const t = assertNonEmpty(table, 'table');
     const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
     const off = Math.max(0, Math.floor(Number(offset) || 0));
-    const { key, adapter } = await this.authorize(projectPath, connId, false);
+    const { key, adapter } = await this.authorize(projectPath, connId, true);
     try {
       const result = await adapter.previewRows(t, capped, database, off);

[Killed] BlockStatement
lib/manager.ts:207:9
     const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
     const off = Math.max(0, Math.floor(Number(offset) || 0));
     const { key, adapter } = await this.authorize(projectPath, connId, false);
-    try {
-      const result = await adapter.previewRows(t, capped, database, off);
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
-      return result;
-    } catch (e) {
+    try {} catch (e) {
       this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
       throw this.toDriverError(e);
killedBy: DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
statusReason: expected +0 to be 50 // Object.is equality

[Survived] BooleanLiteral
lib/manager.ts:209:103
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.previewRows(t, capped, database, off);
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
+      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, undefined, result.rowCount);
       return result;
     } catch (e) {

[Survived] BooleanLiteral
lib/manager.ts:209:96
     const { key, adapter } = await this.authorize(projectPath, connId, false);
     try {
       const result = await adapter.previewRows(t, capped, database, off);
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
+      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', true, true, undefined, result.rowCount);
       return result;
     } catch (e) {

[NoCoverage] BlockStatement
lib/manager.ts:211:17
       const result = await adapter.previewRows(t, capped, database, off);
       this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
       return result;
-    } catch (e) {
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
-      throw this.toDriverError(e);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] BooleanLiteral
lib/manager.ts:212:96
       this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', true, false, this.errText(e));
       throw this.toDriverError(e);
     }

[NoCoverage] BooleanLiteral
lib/manager.ts:212:103
       this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
       return result;
     } catch (e) {
-      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+      this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, this.errText(e));
       throw this.toDriverError(e);
     }

[Killed] BlockStatement
lib/manager.ts:225:41
     sql: string,
     params?: unknown[],
     challengeId?: string,
-  ): Promise<QueryResult | NeedConfirm> {
-    const statement = assertNonEmpty(sql, 'sql');
-    return this.runGuarded({
-      projectPath,
-      connId,
-      op: 'query',
-      statement,
-      challengeId,
-      run: (adapter) => adapter.query(statement, params),
-      rowsAffected: (r) => r.rowCount,
-    });
-  }
+  ): Promise<QueryResult | NeedConfirm> {}
 
   async execute(
killedBy: DbToolService: 构造与错误契约 必填参数为空白或非字符串 → INVALID_ARGUMENT，消息含字段名
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
lib/manager.ts:226:43
     params?: unknown[],
     challengeId?: string,
   ): Promise<QueryResult | NeedConfirm> {
-    const statement = assertNonEmpty(sql, 'sql');
+    const statement = assertNonEmpty(sql, "");
     return this.runGuarded({
       projectPath,
killedBy: DbToolService: 构造与错误契约 必填参数为空白或非字符串 → INVALID_ARGUMENT，消息含字段名
statusReason: expected DbToolError: 缺少必填参数:  { code: 'INVAL…' } to match object { code: 'INVALID_ARGUMENT', …(1) }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
lib/manager.ts:227:28
     challengeId?: string,
   ): Promise<QueryResult | NeedConfirm> {
     const statement = assertNonEmpty(sql, 'sql');
-    return this.runGuarded({
-      projectPath,
-      connId,
-      op: 'query',
-      statement,
-      challengeId,
-      run: (adapter) => adapter.query(statement, params),
-      rowsAffected: (r) => r.rowCount,
-    });
+    return this.runGuarded({});
   }
 
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] StringLiteral
lib/manager.ts:230:11
     return this.runGuarded({
       projectPath,
       connId,
-      op: 'query',
+      op: "",
       statement,
       challengeId,
killedBy: DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/manager.ts:233:12
       op: 'query',
       statement,
       challengeId,
-      run: (adapter) => adapter.query(statement, params),
+      run: () => undefined,
       rowsAffected: (r) => r.rowCount,
     });
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Survived] ArrowFunction
lib/manager.ts:234:21
       statement,
       challengeId,
       run: (adapter) => adapter.query(statement, params),
-      rowsAffected: (r) => r.rowCount,
+      rowsAffected: () => undefined,
     });
   }

[Killed] BlockStatement
lib/manager.ts:244:40
     statement: string,
     params?: unknown[],
     challengeId?: string,
-  ): Promise<ExecResult | NeedConfirm> {
-    const stmt = assertNonEmpty(statement, 'statement');
-    return this.runGuarded({
-      projectPath,
-      connId,
-      op: 'execute',
-      statement: stmt,
-      challengeId,
-      run: (adapter) => adapter.execute(stmt, params),
-      rowsAffected: (r) => r.affectedRows,
-    });
-  }
+  ): Promise<ExecResult | NeedConfirm> {}
 
   /**
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: true } to match object { ok: false, …(3) }

[Killed] ObjectLiteral
lib/manager.ts:246:28
     challengeId?: string,
   ): Promise<ExecResult | NeedConfirm> {
     const stmt = assertNonEmpty(statement, 'statement');
-    return this.runGuarded({
-      projectPath,
-      connId,
-      op: 'execute',
-      statement: stmt,
-      challengeId,
-      run: (adapter) => adapter.execute(stmt, params),
-      rowsAffected: (r) => r.affectedRows,
-    });
+    return this.runGuarded({});
   }
 
killedBy: 业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
statusReason: expected { ok: false, …(2) } to match object { ok: false, …(3) }
(1 matching property omitted from actual)

[Killed] StringLiteral
lib/manager.ts:249:11
     return this.runGuarded({
       projectPath,
       connId,
-      op: 'execute',
+      op: "",
       statement: stmt,
       challengeId,
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Killed] ArrowFunction
lib/manager.ts:252:12
       op: 'execute',
       statement: stmt,
       challengeId,
-      run: (adapter) => adapter.execute(stmt, params),
+      run: () => undefined,
       rowsAffected: (r) => r.affectedRows,
     });
killedBy: DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
statusReason: Cannot read properties of undefined (reading 'affectedRows')

[Survived] ArrowFunction
lib/manager.ts:253:21
       statement: stmt,
       challengeId,
       run: (adapter) => adapter.execute(stmt, params),
-      rowsAffected: (r) => r.affectedRows,
+      rowsAffected: () => undefined,
     });
   }

[Survived] StringLiteral
lib/manager.ts:271:38
     code: string,
     challengeId?: string,
   ): Promise<unknown | NeedConfirm> {
-    const src = assertNonEmpty(code, 'code');
+    const src = assertNonEmpty(code, "");
     // authorize(needWrite=true) 已拒绝 ro 授权；脚本内写句柄再经 runGuarded 双重校验
     const { key, mode } = await this.authorize(projectPath, connId, true);

[Killed] BooleanLiteral
lib/manager.ts:273:69
   ): Promise<unknown | NeedConfirm> {
     const src = assertNonEmpty(code, 'code');
     // authorize(needWrite=true) 已拒绝 ro 授权；脚本内写句柄再经 runGuarded 双重校验
-    const { key, mode } = await this.authorize(projectPath, connId, true);
+    const { key, mode } = await this.authorize(projectPath, connId, false);
     // 会话专用适配器：独立于缓存实例，脚本超时可立即 close（中断在途查询）
     const rc = this.requireConn(connId);
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: promise resolved "1" instead of rejecting

[NoCoverage] BlockStatement
lib/manager.ts:277:78
     // 会话专用适配器：独立于缓存实例，脚本超时可立即 close（中断在途查询）
     const rc = this.requireConn(connId);
     const factory = await this.resolver(rc.meta.kind);
-    const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {
-      throw e instanceof DbToolError ? e : this.toDriverError(e);
-    });
+    const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {});
 
     const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;

[Survived] ObjectLiteral
lib/manager.ts:277:46
     // 会话专用适配器：独立于缓存实例，脚本超时可立即 close（中断在途查询）
     const rc = this.requireConn(connId);
     const factory = await this.resolver(rc.meta.kind);
-    const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {
+    const sessionAdapter = await factory(rc, {}).catch((e: unknown) => {
       throw e instanceof DbToolError ? e : this.toDriverError(e);
     });

[Survived] ConditionalExpression
lib/manager.ts:281:23
       throw e instanceof DbToolError ? e : this.toDriverError(e);
     });
 
-    const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+    const auditStmt = false ? src.slice(0, 200) + '…' : src;
     try {
       const result = await runScriptInChild({

[Survived] EqualityOperator
lib/manager.ts:281:23
       throw e instanceof DbToolError ? e : this.toDriverError(e);
     });
 
-    const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+    const auditStmt = src.length >= 200 ? src.slice(0, 200) + '…' : src;
     try {
       const result = await runScriptInChild({

[Killed] BlockStatement
lib/manager.ts:282:9
     });
 
     const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
-    try {
-      const result = await runScriptInChild({
-        code: src,
-        dbQuery: async (sql, params) => this.unwrapForScript(await this.query(key, connId, sql, params)),
-        dbExecute: async (statement, params) =>
-          this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
-        onLog: (level, text) =>
-          level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
-        onTimeout: () => {
-          void sessionAdapter.close().catch(() => {});
-        },
-      });
-      this.audit(key, connId, 'script', auditStmt, 'none', false, true);
-      return result;
-    } catch (e) {
+    try {} catch (e) {
       if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
         this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
killedBy: DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
statusReason: expected undefined to match object { rowCount: 1 }

[Killed] ArrowFunction
lib/manager.ts:285:18
     try {
       const result = await runScriptInChild({
         code: src,
-        dbQuery: async (sql, params) => this.unwrapForScript(await this.query(key, connId, sql, params)),
+        dbQuery: () => undefined,
         dbExecute: async (statement, params) =>
           this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
killedBy: DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
statusReason: expected null to match object { rowCount: 1 }

[Killed] ArrowFunction
lib/manager.ts:286:20
       const result = await runScriptInChild({
         code: src,
         dbQuery: async (sql, params) => this.unwrapForScript(await this.query(key, connId, sql, params)),
-        dbExecute: async (statement, params) =>
-          this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
+        dbExecute: () => undefined,
         onLog: (level, text) =>
           level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
killedBy: DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
statusReason: TypeError: Cannot read properties of undefined (reading 'affectedRows')

[Survived] ArrowFunction
lib/manager.ts:288:16
         dbQuery: async (sql, params) => this.unwrapForScript(await this.query(key, connId, sql, params)),
         dbExecute: async (statement, params) =>
           this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
-        onLog: (level, text) =>
-          level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+        onLog: () => undefined,
         onTimeout: () => {
           void sessionAdapter.close().catch(() => {});

[NoCoverage] ConditionalExpression
lib/manager.ts:289:11
         dbExecute: async (statement, params) =>
           this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
         onLog: (level, text) =>
-          level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+          false ? console.error('[db-script]', text) : console.log('[db-script]', text),
         onTimeout: () => {
           void sessionAdapter.close().catch(() => {});

[NoCoverage] ConditionalExpression
lib/manager.ts:289:11
         dbExecute: async (statement, params) =>
           this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
         onLog: (level, text) =>
-          level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+          true ? console.error('[db-script]', text) : console.log('[db-script]', text),
         onTimeout: () => {
           void sessionAdapter.close().catch(() => {});

[NoCoverage] BlockStatement
lib/manager.ts:290:26
           this.unwrapForScript(await this.execute(key, connId, statement, params, challengeId)),
         onLog: (level, text) =>
           level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
-        onTimeout: () => {
-          void sessionAdapter.close().catch(() => {});
-        },
+        onTimeout: () => {},
       });
       this.audit(key, connId, 'script', auditStmt, 'none', false, true);

[Survived] BooleanLiteral
lib/manager.ts:294:67
           void sessionAdapter.close().catch(() => {});
         },
       });
-      this.audit(key, connId, 'script', auditStmt, 'none', false, true);
+      this.audit(key, connId, 'script', auditStmt, 'none', false, false);
       return result;
     } catch (e) {

[Survived] BooleanLiteral
lib/manager.ts:294:60
           void sessionAdapter.close().catch(() => {});
         },
       });
-      this.audit(key, connId, 'script', auditStmt, 'none', false, true);
+      this.audit(key, connId, 'script', auditStmt, 'none', true, true);
       return result;
     } catch (e) {

[Killed] BlockStatement
lib/manager.ts:296:17
       });
       this.audit(key, connId, 'script', auditStmt, 'none', false, true);
       return result;
-    } catch (e) {
-      if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
-        this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
-      }
-      if (e instanceof DbToolError) throw e;
-      throw this.toDriverError(e);
-    } finally {
+    } catch (e) {} finally {
       await sessionAdapter.close().catch(() => {});
     }
killedBy: DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
statusReason: promise resolved "undefined" instead of rejecting

[Survived] LogicalOperator
lib/manager.ts:297:13
       this.audit(key, connId, 'script', auditStmt, 'none', false, true);
       return result;
     } catch (e) {
-      if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+      if (!(e instanceof DbToolError || e.code === 'NEEDS_CONFIRMATION')) {
         this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
       }

[Survived] EqualityOperator
lib/manager.ts:297:41
       this.audit(key, connId, 'script', auditStmt, 'none', false, true);
       return result;
     } catch (e) {
-      if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+      if (!(e instanceof DbToolError && e.code !== 'NEEDS_CONFIRMATION')) {
         this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
       }

[Survived] BooleanLiteral
lib/manager.ts:298:69
       return result;
     } catch (e) {
       if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
-        this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
+        this.audit(key, connId, 'script', auditStmt, 'none', false, true, this.errText(e));
       }
       if (e instanceof DbToolError) throw e;

[Survived] BooleanLiteral
lib/manager.ts:298:62
       return result;
     } catch (e) {
       if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
-        this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
+        this.audit(key, connId, 'script', auditStmt, 'none', true, false, this.errText(e));
       }
       if (e instanceof DbToolError) throw e;

[Killed] ConditionalExpression
lib/manager.ts:300:11
       if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
         this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
       }
-      if (e instanceof DbToolError) throw e;
+      if (true) throw e;
       throw this.toDriverError(e);
     } finally {
killedBy: DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
statusReason: expected Error: Unexpected token '}' to match object { code: 'DRIVER_ERROR' }

[Survived] ConditionalExpression
lib/manager.ts:300:11
       if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
         this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
       }
-      if (e instanceof DbToolError) throw e;
+      if (false) throw e;
       throw this.toDriverError(e);
     } finally {

[Survived] BlockStatement
lib/manager.ts:302:15
       }
       if (e instanceof DbToolError) throw e;
       throw this.toDriverError(e);
-    } finally {
-      await sessionAdapter.close().catch(() => {});
-    }
+    } finally {}
   }
 

[Killed] BlockStatement
lib/manager.ts:309:76
 
   /* -- 审计与状态 -- */
 
-  auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {
-    const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
-    if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
-    const key = normalizeProjectKey(projectPath);
-    return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
-  }
+  auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {}
 
   state(projectPath: string | undefined): {
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
lib/manager.ts:310:27
   /* -- 审计与状态 -- */
 
   auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {
-    const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+    const n = Math.max(1, Math.max(500, Math.floor(Number(limit) || 50)));
     if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
     const key = normalizeProjectKey(projectPath);
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
lib/manager.ts:310:52
   /* -- 审计与状态 -- */
 
   auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {
-    const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+    const n = Math.max(1, Math.min(500, Math.floor(Number(limit) && 50)));
     if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
     const key = normalizeProjectKey(projectPath);
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
lib/manager.ts:311:9
 
   auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {
     const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
-    if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+    if (false) return this.store.audit.tail(n);
     const key = normalizeProjectKey(projectPath);
     return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
killedBy: fenced 校验 无 Origin/Referer（本地脚本）放行
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/manager.ts:311:25
 
   auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {
     const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
-    if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+    if (!projectPath || false) return this.store.audit.tail(n);
     const key = normalizeProjectKey(projectPath);
     return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
lib/manager.ts:313:51
     const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
     if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
     const key = normalizeProjectKey(projectPath);
-    return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+    return this.store.audit.tail(n).filter((e) => false);
   }
 
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
lib/manager.ts:313:44
     const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
     if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
     const key = normalizeProjectKey(projectPath);
-    return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+    return this.store.audit.tail(n).filter(() => undefined);
   }
 
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
lib/manager.ts:320:5
     connections: ConnectionMeta[];
     grants: { connId: string; mode: 'ro' | 'rw' }[];
     auditTail: AuditEntry[];
-  } {
-    const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
-    return {
-      connections: this.listConnections(),
-      grants,
-      auditTail: this.auditTail(projectPath, 50),
-    };
-  }
+  } {}
 
   /** 关闭缓存的适配器并停止 challenge 清理 */
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
lib/manager.ts:321:35
     grants: { connId: string; mode: 'ro' | 'rw' }[];
     auditTail: AuditEntry[];
   } {
-    const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+    const grants = projectPath && projectPath.trim() === '' ? this.grantsFor(projectPath) : [];
     return {
       connections: this.listConnections(),
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0
