[Survived] BlockStatement
lib/store/connections.ts:120:56
-     create(input: ConnectionCreateInput): ConnectionMeta {
-       const data = this.load();
-       if (this.findRec(data, input.id)) {
-         throw new Error(`连接已存在: ${input.id}`);
-       }
-       const rec: ConnRecord = { id: input.id, kind: input.kind };
-       if (input.name !== undefined) rec.name = input.name;
-       if (input.ssl !== undefined) rec.ssl = input.ssl;
-       const { clean, password } = splitPassword(input.fields);
-       if (clean !== undefined) rec.fields = clean;
-       const secretPatch: Record<string, string> = {};
-       if (input.url !== undefined) {
-         rec.urlSafe = redactUrl(input.url);
-         secretPatch.url = input.url;
-       }
-       if (password !== undefined) secretPatch.password = password;
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
-       data.connections.push(rec);
-       this.save(data);
-       return toMeta(rec);
-     }
+     create(input: ConnectionCreateInput): ConnectionMeta {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] StringLiteral
lib/store/connections.ts:123:23
-         throw new Error(`连接已存在: ${input.id}`);
+         throw new Error(``);
Tests ran:
    ConnectionStore create 重复 id 抛错

[Survived] ConditionalExpression
lib/store/connections.ts:122:9
-       if (this.findRec(data, input.id)) {
+       if (true) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:122:9
-       if (this.findRec(data, input.id)) {
+       if (false) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:125:29
-       const rec: ConnRecord = { id: input.id, kind: input.kind };
+       const rec: ConnRecord = {};
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:126:9
-       if (input.name !== undefined) rec.name = input.name;
+       if (true) rec.name = input.name;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:126:9
-       if (input.name !== undefined) rec.name = input.name;
+       if (false) rec.name = input.name;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:126:9
-       if (input.name !== undefined) rec.name = input.name;
+       if (input.name === undefined) rec.name = input.name;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:127:9
-       if (input.ssl !== undefined) rec.ssl = input.ssl;
+       if (true) rec.ssl = input.ssl;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:127:9
-       if (input.ssl !== undefined) rec.ssl = input.ssl;
+       if (false) rec.ssl = input.ssl;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:127:9
-       if (input.ssl !== undefined) rec.ssl = input.ssl;
+       if (input.ssl === undefined) rec.ssl = input.ssl;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:130:9
-       if (clean !== undefined) rec.fields = clean;
+       if (true) rec.fields = clean;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:130:9
-       if (clean !== undefined) rec.fields = clean;
+       if (false) rec.fields = clean;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:133:9
-       if (input.url !== undefined) {
+       if (true) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:130:9
-       if (clean !== undefined) rec.fields = clean;
+       if (clean === undefined) rec.fields = clean;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:133:9
-       if (input.url !== undefined) {
+       if (false) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] BlockStatement
lib/store/connections.ts:133:34
-       if (input.url !== undefined) {
-         rec.urlSafe = redactUrl(input.url);
-         secretPatch.url = input.url;
-       }
+       if (input.url !== undefined) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:133:9
-       if (input.url !== undefined) {
+       if (input.url === undefined) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:137:9
-       if (password !== undefined) secretPatch.password = password;
+       if (true) secretPatch.password = password;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:137:9
-       if (password !== undefined) secretPatch.password = password;
+       if (false) secretPatch.password = password;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:137:9
-       if (password !== undefined) secretPatch.password = password;
+       if (password === undefined) secretPatch.password = password;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:138:9
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (true) this.secrets.set(input.id, secretPatch);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:138:9
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (false) this.secrets.set(input.id, secretPatch);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:138:9
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (Object.keys(secretPatch).length >= 0) this.secrets.set(input.id, secretPatch);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] CallExpression
lib/store/connections.ts:138:46
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (Object.keys(secretPatch).length > 0) ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:138:9
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (Object.keys(secretPatch).length <= 0) this.secrets.set(input.id, secretPatch);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] CallExpression
lib/store/connections.ts:140:5
-       data.connections.push(rec);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] CallExpression
lib/store/connections.ts:141:5
-       this.save(data);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 30 more tests!

[Survived] BlockStatement
lib/store/connections.ts:146:80
-     update(id: string, patch: ConnectionUpdateInput): ConnectionMeta | undefined {
-       const data = this.load();
-       const rec = this.findRec(data, id);
-       if (!rec) return undefined;
-       if (patch.name !== undefined) rec.name = patch.name;
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
-       if (patch.fields !== undefined) {
-         const { clean, password } = splitPassword(patch.fields);
-         rec.fields = clean;
-         if (password !== undefined) this.secrets.set(id, { password });
-       }
-       if (patch.url !== undefined) {
-         rec.urlSafe = redactUrl(patch.url);
-         this.secrets.set(id, { url: patch.url });
-       }
-       this.save(data);
-       return toMeta(rec);
-     }
+     update(id: string, patch: ConnectionUpdateInput): ConnectionMeta | undefined {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] BooleanLiteral
lib/store/connections.ts:149:9
-       if (!rec) return undefined;
+       if (rec) return undefined;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:149:9
-       if (!rec) return undefined;
+       if (true) return undefined;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:149:9
-       if (!rec) return undefined;
+       if (false) return undefined;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:151:9
-       if (patch.name !== undefined) rec.name = patch.name;
+       if (true) rec.name = patch.name;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:151:9
-       if (patch.name !== undefined) rec.name = patch.name;
+       if (false) rec.name = patch.name;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:151:9
-       if (patch.name !== undefined) rec.name = patch.name;
+       if (patch.name === undefined) rec.name = patch.name;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:152:9
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+       if (true) rec.ssl = patch.ssl;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:152:9
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+       if (false) rec.ssl = patch.ssl;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:152:9
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+       if (patch.ssl === undefined) rec.ssl = patch.ssl;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] BlockStatement
lib/store/connections.ts:153:37
-       if (patch.fields !== undefined) {
-         const { clean, password } = splitPassword(patch.fields);
-         rec.fields = clean;
-         if (password !== undefined) this.secrets.set(id, { password });
-       }
+       if (patch.fields !== undefined) {}
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:156:11
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (true) this.secrets.set(id, { password });
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:153:9
-       if (patch.fields !== undefined) {
+       if (true) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:153:9
-       if (patch.fields !== undefined) {
+       if (false) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:153:9
-       if (patch.fields !== undefined) {
+       if (patch.fields === undefined) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:156:11
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (false) this.secrets.set(id, { password });
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:156:11
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (password === undefined) this.secrets.set(id, { password });
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] BlockStatement
lib/store/connections.ts:158:34
-       if (patch.url !== undefined) {
-         rec.urlSafe = redactUrl(patch.url);
-         this.secrets.set(id, { url: patch.url });
-       }
+       if (patch.url !== undefined) {}
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ObjectLiteral
lib/store/connections.ts:160:28
-         this.secrets.set(id, { url: patch.url });
+         this.secrets.set(id, {});
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:158:9
-       if (patch.url !== undefined) {
+       if (true) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:158:9
-       if (patch.url !== undefined) {
+       if (patch.url === undefined) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:158:9
-       if (patch.url !== undefined) {
+       if (false) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] CallExpression
lib/store/connections.ts:162:5
-       this.save(data);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] BlockStatement
lib/store/connections.ts:167:31
-     remove(id: string): boolean {
-       const data = this.load();
-       const idx = data.connections.findIndex((c) => c.id === id);
-       if (idx < 0) return false;
-       data.connections.splice(idx, 1);
-       this.save(data);
-       this.secrets.delete(id);
-       this.grants.removeConn(id);
-       return true;
-     }
+     remove(id: string): boolean {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] ConditionalExpression
lib/store/connections.ts:169:51
-       const idx = data.connections.findIndex((c) => c.id === id);
+       const idx = data.connections.findIndex((c) => true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] ArrowFunction
lib/store/connections.ts:169:44
-       const idx = data.connections.findIndex((c) => c.id === id);
+       const idx = data.connections.findIndex(() => undefined);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] ConditionalExpression
lib/store/connections.ts:169:51
-       const idx = data.connections.findIndex((c) => c.id === id);
+       const idx = data.connections.findIndex((c) => false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] EqualityOperator
lib/store/connections.ts:169:51
-       const idx = data.connections.findIndex((c) => c.id === id);
+       const idx = data.connections.findIndex((c) => c.id !== id);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] ConditionalExpression
lib/store/connections.ts:170:9
-       if (idx < 0) return false;
+       if (true) return false;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] ConditionalExpression
lib/store/connections.ts:170:9
-       if (idx < 0) return false;
+       if (false) return false;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] EqualityOperator
lib/store/connections.ts:170:9
-       if (idx < 0) return false;
+       if (idx <= 0) return false;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] BooleanLiteral
lib/store/connections.ts:170:25
-       if (idx < 0) return false;
+       if (idx < 0) return true;
Tests ran:
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] EqualityOperator
lib/store/connections.ts:170:9
-       if (idx < 0) return false;
+       if (idx >= 0) return false;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
  and 1 more test!

[Survived] CallExpression
lib/store/connections.ts:171:5
-       data.connections.splice(idx, 1);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] CallExpression
lib/store/connections.ts:172:5
-       this.save(data);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] CallExpression
lib/store/connections.ts:173:5
-       this.secrets.delete(id);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] CallExpression
lib/store/connections.ts:174:5
-       this.grants.removeConn(id);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BooleanLiteral
lib/store/connections.ts:175:12
-       return true;
+       return false;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BlockStatement
lib/store/connections.ts:182:46
-     testTarget(id: string): ResolvedConnection {
-       const rec = this.findRec(this.load(), id);
-       if (!rec) throw new Error(`连接不存在: ${id}`);
-       const meta = toMeta(rec);
-       const rc: ResolvedConnection = { meta };
-       const sec = this.secrets.get(id);
-       if (sec?.url !== undefined) rc.url = sec.url;
-       let fields = rec.fields ? { ...rec.fields } : undefined;
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
-       if (fields !== undefined) rc.fields = fields;
-       if (rec.ssl !== undefined) rc.ssl = rec.ssl;
-       return rc;
-     }
+     testTarget(id: string): ResolvedConnection {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] StringLiteral
lib/store/connections.ts:184:31
-       if (!rec) throw new Error(`连接不存在: ${id}`);
+       if (!rec) throw new Error(``);
Tests ran:
    ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错

[Survived] BooleanLiteral
lib/store/connections.ts:184:9
-       if (!rec) throw new Error(`连接不存在: ${id}`);
+       if (rec) throw new Error(`连接不存在: ${id}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:184:9
-       if (!rec) throw new Error(`连接不存在: ${id}`);
+       if (true) throw new Error(`连接不存在: ${id}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:184:9
-       if (!rec) throw new Error(`连接不存在: ${id}`);
+       if (false) throw new Error(`连接不存在: ${id}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:188:9
-       if (sec?.url !== undefined) rc.url = sec.url;
+       if (true) rc.url = sec.url;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:186:36
-       const rc: ResolvedConnection = { meta };
+       const rc: ResolvedConnection = {};
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:189:31
-       let fields = rec.fields ? { ...rec.fields } : undefined;
+       let fields = rec.fields ? {} : undefined;
Tests ran:
    ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错

[Survived] ConditionalExpression
lib/store/connections.ts:188:9
-       if (sec?.url !== undefined) rc.url = sec.url;
+       if (false) rc.url = sec.url;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:188:9
-       if (sec?.url !== undefined) rc.url = sec.url;
+       if (sec?.url === undefined) rc.url = sec.url;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] OptionalChaining
lib/store/connections.ts:188:9
-       if (sec?.url !== undefined) rc.url = sec.url;
+       if (sec.url !== undefined) rc.url = sec.url;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:190:9
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (true) (fields ??= {}).password = sec.password;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:190:9
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (sec?.password === undefined) (fields ??= {}).password = sec.password;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!
