[Survived] AssignmentOperator
lib/store/connections.ts:190:39
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (sec?.password !== undefined) (fields &&= {}).password = sec.password;
Tests ran:
    ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错

[Survived] ConditionalExpression
lib/store/connections.ts:190:9
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (false) (fields ??= {}).password = sec.password;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] OptionalChaining
lib/store/connections.ts:190:9
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (sec.password !== undefined) (fields ??= {}).password = sec.password;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:191:9
-       if (fields !== undefined) rc.fields = fields;
+       if (true) rc.fields = fields;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:191:9
-       if (fields !== undefined) rc.fields = fields;
+       if (false) rc.fields = fields;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:191:9
-       if (fields !== undefined) rc.fields = fields;
+       if (fields === undefined) rc.fields = fields;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:192:9
-       if (rec.ssl !== undefined) rc.ssl = rec.ssl;
+       if (true) rc.ssl = rec.ssl;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:192:9
-       if (rec.ssl !== undefined) rc.ssl = rec.ssl;
+       if (false) rc.ssl = rec.ssl;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:192:9
-       if (rec.ssl !== undefined) rc.ssl = rec.ssl;
+       if (rec.ssl === undefined) rc.ssl = rec.ssl;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 14 more tests!

[Survived] BlockStatement
lib/store/grants.ts:22:28
-     constructor(dir: string) {
-       this.file = path.join(dir, 'grants.json');
-     }
+     constructor(dir: string) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] BlockStatement
lib/store/grants.ts:26:30
-     private load(): GrantsFile {
-       return readJson<GrantsFile>(this.file, { grants: {} });
-     }
+     private load(): GrantsFile {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
  and 37 more tests!

[Survived] ObjectLiteral
lib/store/grants.ts:27:44
-       return readJson<GrantsFile>(this.file, { grants: {} });
+       return readJson<GrantsFile>(this.file, {});
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
  and 37 more tests!

[Survived] StringLiteral
lib/store/grants.ts:23:32
-       this.file = path.join(dir, 'grants.json');
+       this.file = path.join(dir, "");
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] BlockStatement
lib/store/grants.ts:35:73
-     grantsFor(projectKey: string): { connId: string; mode: AccessMode }[] {
-       return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
-     }
+     grantsFor(projectKey: string): { connId: string; mode: AccessMode }[] {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    业务路由与确认流程 GET /api/audit 与 /api/state
    GrantStore grant 后 grantsFor/check 可见
  and 3 more tests!

[Survived] LogicalOperator
lib/store/grants.ts:36:13
-       return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
+       return (this.load().grants[projectKey] && []).map(({ connId, mode }) => ({ connId, mode }));
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    业务路由与确认流程 GET /api/audit 与 /api/state
    GrantStore grant 后 grantsFor/check 可见
  and 3 more tests!

[Survived] BlockStatement
lib/store/grants.ts:30:40
-     private save(data: GrantsFile): void {
-       writeJsonAtomic(this.file, data);
-     }
+     private save(data: GrantsFile): void {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ArrayDeclaration
lib/store/grants.ts:36:47
-       return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
+       return (this.load().grants[projectKey] ?? ["Stryker was here"]).map(({ connId, mode }) => ({ connId, mode }));
Tests ran:
    GrantStore grantsFor 未授权项目返回空数组

[Survived] ArrowFunction
lib/store/grants.ts:36:55
-       return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
+       return (this.load().grants[projectKey] ?? []).map(() => undefined);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    业务路由与确认流程 GET /api/audit 与 /api/state
    GrantStore grant 后 grantsFor/check 可见
  and 3 more tests!

[Survived] CallExpression
lib/store/grants.ts:31:5
-       writeJsonAtomic(this.file, data);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ObjectLiteral
lib/store/grants.ts:36:78
-       return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
+       return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({}));
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    业务路由与确认流程 GET /api/audit 与 /api/state
    GrantStore grant 后 grantsFor/check 可见
  and 2 more tests!

[Survived] BlockStatement
lib/store/grants.ts:40:69
-     grant(projectKey: string, connId: string, mode: AccessMode): void {
-       const data = this.load();
-       const list = data.grants[projectKey] ?? [];
-       const existing = list.find((g) => g.connId === connId);
-       if (existing) {
-         existing.mode = mode;
-         existing.grantedAt = new Date().toISOString();
-       } else {
-         list.push({ connId, mode, grantedAt: new Date().toISOString() });
-       }
-       data.grants[projectKey] = list;
-       this.save(data);
-     }
+     grant(projectKey: string, connId: string, mode: AccessMode): void {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ArrayDeclaration
lib/store/grants.ts:42:45
-       const list = data.grants[projectKey] ?? [];
+       const list = data.grants[projectKey] ?? ["Stryker was here"];
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ArrowFunction
lib/store/grants.ts:43:32
-       const existing = list.find((g) => g.connId === connId);
+       const existing = list.find(() => undefined);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] LogicalOperator
lib/store/grants.ts:42:18
-       const list = data.grants[projectKey] ?? [];
+       const list = data.grants[projectKey] && [];
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:43:39
-       const existing = list.find((g) => g.connId === connId);
+       const existing = list.find((g) => true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
    GrantStore 同连接重复授权更新模式（ro → rw）
  and 1 more test!

[Survived] ConditionalExpression
lib/store/grants.ts:43:39
-       const existing = list.find((g) => g.connId === connId);
+       const existing = list.find((g) => false);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
    GrantStore 同连接重复授权更新模式（ro → rw）
  and 1 more test!

[Survived] EqualityOperator
lib/store/grants.ts:43:39
-       const existing = list.find((g) => g.connId === connId);
+       const existing = list.find((g) => g.connId !== connId);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
    GrantStore 同连接重复授权更新模式（ro → rw）
  and 1 more test!

[Survived] BlockStatement
lib/store/grants.ts:44:19
-       if (existing) {
-         existing.mode = mode;
-         existing.grantedAt = new Date().toISOString();
-       } else {
+       if (existing) {} else {
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore 同连接重复授权更新模式（ro → rw）

[Survived] ConditionalExpression
lib/store/grants.ts:44:9
-       if (existing) {
+       if (true) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:44:9
-       if (existing) {
+       if (false) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] BlockStatement
lib/store/grants.ts:47:12
-       } else {
-         list.push({ connId, mode, grantedAt: new Date().toISOString() });
-       }
+       } else {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] BlockStatement
lib/store/grants.ts:55:52
-     revoke(projectKey: string, connId: string): void {
-       const data = this.load();
-       const list = data.grants[projectKey];
-       if (!list) return;
-       const next = list.filter((g) => g.connId !== connId);
-       if (next.length === list.length) return;
-       if (next.length === 0) delete data.grants[projectKey];
-       else data.grants[projectKey] = next;
-       this.save(data);
-     }
+     revoke(projectKey: string, connId: string): void {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] BooleanLiteral
lib/store/grants.ts:58:9
-       if (!list) return;
+       if (list) return;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ObjectLiteral
lib/store/grants.ts:48:17
-         list.push({ connId, mode, grantedAt: new Date().toISOString() });
+         list.push({});
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] CallExpression
lib/store/grants.ts:51:5
-       this.save(data);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 grants PUT/GET/DELETE
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 28 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:58:9
-       if (!list) return;
+       if (true) return;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ConditionalExpression
lib/store/grants.ts:58:9
-       if (!list) return;
+       if (false) return;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] MethodExpression
lib/store/grants.ts:59:18
-       const next = list.filter((g) => g.connId !== connId);
+       const next = list;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ArrowFunction
lib/store/grants.ts:59:30
-       const next = list.filter((g) => g.connId !== connId);
+       const next = list.filter(() => undefined);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ConditionalExpression
lib/store/grants.ts:59:37
-       const next = list.filter((g) => g.connId !== connId);
+       const next = list.filter((g) => true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ConditionalExpression
lib/store/grants.ts:59:37
-       const next = list.filter((g) => g.connId !== connId);
+       const next = list.filter((g) => false);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] EqualityOperator
lib/store/grants.ts:59:37
-       const next = list.filter((g) => g.connId !== connId);
+       const next = list.filter((g) => g.connId === connId);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ConditionalExpression
lib/store/grants.ts:60:9
-       if (next.length === list.length) return;
+       if (true) return;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] EqualityOperator
lib/store/grants.ts:60:9
-       if (next.length === list.length) return;
+       if (next.length !== list.length) return;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ConditionalExpression
lib/store/grants.ts:61:9
-       if (next.length === 0) delete data.grants[projectKey];
+       if (true) delete data.grants[projectKey];
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] EqualityOperator
lib/store/grants.ts:61:9
-       if (next.length === 0) delete data.grants[projectKey];
+       if (next.length !== 0) delete data.grants[projectKey];
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] CallExpression
lib/store/grants.ts:63:5
-       this.save(data);
+       ;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] BlockStatement
lib/store/grants.ts:67:69
-     check(projectKey: string, connId: string): AccessMode | undefined {
-       const modes = (this.load().grants[projectKey] ?? [])
-         .filter((g) => g.connId === connId)
-         .map((g) => g.mode);
-       if (modes.includes('rw')) return 'rw';
-       return modes.includes('ro') ? 'ro' : undefined;
-     }
+     check(projectKey: string, connId: string): AccessMode | undefined {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] MethodExpression
lib/store/grants.ts:68:19
-       const modes = (this.load().grants[projectKey] ?? [])
-         .filter((g) => g.connId === connId)
+       const modes = this.load().grants[projectKey] ?? []
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] LogicalOperator
lib/store/grants.ts:68:20
-       const modes = (this.load().grants[projectKey] ?? [])
+       const modes = (this.load().grants[projectKey] && [])
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] ArrowFunction
lib/store/grants.ts:69:15
-         .filter((g) => g.connId === connId)
+         .filter(() => undefined)
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:69:22
-         .filter((g) => g.connId === connId)
+         .filter((g) => true)
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 24 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:69:22
-         .filter((g) => g.connId === connId)
+         .filter((g) => false)
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 24 more tests!

[Survived] EqualityOperator
lib/store/grants.ts:69:22
-         .filter((g) => g.connId === connId)
+         .filter((g) => g.connId !== connId)
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 24 more tests!

[Survived] ArrowFunction
lib/store/grants.ts:70:12
-         .map((g) => g.mode);
+         .map(() => undefined);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:71:9
-       if (modes.includes('rw')) return 'rw';
+       if (true) return 'rw';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:71:9
-       if (modes.includes('rw')) return 'rw';
+       if (false) return 'rw';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] StringLiteral
lib/store/grants.ts:71:24
-       if (modes.includes('rw')) return 'rw';
+       if (modes.includes("")) return 'rw';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 27 more tests!

[Survived] StringLiteral
lib/store/grants.ts:72:35
-       return modes.includes('ro') ? 'ro' : undefined;
+       return modes.includes('ro') ? "" : undefined;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: 危险确认与 challenge ro 连接对危险语句也先报 READ_ONLY（授权优先于 guard）
  and 2 more tests!

[Survived] StringLiteral
lib/store/grants.ts:72:27
-       return modes.includes('ro') ? 'ro' : undefined;
+       return modes.includes("") ? 'ro' : undefined;
Tests ran:
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 8 more tests!

[Survived] StringLiteral
lib/store/grants.ts:71:38
-       if (modes.includes('rw')) return 'rw';
+       if (modes.includes('rw')) return "";
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 19 more tests!

[Survived] BlockStatement
lib/store/grants.ts:76:36
-     removeConn(connId: string): void {
-       const data = this.load();
-       let dirty = false;
-       for (const key of Object.keys(data.grants)) {
-         const list = data.grants[key];
-         if (!list) continue;
-         const next = list.filter((g) => g.connId !== connId);
-         if (next.length !== list.length) {
-           dirty = true;
-           if (next.length === 0) delete data.grants[key];
-           else data.grants[key] = next;
-         }
-       }
-       if (dirty) this.save(data);
-     }
+     removeConn(connId: string): void {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BooleanLiteral
lib/store/grants.ts:81:11
-         if (!list) continue;
+         if (list) continue;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BlockStatement
lib/store/grants.ts:79:49
-       for (const key of Object.keys(data.grants)) {
-         const list = data.grants[key];
-         if (!list) continue;
-         const next = list.filter((g) => g.connId !== connId);
-         if (next.length !== list.length) {
-           dirty = true;
-           if (next.length === 0) delete data.grants[key];
-           else data.grants[key] = next;
-         }
-       }
+       for (const key of Object.keys(data.grants)) {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:81:11
-         if (!list) continue;
+         if (true) continue;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] MethodExpression
lib/store/grants.ts:82:20
-         const next = list.filter((g) => g.connId !== connId);
+         const next = list;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ArrowFunction
lib/store/grants.ts:82:32
-         const next = list.filter((g) => g.connId !== connId);
+         const next = list.filter(() => undefined);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:82:39
-         const next = list.filter((g) => g.connId !== connId);
+         const next = list.filter((g) => true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:82:39
-         const next = list.filter((g) => g.connId !== connId);
+         const next = list.filter((g) => false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] EqualityOperator
lib/store/grants.ts:82:39
-         const next = list.filter((g) => g.connId !== connId);
+         const next = list.filter((g) => g.connId === connId);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:83:11
-         if (next.length !== list.length) {
+         if (false) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BlockStatement
lib/store/grants.ts:83:40
-         if (next.length !== list.length) {
-           dirty = true;
-           if (next.length === 0) delete data.grants[key];
-           else data.grants[key] = next;
-         }
+         if (next.length !== list.length) {}
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BooleanLiteral
lib/store/grants.ts:84:17
-           dirty = true;
+           dirty = false;
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] EqualityOperator
lib/store/grants.ts:83:11
-         if (next.length !== list.length) {
+         if (next.length === list.length) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:85:13
-           if (next.length === 0) delete data.grants[key];
+           if (true) delete data.grants[key];
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] EqualityOperator
lib/store/grants.ts:85:13
-           if (next.length === 0) delete data.grants[key];
+           if (next.length !== 0) delete data.grants[key];
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] CallExpression
lib/store/grants.ts:89:16
-       if (dirty) this.save(data);
+       if (dirty) ;
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:89:9
-       if (dirty) this.save(data);
+       if (false) this.save(data);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] BlockStatement
lib/store/index.ts:40:33
-     constructor(homeDir?: string) {
-       const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
-       this.dir = path.join(home, 'db-tool');
-       fs.mkdirSync(this.dir, { recursive: true });
-       chmodBestEffort(this.dir, 0o700);
-       this.secrets = new SecretsBox(this.dir);
-       this.grants = new GrantStore(this.dir);
-       this.audit = new AuditLog(this.dir);
-       this.connections = new ConnectionStore(this.dir, this.secrets, this.grants);
-     }
+     constructor(homeDir?: string) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!
