[Killed] ConditionalExpression
lib/manager.ts:321:20
     grants: { connId: string; mode: 'ro' | 'rw' }[];
     auditTail: AuditEntry[];
   } {
-    const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+    const grants = false ? this.grantsFor(projectPath) : [];
     return {
       connections: this.listConnections(),
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
lib/manager.ts:330:34
   }
 
   /** 关闭缓存的适配器并停止 challenge 清理 */
-  async dispose(): Promise<void> {
-    this.disposed = true;
-    this.challenges.dispose();
-    const pending = [...this.adapterCache.values()];
-    this.adapterCache.clear();
-    for (const p of pending) {
-      try {
-        const a = await p;
-        await a.close().catch(() => {});
-      } catch {
-        // 缓存里的加载失败项直接忽略
-      }
-    }
-  }
+  async dispose(): Promise<void> {}
 
   /* ---------------- 内部 ---------------- */
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: expected [] to deeply equal [ 'c1', 'c2' ]

[Killed] BooleanLiteral
lib/manager.ts:331:21
 
   /** 关闭缓存的适配器并停止 challenge 清理 */
   async dispose(): Promise<void> {
-    this.disposed = true;
+    this.disposed = false;
     this.challenges.dispose();
     const pending = [...this.adapterCache.values()];
killedBy: DbToolService.dispose dispose 后拒绝新工作（fail-closed：服务已关闭，而非静默执行）
statusReason: promise resolved "{ columns: [ 'answer' ], …(2) }" instead of rejecting

[Killed] CallExpression
lib/manager.ts:332:5
   /** 关闭缓存的适配器并停止 challenge 清理 */
   async dispose(): Promise<void> {
     this.disposed = true;
-    this.challenges.dispose();
+    ;
     const pending = [...this.adapterCache.values()];
     this.adapterCache.clear();
killedBy: DbToolService.dispose dispose 后 ChallengeStore 停用（create 抛错）
statusReason: expected [Function] to throw an error

[Killed] ArrayDeclaration
lib/manager.ts:333:21
   async dispose(): Promise<void> {
     this.disposed = true;
     this.challenges.dispose();
-    const pending = [...this.adapterCache.values()];
+    const pending = [];
     this.adapterCache.clear();
     for (const p of pending) {
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: expected [] to deeply equal [ 'c1', 'c2' ]

[Killed] CallExpression
lib/manager.ts:334:5
     this.disposed = true;
     this.challenges.dispose();
     const pending = [...this.adapterCache.values()];
-    this.adapterCache.clear();
+    ;
     for (const p of pending) {
       try {
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
lib/manager.ts:335:30
     this.challenges.dispose();
     const pending = [...this.adapterCache.values()];
     this.adapterCache.clear();
-    for (const p of pending) {
-      try {
-        const a = await p;
-        await a.close().catch(() => {});
-      } catch {
-        // 缓存里的加载失败项直接忽略
-      }
-    }
+    for (const p of pending) {}
   }
 
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: expected [] to deeply equal [ 'c1', 'c2' ]

[Killed] BlockStatement
lib/manager.ts:336:11
     const pending = [...this.adapterCache.values()];
     this.adapterCache.clear();
     for (const p of pending) {
-      try {
-        const a = await p;
-        await a.close().catch(() => {});
-      } catch {
+      try {} catch {
         // 缓存里的加载失败项直接忽略
       }
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: expected [] to deeply equal [ 'c1', 'c2' ]

[Killed] BlockStatement
lib/manager.ts:347:93
 
   /* ---------------- 内部 ---------------- */
 
-  private requireConn(connId: string): ReturnType<DbToolStore['connections']['testTarget']> {
-    try {
-      return this.store.connections.testTarget(connId);
-    } catch {
-      throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
-    }
-  }
+  private requireConn(connId: string): ReturnType<DbToolStore['connections']['testTarget']> {}
 
   /** 授权校验 + 取（缓存的）适配器 */
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] BlockStatement
lib/manager.ts:348:9
   /* ---------------- 内部 ---------------- */
 
   private requireConn(connId: string): ReturnType<DbToolStore['connections']['testTarget']> {
-    try {
-      return this.store.connections.testTarget(connId);
-    } catch {
+    try {} catch {
       throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
     }
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[NoCoverage] BlockStatement
lib/manager.ts:350:13
   private requireConn(connId: string): ReturnType<DbToolStore['connections']['testTarget']> {
     try {
       return this.store.connections.testTarget(connId);
-    } catch {
-      throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
lib/manager.ts:360:76
     projectPath: string | undefined,
     connId: string,
     needWrite: boolean,
-  ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
-    if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
-    if (!projectPath || projectPath.trim() === '') {
-      throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
-    }
-    const key = normalizeProjectKey(projectPath);
-    const mode = this.store.grants.check(key, connId);
-    if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
-    if (needWrite && mode === 'ro') {
-      throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
-    }
-    const adapter = await this.adapterFor(connId, mode);
-    return { key, mode, adapter };
-  }
+  ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {}
 
   /** 关闭指定连接的全部缓存适配器（mode 变更/凭证变更/删除时） */
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/manager.ts:361:9
     connId: string,
     needWrite: boolean,
   ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
-    if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+    if (true) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
     if (!projectPath || projectPath.trim() === '') {
       throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, error: '服务已关闭', …(1) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/manager.ts:361:9
     connId: string,
     needWrite: boolean,
   ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
-    if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+    if (false) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
     if (!projectPath || projectPath.trim() === '') {
       throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
killedBy: DbToolService.dispose dispose 后拒绝新工作（fail-closed：服务已关闭，而非静默执行）
statusReason: promise resolved "{ columns: [ 'answer' ], …(2) }" instead of rejecting

[Killed] ConditionalExpression
lib/manager.ts:362:9
     needWrite: boolean,
   ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
     if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
-    if (!projectPath || projectPath.trim() === '') {
+    if (true) {
       throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
     }
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
lib/manager.ts:362:25
     needWrite: boolean,
   ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
     if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
-    if (!projectPath || projectPath.trim() === '') {
+    if (!projectPath || projectPath.trim() !== '') {
       throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
     }
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 业务操作需要 projectPath（匿名项目仅可管理连… { code: '…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[Survived] StringLiteral
lib/manager.ts:363:53
   ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
     if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
     if (!projectPath || projectPath.trim() === '') {
-      throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
+      throw new DbToolError('UNAUTHORIZED_PROJECT', "");
     }
     const key = normalizeProjectKey(projectPath);

[Killed] ConditionalExpression
lib/manager.ts:367:9
     }
     const key = normalizeProjectKey(projectPath);
     const mode = this.store.grants.check(key, connId);
-    if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+    if (false) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
     if (needWrite && mode === 'ro') {
       throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
killedBy: 业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
statusReason: expected { ok: true, data: { …(3) } } to match object { ok: false, …(1) }
(4 matching properties omitted from actual)

[Killed] BooleanLiteral
lib/manager.ts:367:9
     }
     const key = normalizeProjectKey(projectPath);
     const mode = this.store.grants.check(key, connId);
-    if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+    if (mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
     if (needWrite && mode === 'ro') {
       throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
killedBy: DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
statusReason: promise resolved "{ columns: [ 'answer' ], …(2) }" instead of rejecting

[Killed] EqualityOperator
lib/manager.ts:368:22
     const key = normalizeProjectKey(projectPath);
     const mode = this.store.grants.check(key, connId);
     if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
-    if (needWrite && mode === 'ro') {
+    if (needWrite && mode !== 'ro') {
       throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
     }
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Killed] ConditionalExpression
lib/manager.ts:368:9
     const key = normalizeProjectKey(projectPath);
     const mode = this.store.grants.check(key, connId);
     if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
-    if (needWrite && mode === 'ro') {
+    if (true) {
       throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
     }
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: 该连接对本项目为只读授权（ro），拒绝写操作

[Survived] StringLiteral
lib/manager.ts:369:42
     const mode = this.store.grants.check(key, connId);
     if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
     if (needWrite && mode === 'ro') {
-      throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
+      throw new DbToolError('READ_ONLY', "");
     }
     const adapter = await this.adapterFor(connId, mode);

[Killed] ObjectLiteral
lib/manager.ts:372:12
       throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
     }
     const adapter = await this.adapterFor(connId, mode);
-    return { key, mode, adapter };
+    return {};
   }
 
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: Cannot read properties of undefined (reading 'kind')

[Survived] BlockStatement
lib/manager.ts:376:61
   }
 
   /** 关闭指定连接的全部缓存适配器（mode 变更/凭证变更/删除时） */
-  private async dropAdapters(connId: string): Promise<void> {
-    const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
-    for (const k of keys) {
-      const p = this.adapterCache.get(k);
-      this.adapterCache.delete(k);
-      if (!p) continue;
-      try {
-        const a = await p;
-        await a.close().catch(() => {});
-      } catch {
-        // 加载失败或已断开的旧实例直接忽略
-      }
-    }
-  }
+  private async dropAdapters(connId: string): Promise<void> {}
 
   private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {

[Survived] ArrowFunction
lib/manager.ts:377:55
 
   /** 关闭指定连接的全部缓存适配器（mode 变更/凭证变更/删除时） */
   private async dropAdapters(connId: string): Promise<void> {
-    const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+    const keys = [...this.adapterCache.keys()].filter(() => undefined);
     for (const k of keys) {
       const p = this.adapterCache.get(k);

[Survived] MethodExpression
lib/manager.ts:377:62
 
   /** 关闭指定连接的全部缓存适配器（mode 变更/凭证变更/删除时） */
   private async dropAdapters(connId: string): Promise<void> {
-    const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+    const keys = [...this.adapterCache.keys()].filter((k) => k.endsWith(`${connId}@mode=`));
     for (const k of keys) {
       const p = this.adapterCache.get(k);

[Survived] BlockStatement
lib/manager.ts:378:27
   /** 关闭指定连接的全部缓存适配器（mode 变更/凭证变更/删除时） */
   private async dropAdapters(connId: string): Promise<void> {
     const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
-    for (const k of keys) {
-      const p = this.adapterCache.get(k);
-      this.adapterCache.delete(k);
-      if (!p) continue;
-      try {
-        const a = await p;
-        await a.close().catch(() => {});
-      } catch {
-        // 加载失败或已断开的旧实例直接忽略
-      }
-    }
+    for (const k of keys) {}
   }
 

[Survived] CallExpression
lib/manager.ts:380:7
     const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
     for (const k of keys) {
       const p = this.adapterCache.get(k);
-      this.adapterCache.delete(k);
+      ;
       if (!p) continue;
       try {

[Survived] ConditionalExpression
lib/manager.ts:381:11
     for (const k of keys) {
       const p = this.adapterCache.get(k);
       this.adapterCache.delete(k);
-      if (!p) continue;
+      if (true) continue;
       try {
         const a = await p;

[Survived] ConditionalExpression
lib/manager.ts:381:11
     for (const k of keys) {
       const p = this.adapterCache.get(k);
       this.adapterCache.delete(k);
-      if (!p) continue;
+      if (false) continue;
       try {
         const a = await p;

[Survived] BlockStatement
lib/manager.ts:382:11
       const p = this.adapterCache.get(k);
       this.adapterCache.delete(k);
       if (!p) continue;
-      try {
-        const a = await p;
-        await a.close().catch(() => {});
-      } catch {
+      try {} catch {
         // 加载失败或已断开的旧实例直接忽略
       }

[Killed] BlockStatement
lib/manager.ts:391:83
     }
   }
 
-  private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {
-    const cacheKey = `${connId}@mode=${mode}`;
-    let p = this.adapterCache.get(cacheKey);
-    if (!p) {
-      p = (async () => {
-        const rc = this.requireConn(connId);
-        const factory = await this.resolver(rc.meta.kind);
-        return factory(rc, { mode });
-      })().catch((e) => {
-        this.adapterCache.delete(cacheKey);
-        throw e instanceof DbToolError ? e : this.toDriverError(e);
-      });
-      this.adapterCache.set(cacheKey, p);
-    }
-    return p;
-  }
+  private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {}
 
   /** guard 主流程：分类 → challenge → 执行 → 审计 */
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
lib/manager.ts:394:9
   private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {
     const cacheKey = `${connId}@mode=${mode}`;
     let p = this.adapterCache.get(cacheKey);
-    if (!p) {
+    if (p) {
       p = (async () => {
         const rc = this.requireConn(connId);
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/manager.ts:394:9
   private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {
     const cacheKey = `${connId}@mode=${mode}`;
     let p = this.adapterCache.get(cacheKey);
-    if (!p) {
+    if (false) {
       p = (async () => {
         const rc = this.requireConn(connId);
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] BlockStatement
lib/manager.ts:395:24
     const cacheKey = `${connId}@mode=${mode}`;
     let p = this.adapterCache.get(cacheKey);
     if (!p) {
-      p = (async () => {
-        const rc = this.requireConn(connId);
-        const factory = await this.resolver(rc.meta.kind);
-        return factory(rc, { mode });
-      })().catch((e) => {
+      p = (async () => {})().catch((e) => {
         this.adapterCache.delete(cacheKey);
         throw e instanceof DbToolError ? e : this.toDriverError(e);
killedBy: handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[NoCoverage] BlockStatement
lib/manager.ts:399:25
         const rc = this.requireConn(connId);
         const factory = await this.resolver(rc.meta.kind);
         return factory(rc, { mode });
-      })().catch((e) => {
-        this.adapterCache.delete(cacheKey);
-        throw e instanceof DbToolError ? e : this.toDriverError(e);
-      });
+      })().catch((e) => {});
       this.adapterCache.set(cacheKey, p);
     }

[NoCoverage] CallExpression
lib/manager.ts:400:9
         const factory = await this.resolver(rc.meta.kind);
         return factory(rc, { mode });
       })().catch((e) => {
-        this.adapterCache.delete(cacheKey);
+        ;
         throw e instanceof DbToolError ? e : this.toDriverError(e);
       });

[Killed] CallExpression
lib/manager.ts:403:7
         this.adapterCache.delete(cacheKey);
         throw e instanceof DbToolError ? e : this.toDriverError(e);
       });
-      this.adapterCache.set(cacheKey, p);
+      ;
     }
     return p;
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: expected [] to deeply equal [ 'c1', 'c2' ]

[Killed] LogicalOperator
lib/manager.ts:420:9
     rowsAffected?: (r: T) => number | undefined;
   }): Promise<T | NeedConfirm> {
     const { projectPath, connId, op, statement, challengeId } = args;
-    if (args.params !== undefined && !Array.isArray(args.params)) {
+    if (args.params !== undefined || !Array.isArray(args.params)) {
       throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
     }
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: params 必须是数组（绑定参数）

[Killed] ConditionalExpression
lib/manager.ts:420:9
     rowsAffected?: (r: T) => number | undefined;
   }): Promise<T | NeedConfirm> {
     const { projectPath, connId, op, statement, challengeId } = args;
-    if (args.params !== undefined && !Array.isArray(args.params)) {
+    if (true) {
       throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
     }
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: params 必须是数组（绑定参数）

[Killed] EqualityOperator
lib/manager.ts:423:72
     if (args.params !== undefined && !Array.isArray(args.params)) {
       throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
     }
-    const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
+    const { key, adapter } = await this.authorize(projectPath, connId, op !== 'execute');
     const kind = adapter.kind;
     const verdict = classifyStatement(kind, statement, op);
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Killed] ConditionalExpression
lib/manager.ts:423:72
     if (args.params !== undefined && !Array.isArray(args.params)) {
       throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
     }
-    const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
+    const { key, adapter } = await this.authorize(projectPath, connId, false);
     const kind = adapter.kind;
     const verdict = classifyStatement(kind, statement, op);
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Killed] BlockStatement
lib/manager.ts:427:37
     const kind = adapter.kind;
     const verdict = classifyStatement(kind, statement, op);
 
-    if (verdict.level === 'danger') {
-      const scope: ChallengeScope = { connId, projectKey: key };
-      if (!challengeId) {
-        const { id: cid } = this.challenges.create(statement, scope);
-        this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-        return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
-      }
-      if (!this.challenges.consume(challengeId, statement, scope)) {
-        this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
-        throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
-      }
-    }
+    if (verdict.level === 'danger') {}
 
     try {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/manager.ts:427:9
     const kind = adapter.kind;
     const verdict = classifyStatement(kind, statement, op);
 
-    if (verdict.level === 'danger') {
+    if (false) {
       const scope: ChallengeScope = { connId, projectKey: key };
       if (!challengeId) {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/manager.ts:429:25
 
     if (verdict.level === 'danger') {
       const scope: ChallengeScope = { connId, projectKey: key };
-      if (!challengeId) {
-        const { id: cid } = this.challenges.create(statement, scope);
-        this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-        return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
-      }
+      if (!challengeId) {}
       if (!this.challenges.consume(challengeId, statement, scope)) {
         this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起

[Killed] BooleanLiteral
lib/manager.ts:429:11
 
     if (verdict.level === 'danger') {
       const scope: ChallengeScope = { connId, projectKey: key };
-      if (!challengeId) {
+      if (challengeId) {
         const { id: cid } = this.challenges.create(statement, scope);
         this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起

[Killed] BooleanLiteral
lib/manager.ts:431:58
       const scope: ChallengeScope = { connId, projectKey: key };
       if (!challengeId) {
         const { id: cid } = this.challenges.create(statement, scope);
-        this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
+        this.audit(key, connId, op, statement, 'danger', true, false, 'NEEDS_CONFIRMATION');
         return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected { …(9) } to match object { Object (connId, danger, ...) }
(5 matching properties omitted from actual)

[Killed] BooleanLiteral
lib/manager.ts:431:65
       const scope: ChallengeScope = { connId, projectKey: key };
       if (!challengeId) {
         const { id: cid } = this.challenges.create(statement, scope);
-        this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
+        this.audit(key, connId, op, statement, 'danger', false, true, 'NEEDS_CONFIRMATION');
         return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected { …(9) } to match object { Object (connId, danger, ...) }
(5 matching properties omitted from actual)

[Killed] BooleanLiteral
lib/manager.ts:432:36
       if (!challengeId) {
         const { id: cid } = this.challenges.create(statement, scope);
         this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-        return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+        return { needConfirmation: false, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
       if (!this.challenges.consume(challengeId, statement, scope)) {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/manager.ts:432:97
       if (!challengeId) {
         const { id: cid } = this.challenges.create(statement, scope);
         this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-        return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+        return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason && '危险操作，需要用户确认' };
       }
       if (!this.challenges.consume(challengeId, statement, scope)) {
killedBy: DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
statusReason: expected '危险操作，需要用户确认' to contain '不可回滚'

[Killed] BlockStatement
lib/manager.ts:434:68
         this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
         return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
-      if (!this.challenges.consume(challengeId, statement, scope)) {
-        this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
-        throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
-      }
+      if (!this.challenges.consume(challengeId, statement, scope)) {}
     }
 
killedBy: DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Killed] ConditionalExpression
lib/manager.ts:434:11
         this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
         return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
-      if (!this.challenges.consume(challengeId, statement, scope)) {
+      if (false) {
         this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
         throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
killedBy: DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
statusReason: promise resolved "{ affectedRows: 1, …(1) }" instead of rejecting

[Survived] BooleanLiteral
lib/manager.ts:435:58
         return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
       if (!this.challenges.consume(challengeId, statement, scope)) {
-        this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+        this.audit(key, connId, op, statement, 'danger', true, false, 'INVALID_CHALLENGE');
         throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
       }
