[Survived] BooleanLiteral
lib/manager.ts:435:65
         return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
       }
       if (!this.challenges.consume(challengeId, statement, scope)) {
-        this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+        this.audit(key, connId, op, statement, 'danger', false, true, 'INVALID_CHALLENGE');
         throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
       }

[Killed] StringLiteral
lib/manager.ts:436:31
       }
       if (!this.challenges.consume(challengeId, statement, scope)) {
         this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
-        throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
+        throw new DbToolError("", '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
       }
     }
killedBy: DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
statusReason: expected DbToolError: 确认凭据无效（不存在、已使用、已过期或语句已变更），请重… { code: '' } to match object { code: 'INVALID_CHALLENGE' }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/manager.ts:440:9
       }
     }
 
-    try {
-      const result = await args.run(adapter);
-      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
-      return result;
-    } catch (e) {
+    try {} catch (e) {
       this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
       throw this.toDriverError(e);
killedBy: 业务路由与确认流程 query 危险读（FOR UPDATE）→ NEEDS_CONFIRMATION；携 challengeId 重发放行；篡改语句与重放均被拒
statusReason: expected { ok: true } to match object { ok: true, data: { rowCount: 1 } }

[Killed] EqualityOperator
lib/manager.ts:442:76
 
     try {
       const result = await args.run(adapter);
-      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level !== 'danger', true, undefined, args.rowsAffected?.(result));
       return result;
     } catch (e) {
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
lib/manager.ts:442:7
 
     try {
       const result = await args.run(adapter);
-      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+      ;
       return result;
     } catch (e) {
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
lib/manager.ts:444:17
       const result = await args.run(adapter);
       this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
       return result;
-    } catch (e) {
-      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
-      throw this.toDriverError(e);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] ConditionalExpression
lib/manager.ts:445:76
       this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
       return result;
     } catch (e) {
-      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+      this.audit(key, connId, op, statement, verdict.level as DangerLevel, true, false, this.errText(e));
       throw this.toDriverError(e);
     }

[NoCoverage] EqualityOperator
lib/manager.ts:445:76
       this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
       return result;
     } catch (e) {
-      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+      this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level !== 'danger', false, this.errText(e));
       throw this.toDriverError(e);
     }

[Killed] BlockStatement
lib/manager.ts:451:48
   }
 
   /** 脚本内句柄：NeedConfirm 无法在脚本中交互，转为可还原的 DbToolError */
-  private unwrapForScript(r: unknown): unknown {
-    if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
-      const nc = r as NeedConfirm;
-      throw new DbToolError('NEEDS_CONFIRMATION', JSON.stringify(nc));
-    }
-    return r;
-  }
+  private unwrapForScript(r: unknown): unknown {}
 
   private audit(
killedBy: 业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
statusReason: expected { ok: true, data: null } to match object { ok: false, …(1) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/manager.ts:452:39
 
   /** 脚本内句柄：NeedConfirm 无法在脚本中交互，转为可还原的 DbToolError */
   private unwrapForScript(r: unknown): unknown {
-    if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+    if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation !== true) {
       const nc = r as NeedConfirm;
       throw new DbToolError('NEEDS_CONFIRMATION', JSON.stringify(nc));
killedBy: 业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
statusReason: expected { ok: false, …(2) } to match object { ok: true }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/manager.ts:452:9
 
   /** 脚本内句柄：NeedConfirm 无法在脚本中交互，转为可还原的 DbToolError */
   private unwrapForScript(r: unknown): unknown {
-    if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+    if (true) {
       const nc = r as NeedConfirm;
       throw new DbToolError('NEEDS_CONFIRMATION', JSON.stringify(nc));
killedBy: DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
statusReason: {"columns":["answer"],"rows":[["SELECT 1"]],"rowCount":1}

[Killed] BlockStatement
lib/manager.ts:469:11
     ok: boolean,
     error?: string,
     rowsAffected?: number,
-  ): void {
-    try {
-      this.store.audit.append({
-        projectPathKey, connId, action, statement, danger, confirmed, ok,
-        ...(error !== undefined ? { error } : {}),
-        ...(rowsAffected !== undefined ? { rowsAffected } : {}),
-      });
-    } catch {
-      // 审计失败不阻塞业务（best-effort）
-    }
-  }
+  ): void {}
 
   private errText(e: unknown): string {
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
lib/manager.ts:470:9
     error?: string,
     rowsAffected?: number,
   ): void {
-    try {
-      this.store.audit.append({
-        projectPathKey, connId, action, statement, danger, confirmed, ok,
-        ...(error !== undefined ? { error } : {}),
-        ...(rowsAffected !== undefined ? { rowsAffected } : {}),
-      });
-    } catch {
+    try {} catch {
       // 审计失败不阻塞业务（best-effort）
     }
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
lib/manager.ts:473:13
     try {
       this.store.audit.append({
         projectPathKey, connId, action, statement, danger, confirmed, ok,
-        ...(error !== undefined ? { error } : {}),
+        ...(false ? { error } : {}),
         ...(rowsAffected !== undefined ? { rowsAffected } : {}),
       });
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
lib/manager.ts:473:13
     try {
       this.store.audit.append({
         projectPathKey, connId, action, statement, danger, confirmed, ok,
-        ...(error !== undefined ? { error } : {}),
+        ...(error === undefined ? { error } : {}),
         ...(rowsAffected !== undefined ? { rowsAffected } : {}),
       });
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected 0 to be greater than or equal to 1

[Survived] ConditionalExpression
lib/manager.ts:474:13
       this.store.audit.append({
         projectPathKey, connId, action, statement, danger, confirmed, ok,
         ...(error !== undefined ? { error } : {}),
-        ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+        ...(false ? { rowsAffected } : {}),
       });
     } catch {

[Survived] ConditionalExpression
lib/manager.ts:474:13
       this.store.audit.append({
         projectPathKey, connId, action, statement, danger, confirmed, ok,
         ...(error !== undefined ? { error } : {}),
-        ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+        ...(true ? { rowsAffected } : {}),
       });
     } catch {

[Survived] BlockStatement
lib/manager.ts:481:39
     }
   }
 
-  private errText(e: unknown): string {
-    return e instanceof Error ? e.message : String(e);
-  }
+  private errText(e: unknown): string {}
 
   private toDriverError(e: unknown): Error {

[Killed] BlockStatement
lib/manager.ts:485:44
     return e instanceof Error ? e.message : String(e);
   }
 
-  private toDriverError(e: unknown): Error {
-    if (e instanceof DbToolError) return e;
-    return new DbToolError('DRIVER_ERROR', this.errText(e));
-  }
+  private toDriverError(e: unknown): Error {}
 }
 
killedBy: DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
statusReason: expected undefined to match object { code: 'DRIVER_ERROR' }

[Killed] ConditionalExpression
lib/manager.ts:486:9
   }
 
   private toDriverError(e: unknown): Error {
-    if (e instanceof DbToolError) return e;
+    if (true) return e;
     return new DbToolError('DRIVER_ERROR', this.errText(e));
   }
killedBy: DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
statusReason: expected Error: Unexpected token '}' to match object { code: 'DRIVER_ERROR' }

[Survived] ConditionalExpression
lib/manager.ts:486:9
   }
 
   private toDriverError(e: unknown): Error {
-    if (e instanceof DbToolError) return e;
+    if (false) return e;
     return new DbToolError('DRIVER_ERROR', this.errText(e));
   }

[Killed] BlockStatement
lib/manager.ts:513:92
   challengeId?: string;
 }
 
-function pick(args: ToolActionArgs, snake: 'conn_id' | 'challenge_id'): string | undefined {
-  return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
-}
+function pick(args: ToolActionArgs, snake: 'conn_id' | 'challenge_id'): string | undefined {}
 
 /**
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Killed] LogicalOperator
lib/manager.ts:514:10
 }
 
 function pick(args: ToolActionArgs, snake: 'conn_id' | 'challenge_id'): string | undefined {
-  return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+  return args[snake] && (snake === 'conn_id' ? args.connId : args.challengeId);
 }
 
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Survived] ConditionalExpression
lib/manager.ts:514:26
 }
 
 function pick(args: ToolActionArgs, snake: 'conn_id' | 'challenge_id'): string | undefined {
-  return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+  return args[snake] ?? (false ? args.connId : args.challengeId);
 }
 

[Killed] StringLiteral
lib/manager.ts:527:29
   projectPath: string,
 ): Promise<string> {
   const action = args.action;
-  const connId = pick(args, 'conn_id');
+  const connId = pick(args, "");
   const challengeId = pick(args, 'challenge_id');
   const j = (v: unknown) => JSON.stringify(v, null, 2);
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Killed] ArrowFunction
lib/manager.ts:529:13
   const action = args.action;
   const connId = pick(args, 'conn_id');
   const challengeId = pick(args, 'challenge_id');
-  const j = (v: unknown) => JSON.stringify(v, null, 2);
+  const j = () => undefined;
 
   try {
killedBy: handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/manager.ts:533:7
 
   try {
     switch (action) {
-      case 'list_connections':
-        return j(service.listConnections());
+      case 'list_connections':
 
       case 'query': {
killedBy: handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain 'c1'

[Killed] ConditionalExpression
lib/manager.ts:536:7
       case 'list_connections':
         return j(service.listConnections());
 
-      case 'query': {
-        const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
-        return needConfirmText(r) ?? j(r);
-      }
+      case 'query':
 
       case 'execute': {
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "affectedRows": 1,\n  "message":…' to contain '"rowCount": 1'

[Killed] BlockStatement
lib/manager.ts:536:21
       case 'list_connections':
         return j(service.listConnections());
 
-      case 'query': {
-        const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
-        return needConfirmText(r) ?? j(r);
-      }
+      case 'query': {}
 
       case 'execute': {
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "affectedRows": 1,\n  "message":…' to contain '"rowCount": 1'

[Killed] LogicalOperator
lib/manager.ts:538:16
 
       case 'query': {
         const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
-        return needConfirmText(r) ?? j(r);
+        return needConfirmText(r) && j(r);
       }
 
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/manager.ts:541:23
         return needConfirmText(r) ?? j(r);
       }
 
-      case 'execute': {
-        const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
-        return needConfirmText(r) ?? j(r);
-      }
+      case 'execute': {}
 
       case 'schema': {
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '[\n  "app",\n  "test"\n]' to contain 'NEEDS_CONFIRMATION'

[Killed] ConditionalExpression
lib/manager.ts:541:7
         return needConfirmText(r) ?? j(r);
       }
 
-      case 'execute': {
-        const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
-        return needConfirmText(r) ?? j(r);
-      }
+      case 'execute':
 
       case 'schema': {
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '[\n  "app",\n  "test"\n]' to contain 'NEEDS_CONFIRMATION'

[Killed] LogicalOperator
lib/manager.ts:542:85
       }
 
       case 'execute': {
-        const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
+        const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement && args.sql, 'statement'), args.params, challengeId);
         return needConfirmText(r) ?? j(r);
       }
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain 'NEEDS_CONFIRMATION'

[Killed] LogicalOperator
lib/manager.ts:543:16
 
       case 'execute': {
         const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
-        return needConfirmText(r) ?? j(r);
+        return needConfirmText(r) && j(r);
       }
 
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "needConfirmation": true,\n  "ch…' to contain 'NEEDS_CONFIRMATION'

[NoCoverage] BlockStatement
lib/manager.ts:546:22
         return needConfirmText(r) ?? j(r);
       }
 
-      case 'schema': {
-        const conn = requireConn(connId);
-        if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-        if (args.database) return j(await service.tables(projectPath, conn, args.database));
-        return j(await service.databases(projectPath, conn));
-      }
+      case 'schema': {}
 
       case 'preview': {

[NoCoverage] ConditionalExpression
lib/manager.ts:546:7
         return needConfirmText(r) ?? j(r);
       }
 
-      case 'schema': {
-        const conn = requireConn(connId);
-        if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-        if (args.database) return j(await service.tables(projectPath, conn, args.database));
-        return j(await service.databases(projectPath, conn));
-      }
+      case 'schema':
 
       case 'preview': {

[NoCoverage] ConditionalExpression
lib/manager.ts:548:13
 
       case 'schema': {
         const conn = requireConn(connId);
-        if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+        if (true) return j(await service.schema(projectPath, conn, args.table, args.database));
         if (args.database) return j(await service.tables(projectPath, conn, args.database));
         return j(await service.databases(projectPath, conn));

[NoCoverage] ConditionalExpression
lib/manager.ts:548:13
 
       case 'schema': {
         const conn = requireConn(connId);
-        if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+        if (false) return j(await service.schema(projectPath, conn, args.table, args.database));
         if (args.database) return j(await service.tables(projectPath, conn, args.database));
         return j(await service.databases(projectPath, conn));

[NoCoverage] ConditionalExpression
lib/manager.ts:549:13
       case 'schema': {
         const conn = requireConn(connId);
         if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-        if (args.database) return j(await service.tables(projectPath, conn, args.database));
+        if (true) return j(await service.tables(projectPath, conn, args.database));
         return j(await service.databases(projectPath, conn));
       }

[NoCoverage] ConditionalExpression
lib/manager.ts:549:13
       case 'schema': {
         const conn = requireConn(connId);
         if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-        if (args.database) return j(await service.tables(projectPath, conn, args.database));
+        if (false) return j(await service.tables(projectPath, conn, args.database));
         return j(await service.databases(projectPath, conn));
       }

[NoCoverage] ConditionalExpression
lib/manager.ts:553:7
         return j(await service.databases(projectPath, conn));
       }
 
-      case 'preview': {
-        const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database, args.offset);
-        return j(r);
-      }
+      case 'preview':
 
       case 'run_script': {

[NoCoverage] BlockStatement
lib/manager.ts:553:23
         return j(await service.databases(projectPath, conn));
       }
 
-      case 'preview': {
-        const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database, args.offset);
-        return j(r);
-      }
+      case 'preview': {}
 
       case 'run_script': {

[NoCoverage] StringLiteral
lib/manager.ts:554:97
       }
 
       case 'preview': {
-        const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database, args.offset);
+        const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, ""), args.limit, args.database, args.offset);
         return j(r);
       }

[Killed] ConditionalExpression
lib/manager.ts:558:7
         return j(r);
       }
 
-      case 'run_script': {
-        const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
-        return needConfirmText(r) ?? j(r);
-      }
+      case 'run_script':
 
       default:
killedBy: handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
statusReason: expected '{\n  "ok": false,\n  "error": "未知 act…' to contain 'READ_ONLY'

[Killed] BlockStatement
lib/manager.ts:558:26
         return j(r);
       }
 
-      case 'run_script': {
-        const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
-        return needConfirmText(r) ?? j(r);
-      }
+      case 'run_script': {}
 
       default:
killedBy: handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
statusReason: expected '{\n  "ok": false,\n  "error": "未知 act…' to contain 'READ_ONLY'

[Killed] LogicalOperator
lib/manager.ts:560:16
 
       case 'run_script': {
         const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
-        return needConfirmText(r) ?? j(r);
+        return needConfirmText(r) && j(r);
       }
 
killedBy: handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/manager.ts:563:7
         return needConfirmText(r) ?? j(r);
       }
 
-      default:
-        throw new DbToolError('INVALID_ARGUMENT', `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
+      default:
     }
   } catch (e) {
killedBy: handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
lib/manager.ts:566:15
       default:
         throw new DbToolError('INVALID_ARGUMENT', `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
     }
-  } catch (e) {
-    const code = e instanceof DbToolError ? e.code : 'DRIVER_ERROR';
-    return j({ ok: false, error: e instanceof Error ? e.message : String(e), code });
-  }
+  } catch (e) {}
 }
 
killedBy: handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] BooleanLiteral
lib/manager.ts:568:20
     }
   } catch (e) {
     const code = e instanceof DbToolError ? e.code : 'DRIVER_ERROR';
-    return j({ ok: false, error: e instanceof Error ? e.message : String(e), code });
+    return j({ ok: true, error: e instanceof Error ? e.message : String(e), code });
   }
 }

[Killed] BlockStatement
lib/manager.ts:572:58
   }
 }
 
-function requireConn(connId: string | undefined): string {
-  if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
-  return connId;
-}
+function requireConn(connId: string | undefined): string {}
 
 function assertArg(v: string | undefined, label: string): string {
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "项目未授权该…' to contain '"rowCount": 1'

[Killed] LogicalOperator
lib/manager.ts:573:7
 }
 
 function requireConn(connId: string | undefined): string {
-  if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+  if (!connId && connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
   return connId;
 }
killedBy: handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
statusReason: expected '{\n  "ok": false,\n  "error": "Cannot…' to contain 'INVALID_ARGUMENT'

[Killed] ConditionalExpression
lib/manager.ts:573:7
 }
 
 function requireConn(connId: string | undefined): string {
-  if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+  if (true) throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
   return connId;
 }
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Killed] BlockStatement
lib/manager.ts:577:66
   return connId;
 }
 
-function assertArg(v: string | undefined, label: string): string {
-  if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
-  return v;
-}
+function assertArg(v: string | undefined, label: string): string {}
 
 function needConfirmText(r: unknown): string | null {
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Killed] BooleanLiteral
lib/manager.ts:578:7
 }
 
 function assertArg(v: string | undefined, label: string): string {
-  if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+  if (v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
   return v;
 }
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Killed] EqualityOperator
lib/manager.ts:578:13
 }
 
 function assertArg(v: string | undefined, label: string): string {
-  if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+  if (!v || v.trim() !== '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
   return v;
 }
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "error": "缺少必填参数…' to contain '"rowCount": 1'

[Killed] BlockStatement
lib/manager.ts:582:53
   return v;
 }
 
-function needConfirmText(r: unknown): string | null {
-  if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
-  const nc = r as NeedConfirm;
-  return JSON.stringify({
-    ok: false,
-    code: 'NEEDS_CONFIRMATION',
-    ...nc,
-    hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
-  }, null, 2);
-}
+function needConfirmText(r: unknown): string | null {}
 
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "needConfirmation": true,\n  "ch…' to contain 'NEEDS_CONFIRMATION'

[Killed] EqualityOperator
lib/manager.ts:583:39
 }
 
 function needConfirmText(r: unknown): string | null {
-  if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+  if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation !== true)) return null;
   const nc = r as NeedConfirm;
   return JSON.stringify({
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "needConfirmation": true,\n  "ch…' to contain 'NEEDS_CONFIRMATION'

[Killed] BooleanLiteral
lib/manager.ts:583:7
 }
 
 function needConfirmText(r: unknown): string | null {
-  if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+  if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) return null;
   const nc = r as NeedConfirm;
   return JSON.stringify({
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "needConfirmation": true,\n  "ch…' to contain 'NEEDS_CONFIRMATION'

[Killed] ObjectLiteral
lib/manager.ts:585:25
 function needConfirmText(r: unknown): string | null {
   if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
   const nc = r as NeedConfirm;
-  return JSON.stringify({
-    ok: false,
-    code: 'NEEDS_CONFIRMATION',
-    ...nc,
-    hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
-  }, null, 2);
+  return JSON.stringify({}, null, 2);
 }
 
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{}' to contain 'NEEDS_CONFIRMATION'

[Survived] BooleanLiteral
lib/manager.ts:586:9
   if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
   const nc = r as NeedConfirm;
   return JSON.stringify({
-    ok: false,
+    ok: true,
     code: 'NEEDS_CONFIRMATION',
     ...nc,
