[Survived] LogicalOperator
lib/store/index.ts:41:18
-       const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
+       const home = (homeDir ?? process.env['DSH_HOME']) && path.join(os.homedir(), '.dsh');
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] LogicalOperator
lib/store/index.ts:41:18
-       const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
+       const home = homeDir && process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] StringLiteral
lib/store/index.ts:42:32
-       this.dir = path.join(home, 'db-tool');
+       this.dir = path.join(home, "");
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] ObjectLiteral
lib/store/index.ts:43:28
-       fs.mkdirSync(this.dir, { recursive: true });
+       fs.mkdirSync(this.dir, {});
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] BooleanLiteral
lib/store/index.ts:43:41
-       fs.mkdirSync(this.dir, { recursive: true });
+       fs.mkdirSync(this.dir, { recursive: false });
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] BlockStatement
lib/store/io.ts:24:88
-   export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {
-     const dir = path.dirname(file);
-     fs.mkdirSync(dir, { recursive: true });
-     const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
-     fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
-     try {
-       fs.renameSync(tmp, file);
-     } catch (err) {
-       try {
-         fs.rmSync(tmp, { force: true });
-       } catch {
-         // 清理失败不掩盖原始错误
-       }
-       throw err;
-     }
-     if (fileMode !== undefined) chmodBestEffort(file, fileMode);
-   }
+   export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 40 more tests!

[Survived] ObjectLiteral
lib/store/io.ts:26:21
-     fs.mkdirSync(dir, { recursive: true });
+     fs.mkdirSync(dir, {});
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 40 more tests!

[Survived] BooleanLiteral
lib/store/io.ts:26:34
-     fs.mkdirSync(dir, { recursive: true });
+     fs.mkdirSync(dir, { recursive: false });
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 40 more tests!

[Survived] StringLiteral
lib/store/io.ts:27:30
-     const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
+     const tmp = path.join(dir, ``);
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 40 more tests!

[Survived] BlockStatement
lib/store/io.ts:29:7
-     try {
-       fs.renameSync(tmp, file);
-     } catch (err) {
+     try {} catch (err) {
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 40 more tests!

[Survived] CallExpression
lib/store/io.ts:30:5
-       fs.renameSync(tmp, file);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 40 more tests!

[Survived] BlockStatement
lib/store/io.ts:48:59
-   export function readJson<T>(file: string, fallback: T): T {
-     if (!fs.existsSync(file)) return fallback;
-     try {
-       return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
-     } catch {
-       try {
-         fs.rmSync(`${file}.bak`, { force: true });
-         fs.renameSync(file, `${file}.bak`);
-       } catch {
-         // 备份失败也要继续重建
-       }
-       return fallback;
-     }
-   }
+   export function readJson<T>(file: string, fallback: T): T {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 52 more tests!

[Survived] BooleanLiteral
lib/store/io.ts:49:7
-     if (!fs.existsSync(file)) return fallback;
+     if (fs.existsSync(file)) return fallback;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 52 more tests!

[Survived] BlockStatement
lib/store/io.ts:52:11
-     } catch {
-       try {
-         fs.rmSync(`${file}.bak`, { force: true });
-         fs.renameSync(file, `${file}.bak`);
-       } catch {
-         // 备份失败也要继续重建
-       }
-       return fallback;
-     }
+     } catch {}
Tests ran:
    io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
    io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）

[Survived] BlockStatement
lib/store/io.ts:53:9
-       try {
-         fs.rmSync(`${file}.bak`, { force: true });
-         fs.renameSync(file, `${file}.bak`);
-       } catch {
+       try {} catch {
Tests ran:
    io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
    io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）

[Survived] ObjectLiteral
lib/store/io.ts:54:32
-         fs.rmSync(`${file}.bak`, { force: true });
+         fs.rmSync(`${file}.bak`, {});
Tests ran:
    io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
    io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）

[Survived] BooleanLiteral
lib/store/io.ts:54:41
-         fs.rmSync(`${file}.bak`, { force: true });
+         fs.rmSync(`${file}.bak`, { force: false });
Tests ran:
    io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
    io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）

[Survived] ConditionalExpression
lib/store/io.ts:49:7
-     if (!fs.existsSync(file)) return fallback;
+     if (true) return fallback;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
  and 52 more tests!

[Survived] StringLiteral
lib/store/io.ts:55:27
-         fs.renameSync(file, `${file}.bak`);
+         fs.renameSync(file, ``);
Tests ran:
    io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
    io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）

[Survived] BlockStatement
lib/store/io.ts:50:7
-     try {
-       return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
-     } catch {
+     try {} catch {
Tests ran:
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
  and 46 more tests!

[Survived] BlockStatement
lib/store/secrets.ts:28:28
-     constructor(dir: string) {
-       this.file = path.join(dir, 'secrets.json');
-     }
+     constructor(dir: string) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] BlockStatement
lib/store/secrets.ts:32:31
-     private load(): SecretsFile {
-       return readJson<SecretsFile>(this.file, { secrets: {} });
-     }
+     private load(): SecretsFile {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
  and 32 more tests!

[Survived] StringLiteral
lib/store/secrets.ts:29:32
-       this.file = path.join(dir, 'secrets.json');
+       this.file = path.join(dir, "");
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 44 more tests!

[Survived] ObjectLiteral
lib/store/secrets.ts:33:45
-       return readJson<SecretsFile>(this.file, { secrets: {} });
+       return readJson<SecretsFile>(this.file, {});
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
  and 32 more tests!

[Survived] BlockStatement
lib/store/secrets.ts:36:41
-     private save(data: SecretsFile): void {
-       writeJsonAtomic(this.file, data, FILE_MODE);
-     }
+     private save(data: SecretsFile): void {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 31 more tests!

[Survived] CallExpression
lib/store/secrets.ts:37:5
-       writeJsonAtomic(this.file, data, FILE_MODE);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 31 more tests!

[Survived] BlockStatement
lib/store/secrets.ts:41:48
-     get(connId: string): SecretEntry | undefined {
-       const entry = this.load().secrets[connId];
-       return entry ? { ...entry } : undefined;
-     }
+     get(connId: string): SecretEntry | undefined {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 18 more tests!

[Survived] ObjectLiteral
lib/store/secrets.ts:43:20
-       return entry ? { ...entry } : undefined;
+       return entry ? {} : undefined;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 17 more tests!

[Survived] ObjectLiteral
lib/store/secrets.ts:49:28
-       data.secrets[connId] = { ...(data.secrets[connId] ?? {}), ...patch };
+       data.secrets[connId] = {};
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 31 more tests!

[Survived] BlockStatement
lib/store/secrets.ts:47:49
-     set(connId: string, patch: SecretEntry): void {
-       const data = this.load();
-       data.secrets[connId] = { ...(data.secrets[connId] ?? {}), ...patch };
-       this.save(data);
-     }
+     set(connId: string, patch: SecretEntry): void {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 31 more tests!

[Survived] LogicalOperator
lib/store/secrets.ts:49:34
-       data.secrets[connId] = { ...(data.secrets[connId] ?? {}), ...patch };
+       data.secrets[connId] = { ...(data.secrets[connId] && {}), ...patch };
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 31 more tests!

[Survived] CallExpression
lib/store/secrets.ts:50:5
-       this.save(data);
+       ;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
  and 31 more tests!

[Survived] BlockStatement
lib/store/secrets.ts:54:32
-     delete(connId: string): void {
-       const data = this.load();
-       if (!(connId in data.secrets)) return;
-       delete data.secrets[connId];
-       this.save(data);
-     }
+     delete(connId: string): void {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
  and 1 more test!

[Survived] BooleanLiteral
lib/store/secrets.ts:56:9
-       if (!(connId in data.secrets)) return;
+       if (connId in data.secrets) return;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
  and 1 more test!

[Survived] ConditionalExpression
lib/store/secrets.ts:56:9
-       if (!(connId in data.secrets)) return;
+       if (true) return;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
  and 1 more test!

[Survived] ConditionalExpression
lib/store/secrets.ts:56:9
-       if (!(connId in data.secrets)) return;
+       if (false) return;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
  and 1 more test!

[Survived] CallExpression
lib/store/secrets.ts:58:5
-       this.save(data);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
  and 1 more test!

[NoCoverage] StringLiteral
lib/manager.ts:71:48
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = typeof v === 'string' ? v.trim() : "Stryker was here!";

[NoCoverage] StringLiteral
lib/manager.ts:72:39
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s === '') throw new DbToolError("", `缺少必填参数: ${label}`);

[NoCoverage] StringLiteral
lib/manager.ts:72:59
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s === '') throw new DbToolError('INVALID_ARGUMENT', ``);

[NoCoverage] StringLiteral
lib/manager.ts:103:38
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!meta) throw new DbToolError("", `连接不存在: ${id}`);

[NoCoverage] StringLiteral
lib/manager.ts:103:51
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!meta) throw new DbToolError('NOT_FOUND', ``);

[NoCoverage] BlockStatement
lib/manager.ts:116:64
-     async testConnection(id: string): Promise<TestConnectResult> {
-       const rc = this.requireConn(id);
-       try {
-         const factory = await this.resolver(rc.meta.kind);
-         const adapter = await factory(rc);
-         try {
-           return await adapter.testConnect();
-         } finally {
-           await adapter.close().catch(() => {});
-         }
-       } catch (e) {
-         throw this.toDriverError(e);
-       }
-     }
+     async testConnection(id: string): Promise<TestConnectResult> {}

[NoCoverage] BlockStatement
lib/manager.ts:118:9
-       try {
-         const factory = await this.resolver(rc.meta.kind);
-         const adapter = await factory(rc);
-         try {
-           return await adapter.testConnect();
-         } finally {
-           await adapter.close().catch(() => {});
-         }
-       } catch (e) {
+       try {} catch (e) {

[NoCoverage] BlockStatement
lib/manager.ts:121:11
-         try {
-           return await adapter.testConnect();
-         } finally {
+         try {} finally {

[NoCoverage] BlockStatement
lib/manager.ts:123:17
-         } finally {
-           await adapter.close().catch(() => {});
-         }
+         } finally {}

[NoCoverage] BlockStatement
lib/manager.ts:126:17
-       } catch (e) {
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] BlockStatement
lib/manager.ts:157:17
-       } catch (e) {
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:158:31
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", 'listDatabases', 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:158:44
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', "", 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:158:61
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', 'listDatabases', "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:158:69
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:158:76
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:169:17
-       } catch (e) {
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:170:31
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", database ?? 'default', 'none', false, false, this.errText(e));

[NoCoverage] LogicalOperator
lib/manager.ts:170:41
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database && 'default', 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:170:53
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? "", 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:170:64
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? 'default', "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:170:72
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:170:79
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:182:17
-       } catch (e) {
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:183:31
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", t, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:183:44
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'schema', t, "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:183:52
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'schema', t, 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:183:59
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'schema', t, 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:202:17
-       } catch (e) {
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:203:31
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:203:42
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', ``, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:203:74
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:203:82
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:203:89
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:273:24
-       if (mode !== 'rw') {
-         db.execute = async () => {
-           throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），脚本不可执行写操作');
-         };
-       }
+       if (mode !== 'rw') {}

[NoCoverage] BlockStatement
lib/manager.ts:274:32
-         db.execute = async () => {
-           throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），脚本不可执行写操作');
-         };
+         db.execute = async () => {};

[NoCoverage] StringLiteral
lib/manager.ts:275:31
-           throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），脚本不可执行写操作');
+           throw new DbToolError("", '该连接对本项目为只读授权（ro），脚本不可执行写操作');

[NoCoverage] StringLiteral
lib/manager.ts:275:44
-           throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），脚本不可执行写操作');
+           throw new DbToolError('READ_ONLY', "");

[NoCoverage] MethodExpression
lib/manager.ts:279:58
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length > 200 ? src + '…' : src, 'none', false, true);

[NoCoverage] StringLiteral
lib/manager.ts:279:78
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + "" : src, 'none', false, true);

[NoCoverage] StringLiteral
lib/manager.ts:282:56
-         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },
+         console: { log: (...a: unknown[]) => console.log("", ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },

[NoCoverage] StringLiteral
lib/manager.ts:282:120
-         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },
+         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error("", ...a) },

[NoCoverage] StringLiteral
lib/manager.ts:292:58
-             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', '脚本执行超时（60s）')), 60_000);
+             const t = setTimeout(() => rej(new DbToolError("", '脚本执行超时（60s）')), 60_000);

[NoCoverage] StringLiteral
lib/manager.ts:292:76
-             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', '脚本执行超时（60s）')), 60_000);
+             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', "")), 60_000);

[NoCoverage] BlockStatement
lib/manager.ts:345:13
-       } catch {
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
-       }
+       } catch {}

[NoCoverage] StringLiteral
lib/manager.ts:346:29
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
+         throw new DbToolError("", `连接不存在: ${connId}`);

[NoCoverage] StringLiteral
lib/manager.ts:346:42
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
+         throw new DbToolError('NOT_FOUND', ``);

[NoCoverage] StringLiteral
lib/manager.ts:356:46
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (this.disposed) throw new DbToolError("", '服务已关闭');

[NoCoverage] StringLiteral
lib/manager.ts:356:66
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', "");

[NoCoverage] BlockStatement
lib/manager.ts:377:25
-         })().catch((e) => {
-           this.adapterCache.delete(connId);
-           throw e instanceof DbToolError ? e : this.toDriverError(e);
-         });
+         })().catch((e) => {});

[NoCoverage] CallExpression
lib/manager.ts:378:9
-           this.adapterCache.delete(connId);
+           ;

[NoCoverage] StringLiteral
lib/manager.ts:405:115
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? "" };

[NoCoverage] BlockStatement
lib/manager.ts:417:17
-       } catch (e) {
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] CallExpression
lib/manager.ts:418:7
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         ;

[NoCoverage] ConditionalExpression
lib/manager.ts:418:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, true, false, this.errText(e));

[NoCoverage] ConditionalExpression
lib/manager.ts:418:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, false, false, this.errText(e));

[NoCoverage] EqualityOperator
lib/manager.ts:418:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level !== 'danger', false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:418:94
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === "", false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:418:104
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, this.errText(e));

[NoCoverage] ConditionalExpression
lib/manager.ts:518:7
-         case 'schema': {
-           const conn = requireConn(connId);
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
-           return j(await service.databases(projectPath, conn));
-         }
+         case 'schema':

[NoCoverage] BlockStatement
lib/manager.ts:518:22
-         case 'schema': {
-           const conn = requireConn(connId);
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
-           return j(await service.databases(projectPath, conn));
-         }
+         case 'schema': {}
