[Killed] StringLiteral
lib/manager.ts:587:11
   const nc = r as NeedConfirm;
   return JSON.stringify({
     ok: false,
-    code: 'NEEDS_CONFIRMATION',
+    code: "",
     ...nc,
     hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "code": "",\n  "…' to contain 'NEEDS_CONFIRMATION'

[Killed] StringLiteral
lib/manager.ts:589:11
     ok: false,
     code: 'NEEDS_CONFIRMATION',
     ...nc,
-    hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
+    hint: ``,
   }, null, 2);
 }
killedBy: handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
statusReason: expected '{\n  "ok": false,\n  "code": "NEEDS_C…' to contain 'challenge_id='
