[NoCoverage] ConditionalExpression
lib/manager.ts:520:13
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+           if (true) return j(await service.schema(projectPath, conn, args.table, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:520:13
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+           if (false) return j(await service.schema(projectPath, conn, args.table, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:521:13
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
+           if (true) return j(await service.tables(projectPath, conn, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:521:13
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
+           if (false) return j(await service.tables(projectPath, conn, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:525:7
-         case 'preview': {
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database);
-           return j(r);
-         }
+         case 'preview':

[NoCoverage] BlockStatement
lib/manager.ts:525:23
-         case 'preview': {
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database);
-           return j(r);
-         }
+         case 'preview': {}

[NoCoverage] StringLiteral
lib/manager.ts:526:97
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database);
+           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, ""), args.limit, args.database);

[NoCoverage] StringLiteral
lib/manager.ts:539:54
-       const code = e instanceof DbToolError ? e.code : 'DRIVER_ERROR';
+       const code = e instanceof DbToolError ? e.code : "";

[NoCoverage] StringLiteral
lib/manager.ts:550:52
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === '') throw new DbToolError("", `缺少必填参数: ${label}`);

[NoCoverage] StringLiteral
lib/manager.ts:550:72
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', ``);

[Survived] StringLiteral
lib/manager.ts:51:17
-       this.name = 'DbToolError';
+       this.name = "";
Tests ran:
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 17 more tests!

[Survived] BlockStatement
lib/manager.ts:70:71
-   function assertNonEmpty(v: string | undefined, label: string): string {
-     const s = typeof v === 'string' ? v.trim() : '';
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
-     return s;
-   }
+   function assertNonEmpty(v: string | undefined, label: string): string {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:71:13
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = true ? v.trim() : '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:71:13
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = false ? v.trim() : '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] EqualityOperator
lib/manager.ts:71:13
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = typeof v !== 'string' ? v.trim() : '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] StringLiteral
lib/manager.ts:71:26
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = typeof v === "" ? v.trim() : '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] MethodExpression
lib/manager.ts:71:37
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = typeof v === 'string' ? v : '';
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:72:7
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (true) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:72:7
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (false) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] EqualityOperator
lib/manager.ts:72:7
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s !== '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] StringLiteral
lib/manager.ts:72:13
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s === "Stryker was here!") throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] BooleanLiteral
lib/manager.ts:82:22
-     private disposed = false;
+     private disposed = true;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] BlockStatement
lib/manager.ts:84:73
-     constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {
-       this.resolver = opts?.adapterResolver ?? getAdapter;
-       this.challenges = opts?.challenges ?? new ChallengeStore();
-     }
+     constructor(readonly store: DbToolStore, opts?: DbToolServiceOptions) {}
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] LogicalOperator
lib/manager.ts:85:21
-       this.resolver = opts?.adapterResolver ?? getAdapter;
+       this.resolver = opts?.adapterResolver && getAdapter;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] OptionalChaining
lib/manager.ts:85:21
-       this.resolver = opts?.adapterResolver ?? getAdapter;
+       this.resolver = opts.adapterResolver ?? getAdapter;
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] LogicalOperator
lib/manager.ts:86:23
-       this.challenges = opts?.challenges ?? new ChallengeStore();
+       this.challenges = opts?.challenges && new ChallengeStore();
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] BlockStatement
lib/manager.ts:95:96
-     createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {
-       const meta = this.store.connections.create(input);
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
-       return meta;
-     }
+     createConnection(input: Parameters<DbToolStore['connections']['create']>[0]): ConnectionMeta {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] OptionalChaining
lib/manager.ts:86:23
-       this.challenges = opts?.challenges ?? new ChallengeStore();
+       this.challenges = opts.challenges ?? new ChallengeStore();
Tests ran:
    fenced 校验 跨站 Origin → 403 FORBIDDEN
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 21 more tests!

[Survived] StringLiteral
lib/manager.ts:97:16
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit("Stryker was here!", input.id, 'create_connection', input.id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BlockStatement
lib/manager.ts:91:39
-     listConnections(): ConnectionMeta[] {
-       return this.store.connections.list();
-     }
+     listConnections(): ConnectionMeta[] {}
Tests ran:
    fenced 校验 loopback Origin 同端口放行
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
  and 6 more tests!

[Survived] StringLiteral
lib/manager.ts:97:30
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, "", input.id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:97:61
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, 'create_connection', input.id, "", false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:97:69
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, 'create_connection', input.id, 'none', true, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:97:76
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, 'create_connection', input.id, 'none', false, false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BlockStatement
lib/manager.ts:101:108
-     updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {
-       const meta = this.store.connections.update(id, patch);
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
-       this.audit('', id, 'update_connection', id, 'none', false, true);
-       return meta;
-     }
+     updateConnection(id: string, patch: Parameters<DbToolStore['connections']['update']>[1]): ConnectionMeta {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:103:9
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] ConditionalExpression
lib/manager.ts:103:9
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (true) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] ConditionalExpression
lib/manager.ts:103:9
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (false) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:104:16
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit("Stryker was here!", id, 'update_connection', id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:104:24
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, "", id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:104:49
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, 'update_connection', id, "", false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:104:57
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, 'update_connection', id, 'none', true, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:104:64
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, 'update_connection', id, 'none', false, false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BlockStatement
lib/manager.ts:108:41
-     removeConnection(id: string): boolean {
-       const ok = this.store.connections.remove(id);
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
-       this.adapterCache.delete(id);
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
-       return ok;
-     }
+     removeConnection(id: string): boolean {}
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] BooleanLiteral
lib/manager.ts:110:9
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] ConditionalExpression
lib/manager.ts:110:9
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (true) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] ConditionalExpression
lib/manager.ts:110:9
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (false) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] StringLiteral
lib/manager.ts:110:36
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!ok) throw new DbToolError("", `连接不存在: ${id}`);
Tests ran:
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] StringLiteral
lib/manager.ts:110:49
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!ok) throw new DbToolError('NOT_FOUND', ``);
Tests ran:
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] CallExpression
lib/manager.ts:111:5
-       this.adapterCache.delete(id);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] StringLiteral
lib/manager.ts:112:16
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit("Stryker was here!", id, 'remove_connection', id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] StringLiteral
lib/manager.ts:112:24
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, "", id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] StringLiteral
lib/manager.ts:112:49
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, 'remove_connection', id, "", false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] BlockStatement
lib/manager.ts:133:75
-     grantsFor(projectPath: string): { connId: string; mode: 'ro' | 'rw' }[] {
-       return this.store.grants.grantsFor(normalizeProjectKey(projectPath));
-     }
+     grantsFor(projectPath: string): { connId: string; mode: 'ro' | 'rw' }[] {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] BlockStatement
lib/manager.ts:137:71
-     grant(projectPath: string, connId: string, mode: 'ro' | 'rw'): void {
-       const key = normalizeProjectKey(projectPath);
-       this.store.grants.grant(key, connId, mode);
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
-     }
+     grant(projectPath: string, connId: string, mode: 'ro' | 'rw'): void {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:112:57
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, 'remove_connection', id, 'none', true, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] BooleanLiteral
lib/manager.ts:112:64
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, 'remove_connection', id, 'none', false, false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] CallExpression
lib/manager.ts:139:5
-       this.store.grants.grant(key, connId, mode);
+       ;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:140:29
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, "", `${connId} -> ${mode}`, 'none', false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:140:38
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', ``, 'none', false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:140:70
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', true, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:140:62
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, "", false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:140:77
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, false);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BlockStatement
lib/manager.ts:143:58
-     revokeGrant(projectPath: string, connId: string): void {
-       const key = normalizeProjectKey(projectPath);
-       this.store.grants.revoke(key, connId);
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
-     }
+     revokeGrant(projectPath: string, connId: string): void {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] CallExpression
lib/manager.ts:145:5
-       this.store.grants.revoke(key, connId);
+       ;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:146:29
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, "", connId, 'none', false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:146:47
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, 'revoke', connId, "", false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:146:55
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, 'revoke', connId, 'none', true, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:146:62
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, 'revoke', connId, 'none', false, false);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BlockStatement
lib/manager.ts:151:87
-     async databases(projectPath: string | undefined, connId: string): Promise<string[]> {
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
-       try {
-         const result = await adapter.listDatabases();
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
-         return result;
-       } catch (e) {
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
-     }
+     async databases(projectPath: string | undefined, connId: string): Promise<string[]> {}
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:152:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:153:9
-       try {
-         const result = await adapter.listDatabases();
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
-         return result;
-       } catch (e) {
+       try {} catch (e) {
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:155:31
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, "", 'listDatabases', 'none', false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:155:44
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', "", 'none', false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:155:61
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', 'listDatabases', "", false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:155:69
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', true, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:155:76
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:163:106
-     async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
-       try {
-         const result = await adapter.listTables(database);
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
-         return result;
-       } catch (e) {
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
-     }
+     async tables(projectPath: string | undefined, connId: string, database?: string): Promise<TableInfo[]> {}
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:164:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:165:9
-       try {
-         const result = await adapter.listTables(database);
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
-         return result;
-       } catch (e) {
+       try {} catch (e) {
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:167:31
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, "", database ?? 'default', 'none', false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] LogicalOperator
lib/manager.ts:167:41
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database && 'default', 'none', false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:167:53
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? "", 'none', false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
