[Killed] BlockStatement
lib/store/connections.ts:55:48
 /** 将 URL 中的密码段替换为 ***：scheme://user:pass@host → scheme://user:***@host。
  *  密码可能包含 / ? # @ 等字符：先取 scheme:// 到首个 /?#  的 authority 段，
  *  在 authority 内以最后一个 @ 分界取 userinfo，再以最后一个 : 分界取密码。 */
-export function redactUrl(url: string): string {
-  const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
-  if (!m) return url;
-  const authority = m[2] ?? '';
-  const at = authority.lastIndexOf('@');
-  if (at < 0) return url; // 无 userinfo
-  const userinfo = authority.slice(0, at);
-  const colon = userinfo.lastIndexOf(':');
-  if (colon < 0) return url; // 只有用户名，无密码段
-  const redacted =
-    m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
-  return redacted + url.slice(m[0].length);
-}
+export function redactUrl(url: string): string {}
 
 function splitPassword(fields: Record<string, unknown> | undefined): {
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
lib/store/connections.ts:57:7
  *  在 authority 内以最后一个 @ 分界取 userinfo，再以最后一个 : 分界取密码。 */
 export function redactUrl(url: string): string {
   const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
-  if (!m) return url;
+  if (false) return url;
   const authority = m[2] ?? '';
   const at = authority.lastIndexOf('@');
killedBy: ConnectionStore redactUrl 边界：密码含 @ 或 ?、主机端口、非 URL 文本
statusReason: Cannot read properties of null (reading '2')

[Killed] ConditionalExpression
lib/store/connections.ts:57:7
  *  在 authority 内以最后一个 @ 分界取 userinfo，再以最后一个 : 分界取密码。 */
 export function redactUrl(url: string): string {
   const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
-  if (!m) return url;
+  if (true) return url;
   const authority = m[2] ?? '';
   const at = authority.lastIndexOf('@');
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] LogicalOperator
lib/store/connections.ts:58:21
 export function redactUrl(url: string): string {
   const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
   if (!m) return url;
-  const authority = m[2] ?? '';
+  const authority = m[2] && '';
   const at = authority.lastIndexOf('@');
   if (at < 0) return url; // 无 userinfo
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] StringLiteral
lib/store/connections.ts:59:36
   const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
   if (!m) return url;
   const authority = m[2] ?? '';
-  const at = authority.lastIndexOf('@');
+  const at = authority.lastIndexOf("");
   if (at < 0) return url; // 无 userinfo
   const userinfo = authority.slice(0, at);
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:60:7
   if (!m) return url;
   const authority = m[2] ?? '';
   const at = authority.lastIndexOf('@');
-  if (at < 0) return url; // 无 userinfo
+  if (at >= 0) return url; // 无 userinfo
   const userinfo = authority.slice(0, at);
   const colon = userinfo.lastIndexOf(':');
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:60:7
   if (!m) return url;
   const authority = m[2] ?? '';
   const at = authority.lastIndexOf('@');
-  if (at < 0) return url; // 无 userinfo
+  if (true) return url; // 无 userinfo
   const userinfo = authority.slice(0, at);
   const colon = userinfo.lastIndexOf(':');
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected '{\n  "connections": [\n    {\n      "…' not to contain 'p@127.0.0.1'

[Killed] MethodExpression
lib/store/connections.ts:61:20
   const authority = m[2] ?? '';
   const at = authority.lastIndexOf('@');
   if (at < 0) return url; // 无 userinfo
-  const userinfo = authority.slice(0, at);
+  const userinfo = authority;
   const colon = userinfo.lastIndexOf(':');
   if (colon < 0) return url; // 只有用户名，无密码段
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:63:7
   if (at < 0) return url; // 无 userinfo
   const userinfo = authority.slice(0, at);
   const colon = userinfo.lastIndexOf(':');
-  if (colon < 0) return url; // 只有用户名，无密码段
+  if (colon <= 0) return url; // 只有用户名，无密码段
   const redacted =
     m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
killedBy: ConnectionStore redactUrl 覆盖各类 URL 形态
statusReason: expected 'redis://:pw@h:6379' to be 'redis://:***@h:6379' // Object.is equality

[Killed] ConditionalExpression
lib/store/connections.ts:63:7
   if (at < 0) return url; // 无 userinfo
   const userinfo = authority.slice(0, at);
   const colon = userinfo.lastIndexOf(':');
-  if (colon < 0) return url; // 只有用户名，无密码段
+  if (true) return url; // 只有用户名，无密码段
   const redacted =
     m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ArithmeticOperator
lib/store/connections.ts:65:30
   const colon = userinfo.lastIndexOf(':');
   if (colon < 0) return url; // 只有用户名，无密码段
   const redacted =
-    m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
+    m[1] + userinfo.slice(0, colon - 1) + '***@' + authority.slice(at + 1);
   return redacted + url.slice(m[0].length);
 }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] MethodExpression
lib/store/connections.ts:65:12
   const colon = userinfo.lastIndexOf(':');
   if (colon < 0) return url; // 只有用户名，无密码段
   const redacted =
-    m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
+    m[1] + userinfo + '***@' + authority.slice(at + 1);
   return redacted + url.slice(m[0].length);
 }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] MethodExpression
lib/store/connections.ts:66:21
   if (colon < 0) return url; // 只有用户名，无密码段
   const redacted =
     m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
-  return redacted + url.slice(m[0].length);
+  return redacted + url;
 }
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ArithmeticOperator
lib/store/connections.ts:66:10
   if (colon < 0) return url; // 只有用户名，无密码段
   const redacted =
     m[1] + userinfo.slice(0, colon + 1) + '***@' + authority.slice(at + 1);
-  return redacted + url.slice(m[0].length);
+  return redacted - url.slice(m[0].length);
 }
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(5) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] BlockStatement
lib/store/connections.ts:72:3
 function splitPassword(fields: Record<string, unknown> | undefined): {
   clean: Record<string, unknown> | undefined;
   password: string | undefined;
-} {
-  if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
-    return { clean: fields, password: undefined };
-  }
-  const { [PASSWORD_KEY]: password, ...clean } = fields;
-  return { clean, password: password as string };
-}
+} {}
 
 /** ConnRecord → 用户可见的 ConnectionMeta（契约见 lib/adapters/types.ts） */
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: Cannot destructure property 'clean' of 'splitPassword(...)' as it is undefined.

[Killed] BlockStatement
lib/store/connections.ts:73:60
   clean: Record<string, unknown> | undefined;
   password: string | undefined;
 } {
-  if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
-    return { clean: fields, password: undefined };
-  }
+  if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {}
   const { [PASSWORD_KEY]: password, ...clean } = fields;
   return { clean, password: password as string };
killedBy: ConnectionStore create 重复 id 抛错
statusReason: Cannot destructure 'fields' as it is undefined.

[Killed] ConditionalExpression
lib/store/connections.ts:73:7
   clean: Record<string, unknown> | undefined;
   password: string | undefined;
 } {
-  if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+  if (false) {
     return { clean: fields, password: undefined };
   }
killedBy: ConnectionStore create 重复 id 抛错
statusReason: Cannot destructure 'fields' as it is undefined.

[Killed] ObjectLiteral
lib/store/connections.ts:77:10
     return { clean: fields, password: undefined };
   }
   const { [PASSWORD_KEY]: password, ...clean } = fields;
-  return { clean, password: password as string };
+  return {};
 }
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(2) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] BlockStatement
lib/store/connections.ts:81:50
 }
 
 /** ConnRecord → 用户可见的 ConnectionMeta（契约见 lib/adapters/types.ts） */
-function toMeta(rec: ConnRecord): ConnectionMeta {
-  const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
-  if (rec.name !== undefined) meta.name = rec.name;
-  if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
-  if (rec.fields) {
-    const { host, port, database } = rec.fields;
-    if (typeof host === 'string') meta.host = host;
-    if (typeof port === 'number') meta.port = port;
-    if (typeof database === 'string') meta.database = database;
-  }
-  return meta;
-}
+function toMeta(rec: ConnRecord): ConnectionMeta {}
 
 export class ConnectionStore {
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected undefined to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ObjectLiteral
lib/store/connections.ts:82:32
 
 /** ConnRecord → 用户可见的 ConnectionMeta（契约见 lib/adapters/types.ts） */
 function toMeta(rec: ConnRecord): ConnectionMeta {
-  const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
+  const meta: ConnectionMeta = {};
   if (rec.name !== undefined) meta.name = rec.name;
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { name: '主库', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:83:7
 /** ConnRecord → 用户可见的 ConnectionMeta（契约见 lib/adapters/types.ts） */
 function toMeta(rec: ConnRecord): ConnectionMeta {
   const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
-  if (rec.name !== undefined) meta.name = rec.name;
+  if (rec.name === undefined) meta.name = rec.name;
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
   if (rec.fields) {
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:83:7
 /** ConnRecord → 用户可见的 ConnectionMeta（契约见 lib/adapters/types.ts） */
 function toMeta(rec: ConnRecord): ConnectionMeta {
   const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
-  if (rec.name !== undefined) meta.name = rec.name;
+  if (false) meta.name = rec.name;
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
   if (rec.fields) {
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:84:7
 function toMeta(rec: ConnRecord): ConnectionMeta {
   const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
   if (rec.name !== undefined) meta.name = rec.name;
-  if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
+  if (false) meta.safeUrl = rec.urlSafe;
   if (rec.fields) {
     const { host, port, database } = rec.fields;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:84:7
 function toMeta(rec: ConnRecord): ConnectionMeta {
   const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
   if (rec.name !== undefined) meta.name = rec.name;
-  if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
+  if (rec.urlSafe === undefined) meta.safeUrl = rec.urlSafe;
   if (rec.fields) {
     const { host, port, database } = rec.fields;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] BlockStatement
lib/store/connections.ts:85:19
   const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
   if (rec.name !== undefined) meta.name = rec.name;
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
-  if (rec.fields) {
-    const { host, port, database } = rec.fields;
-    if (typeof host === 'string') meta.host = host;
-    if (typeof port === 'number') meta.port = port;
-    if (typeof database === 'string') meta.database = database;
-  }
+  if (rec.fields) {}
   return meta;
 }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(2) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:85:7
   const meta: ConnectionMeta = { id: rec.id, kind: rec.kind };
   if (rec.name !== undefined) meta.name = rec.name;
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
-  if (rec.fields) {
+  if (false) {
     const { host, port, database } = rec.fields;
     if (typeof host === 'string') meta.host = host;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(2) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:87:9
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
   if (rec.fields) {
     const { host, port, database } = rec.fields;
-    if (typeof host === 'string') meta.host = host;
+    if (typeof host !== 'string') meta.host = host;
     if (typeof port === 'number') meta.port = port;
     if (typeof database === 'string') meta.database = database;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:87:9
   if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
   if (rec.fields) {
     const { host, port, database } = rec.fields;
-    if (typeof host === 'string') meta.host = host;
+    if (false) meta.host = host;
     if (typeof port === 'number') meta.port = port;
     if (typeof database === 'string') meta.database = database;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:88:9
   if (rec.fields) {
     const { host, port, database } = rec.fields;
     if (typeof host === 'string') meta.host = host;
-    if (typeof port === 'number') meta.port = port;
+    if (false) meta.port = port;
     if (typeof database === 'string') meta.database = database;
   }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:88:9
   if (rec.fields) {
     const { host, port, database } = rec.fields;
     if (typeof host === 'string') meta.host = host;
-    if (typeof port === 'number') meta.port = port;
+    if (typeof port !== 'number') meta.port = port;
     if (typeof database === 'string') meta.database = database;
   }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:89:9
     const { host, port, database } = rec.fields;
     if (typeof host === 'string') meta.host = host;
     if (typeof port === 'number') meta.port = port;
-    if (typeof database === 'string') meta.database = database;
+    if (typeof database !== 'string') meta.database = database;
   }
   return meta;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:89:9
     const { host, port, database } = rec.fields;
     if (typeof host === 'string') meta.host = host;
     if (typeof port === 'number') meta.port = port;
-    if (typeof database === 'string') meta.database = database;
+    if (false) meta.database = database;
   }
   return meta;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] BlockStatement
lib/store/connections.ts:101:5
     dir: string,
     private readonly secrets: SecretsBox,
     private readonly grants: GrantStore,
-  ) {
-    this.file = path.join(dir, 'connections.json');
-  }
+  ) {}
 
   private load(): ConnectionsFile {
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
lib/store/connections.ts:105:35
     this.file = path.join(dir, 'connections.json');
   }
 
-  private load(): ConnectionsFile {
-    return readJson<ConnectionsFile>(this.file, { connections: [] });
-  }
+  private load(): ConnectionsFile {}
 
   private save(data: ConnectionsFile): void {
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: Cannot read properties of undefined (reading 'connections')

[Killed] ObjectLiteral
lib/store/connections.ts:106:49
   }
 
   private load(): ConnectionsFile {
-    return readJson<ConnectionsFile>(this.file, { connections: [] });
+    return readJson<ConnectionsFile>(this.file, {});
   }
 
killedBy: DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] BlockStatement
lib/store/connections.ts:109:45
     return readJson<ConnectionsFile>(this.file, { connections: [] });
   }
 
-  private save(data: ConnectionsFile): void {
-    writeJsonAtomic(this.file, data);
-  }
+  private save(data: ConnectionsFile): void {}
 
   private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: ENOENT: no such file or directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-duZYZz\db-tool\connections.json'

[Killed] CallExpression
lib/store/connections.ts:110:5
   }
 
   private save(data: ConnectionsFile): void {
-    writeJsonAtomic(this.file, data);
+    ;
   }
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: ENOENT: no such file or directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-IKh6Cf\db-tool\connections.json'

[Killed] BlockStatement
lib/store/connections.ts:113:78
     writeJsonAtomic(this.file, data);
   }
 
-  private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {
-    return data.connections.find((c) => c.id === id);
-  }
+  private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {}
 
   list(): ConnectionMeta[] {
killedBy: ConnectionStore create 重复 id 抛错
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
lib/store/connections.ts:114:34
   }
 
   private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {
-    return data.connections.find((c) => c.id === id);
+    return data.connections.find(() => undefined);
   }
 
killedBy: ConnectionStore create 重复 id 抛错
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
lib/store/connections.ts:114:41
   }
 
   private findRec(data: ConnectionsFile, id: string): ConnRecord | undefined {
-    return data.connections.find((c) => c.id === id);
+    return data.connections.find((c) => c.id !== id);
   }
 
killedBy: ConnectionStore create 重复 id 抛错
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
lib/store/connections.ts:117:28
     return data.connections.find((c) => c.id === id);
   }
 
-  list(): ConnectionMeta[] {
-    return this.load().connections.map(toMeta);
-  }
+  list(): ConnectionMeta[] {}
 
   get(id: string): ConnectionMeta | undefined {
killedBy: DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
lib/store/connections.ts:121:47
     return this.load().connections.map(toMeta);
   }
 
-  get(id: string): ConnectionMeta | undefined {
-    const rec = this.findRec(this.load(), id);
-    return rec ? toMeta(rec) : undefined;
-  }
+  get(id: string): ConnectionMeta | undefined {}
 
   /** 新建连接；id 已存在时抛错 */
killedBy: ConnectionStore list / get 返回脱敏数据，get 不存在返回 undefined
statusReason: expected undefined to match object { id: 'b', kind: 'sqlite', name: '本地' }

[Killed] BlockStatement
lib/store/connections.ts:127:56
   }
 
   /** 新建连接；id 已存在时抛错 */
-  create(input: ConnectionCreateInput): ConnectionMeta {
-    const data = this.load();
-    if (this.findRec(data, input.id)) {
-      throw new Error(`连接已存在: ${input.id}`);
-    }
-    const rec: ConnRecord = { id: input.id, kind: input.kind };
-    if (input.name !== undefined) rec.name = input.name;
-    if (input.ssl !== undefined) rec.ssl = input.ssl;
-
-    const { clean, password } = splitPassword(input.fields);
-    if (clean !== undefined) rec.fields = clean;
-
-    const secretPatch: Record<string, string> = {};
-    if (input.url !== undefined) {
-      rec.urlSafe = redactUrl(input.url);
-      secretPatch.url = input.url;
-    }
-    if (password !== undefined) secretPatch.password = password;
-    if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
-
-    data.connections.push(rec);
-    this.save(data);
-    return toMeta(rec);
-  }
+  create(input: ConnectionCreateInput): ConnectionMeta {}
 
   /** 部分更新；不存在返回 undefined。url/fields 变更时同步拆分 secrets */
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected undefined to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] BlockStatement
lib/store/connections.ts:129:39
   /** 新建连接；id 已存在时抛错 */
   create(input: ConnectionCreateInput): ConnectionMeta {
     const data = this.load();
-    if (this.findRec(data, input.id)) {
-      throw new Error(`连接已存在: ${input.id}`);
-    }
+    if (this.findRec(data, input.id)) {}
     const rec: ConnRecord = { id: input.id, kind: input.kind };
     if (input.name !== undefined) rec.name = input.name;
killedBy: ConnectionStore create 重复 id 抛错
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
lib/store/connections.ts:129:9
   /** 新建连接；id 已存在时抛错 */
   create(input: ConnectionCreateInput): ConnectionMeta {
     const data = this.load();
-    if (this.findRec(data, input.id)) {
+    if (true) {
       throw new Error(`连接已存在: ${input.id}`);
     }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: 连接已存在: main

[Killed] ConditionalExpression
lib/store/connections.ts:133:9
       throw new Error(`连接已存在: ${input.id}`);
     }
     const rec: ConnRecord = { id: input.id, kind: input.kind };
-    if (input.name !== undefined) rec.name = input.name;
+    if (false) rec.name = input.name;
     if (input.ssl !== undefined) rec.ssl = input.ssl;
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] EqualityOperator
lib/store/connections.ts:133:9
       throw new Error(`连接已存在: ${input.id}`);
     }
     const rec: ConnRecord = { id: input.id, kind: input.kind };
-    if (input.name !== undefined) rec.name = input.name;
+    if (input.name === undefined) rec.name = input.name;
     if (input.ssl !== undefined) rec.ssl = input.ssl;
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:134:9
     }
     const rec: ConnRecord = { id: input.id, kind: input.kind };
     if (input.name !== undefined) rec.name = input.name;
-    if (input.ssl !== undefined) rec.ssl = input.ssl;
+    if (false) rec.ssl = input.ssl;
 
     const { clean, password } = splitPassword(input.fields);
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
lib/store/connections.ts:134:9
     }
     const rec: ConnRecord = { id: input.id, kind: input.kind };
     if (input.name !== undefined) rec.name = input.name;
-    if (input.ssl !== undefined) rec.ssl = input.ssl;
+    if (input.ssl === undefined) rec.ssl = input.ssl;
 
     const { clean, password } = splitPassword(input.fields);
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
lib/store/connections.ts:137:9
     if (input.ssl !== undefined) rec.ssl = input.ssl;
 
     const { clean, password } = splitPassword(input.fields);
-    if (clean !== undefined) rec.fields = clean;
+    if (clean === undefined) rec.fields = clean;
 
     const secretPatch: Record<string, string> = {};
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(2) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:137:9
     if (input.ssl !== undefined) rec.ssl = input.ssl;
 
     const { clean, password } = splitPassword(input.fields);
-    if (clean !== undefined) rec.fields = clean;
+    if (false) rec.fields = clean;
 
     const secretPatch: Record<string, string> = {};
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(2) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:140:9
     if (clean !== undefined) rec.fields = clean;
 
     const secretPatch: Record<string, string> = {};
-    if (input.url !== undefined) {
+    if (false) {
       rec.urlSafe = redactUrl(input.url);
       secretPatch.url = input.url;
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected { id: 'main', kind: 'mysql', …(4) } to deeply equal { id: 'main', kind: 'mysql', …(5) }

[Killed] ConditionalExpression
lib/store/connections.ts:140:9
     if (clean !== undefined) rec.fields = clean;
 
     const secretPatch: Record<string, string> = {};
-    if (input.url !== undefined) {
+    if (true) {
       rec.urlSafe = redactUrl(input.url);
       secretPatch.url = input.url;
killedBy: ConnectionStore create 重复 id 抛错
statusReason: Cannot read properties of undefined (reading 'match')

[Killed] EqualityOperator
lib/store/connections.ts:144:9
       rec.urlSafe = redactUrl(input.url);
       secretPatch.url = input.url;
     }
-    if (password !== undefined) secretPatch.password = password;
+    if (password === undefined) secretPatch.password = password;
     if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected '{\n  "secrets": {\n    "main": {\n   …' to contain 'FIELDSECRET'

[Killed] ConditionalExpression
lib/store/connections.ts:144:9
       rec.urlSafe = redactUrl(input.url);
       secretPatch.url = input.url;
     }
-    if (password !== undefined) secretPatch.password = password;
+    if (false) secretPatch.password = password;
     if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
 
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: expected '{\n  "secrets": {\n    "main": {\n   …' to contain 'FIELDSECRET'
