[Survived] StringLiteral
lib/manager.ts:167:64
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? 'default', "", false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:167:72
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', true, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:167:79
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:175:122
-     async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {
-       const t = assertNonEmpty(table, 'table');
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
-       try {
-         const result = await adapter.describeTable(t, database);
-         this.audit(key, connId, 'schema', t, 'none', false, true);
-         return result;
-       } catch (e) {
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
-     }
+     async schema(projectPath: string | undefined, connId: string, table: string, database?: string): Promise<ColumnInfo[]> {}
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:176:37
-       const t = assertNonEmpty(table, 'table');
+       const t = assertNonEmpty(table, "");
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:177:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:178:9
-       try {
-         const result = await adapter.describeTable(t, database);
-         this.audit(key, connId, 'schema', t, 'none', false, true);
-         return result;
-       } catch (e) {
+       try {} catch (e) {
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:180:31
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, "", t, 'none', false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:180:44
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, 'schema', t, "", false, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:180:52
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, 'schema', t, 'none', true, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:180:59
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, 'schema', t, 'none', false, false);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:194:27
-     ): Promise<QueryResult> {
-       const t = assertNonEmpty(table, 'table');
-       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
-       try {
-         const result = await adapter.previewRows(t, capped, database);
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
-         return result;
-       } catch (e) {
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
-     }
+     ): Promise<QueryResult> {}
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:195:37
-       const t = assertNonEmpty(table, 'table');
+       const t = assertNonEmpty(table, "");
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] MethodExpression
lib/manager.ts:196:20
-       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+       const capped = Math.min(1, Math.min(50, Math.floor(Number(limit) || 10)));
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] MethodExpression
lib/manager.ts:196:32
-       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+       const capped = Math.max(1, Math.max(50, Math.floor(Number(limit) || 10)));
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] ConditionalExpression
lib/manager.ts:196:56
-       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+       const capped = Math.max(1, Math.min(50, Math.floor(true)));
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] ConditionalExpression
lib/manager.ts:196:56
-       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+       const capped = Math.max(1, Math.min(50, Math.floor(false)));
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] LogicalOperator
lib/manager.ts:196:56
-       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) || 10)));
+       const capped = Math.max(1, Math.min(50, Math.floor(Number(limit) && 10)));
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:197:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:198:9
-       try {
-         const result = await adapter.previewRows(t, capped, database);
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
-         return result;
-       } catch (e) {
+       try {} catch (e) {
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:200:31
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, "", `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:200:42
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', ``, 'none', false, true, undefined, result.rowCount);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] StringLiteral
lib/manager.ts:200:74
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, "", false, true, undefined, result.rowCount);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:200:82
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', true, true, undefined, result.rowCount);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BooleanLiteral
lib/manager.ts:200:89
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, undefined, result.rowCount);
Tests ran:
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50

[Survived] BlockStatement
lib/manager.ts:216:41
-     ): Promise<QueryResult | NeedConfirm> {
-       const statement = assertNonEmpty(sql, 'sql');
-       return this.runGuarded({
-         projectPath,
-         connId,
-         op: 'query',
-         statement,
-         challengeId,
-         run: (adapter) => adapter.query(statement, params),
-         rowsAffected: (r) => r.rowCount,
-       });
-     }
+     ): Promise<QueryResult | NeedConfirm> {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] StringLiteral
lib/manager.ts:217:43
-       const statement = assertNonEmpty(sql, 'sql');
+       const statement = assertNonEmpty(sql, "");
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ObjectLiteral
lib/manager.ts:218:28
-       return this.runGuarded({
-         projectPath,
-         connId,
-         op: 'query',
-         statement,
-         challengeId,
-         run: (adapter) => adapter.query(statement, params),
-         rowsAffected: (r) => r.rowCount,
-       });
+       return this.runGuarded({});
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] StringLiteral
lib/manager.ts:221:11
-         op: 'query',
+         op: "",
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ArrowFunction
lib/manager.ts:224:12
-         run: (adapter) => adapter.query(statement, params),
+         run: () => undefined,
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ArrowFunction
lib/manager.ts:225:21
-         rowsAffected: (r) => r.rowCount,
+         rowsAffected: () => undefined,
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BlockStatement
lib/manager.ts:235:40
-     ): Promise<ExecResult | NeedConfirm> {
-       const stmt = assertNonEmpty(statement, 'statement');
-       return this.runGuarded({
-         projectPath,
-         connId,
-         op: 'execute',
-         statement: stmt,
-         challengeId,
-         run: (adapter) => adapter.execute(stmt, params),
-         rowsAffected: (r) => r.affectedRows,
-       });
-     }
+     ): Promise<ExecResult | NeedConfirm> {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] StringLiteral
lib/manager.ts:236:44
-       const stmt = assertNonEmpty(statement, 'statement');
+       const stmt = assertNonEmpty(statement, "");
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] ObjectLiteral
lib/manager.ts:237:28
-       return this.runGuarded({
-         projectPath,
-         connId,
-         op: 'execute',
-         statement: stmt,
-         challengeId,
-         run: (adapter) => adapter.execute(stmt, params),
-         rowsAffected: (r) => r.affectedRows,
-       });
+       return this.runGuarded({});
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] StringLiteral
lib/manager.ts:240:11
-         op: 'execute',
+         op: "",
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] ArrowFunction
lib/manager.ts:243:12
-         run: (adapter) => adapter.execute(stmt, params),
+         run: () => undefined,
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] ArrowFunction
lib/manager.ts:244:21
-         rowsAffected: (r) => r.affectedRows,
+         rowsAffected: () => undefined,
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 11 more tests!

[Survived] StringLiteral
lib/manager.ts:259:38
-       const src = assertNonEmpty(code, 'code');
+       const src = assertNonEmpty(code, "");
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 4 more tests!

[Survived] BooleanLiteral
lib/manager.ts:260:78
-       const { key, mode, adapter } = await this.authorize(projectPath, connId, true);
+       const { key, mode, adapter } = await this.authorize(projectPath, connId, false);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 4 more tests!

[Survived] ObjectLiteral
lib/manager.ts:262:16
-       const db = {
-         query: async (sql: string, params?: unknown[]): Promise<unknown> => {
-           const r = await this.query(key, connId, sql, params);
-           return this.unwrapForScript(r);
-         },
-         execute: async (statement: string, params?: unknown[]): Promise<unknown> => {
-           const r = await this.execute(key, connId, statement, params, challengeId);
-           return this.unwrapForScript(r);
-         },
-       };
+       const db = {};
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] BlockStatement
lib/manager.ts:263:75
-         query: async (sql: string, params?: unknown[]): Promise<unknown> => {
-           const r = await this.query(key, connId, sql, params);
-           return this.unwrapForScript(r);
-         },
+         query: async (sql: string, params?: unknown[]): Promise<unknown> => {},
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BlockStatement
lib/manager.ts:267:83
-         execute: async (statement: string, params?: unknown[]): Promise<unknown> => {
-           const r = await this.execute(key, connId, statement, params, challengeId);
-           return this.unwrapForScript(r);
-         },
+         execute: async (statement: string, params?: unknown[]): Promise<unknown> => {},
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）

[Survived] ConditionalExpression
lib/manager.ts:273:9
-       if (mode !== 'rw') {
+       if (true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:273:9
-       if (mode !== 'rw') {
+       if (false) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] EqualityOperator
lib/manager.ts:273:9
-       if (mode !== 'rw') {
+       if (mode === 'rw') {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] StringLiteral
lib/manager.ts:273:18
-       if (mode !== 'rw') {
+       if (mode !== "") {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] StringLiteral
lib/manager.ts:279:29
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, "", src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:279:39
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', true ? src.slice(0, 200) + '…' : src, 'none', false, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:279:39
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', false ? src.slice(0, 200) + '…' : src, 'none', false, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] EqualityOperator
lib/manager.ts:279:39
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length >= 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] EqualityOperator
lib/manager.ts:279:39
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length <= 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] StringLiteral
lib/manager.ts:279:89
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, "", false, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] BooleanLiteral
lib/manager.ts:279:97
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', true, true);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] BooleanLiteral
lib/manager.ts:279:104
-       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, true);
+       this.audit(key, connId, 'script', src.length > 200 ? src.slice(0, 200) + '…' : src, 'none', false, false);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ObjectLiteral
lib/manager.ts:280:46
-       const sandbox: Record<string, unknown> = {
-         db,
-         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },
-       };
+       const sandbox: Record<string, unknown> = {};
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ObjectLiteral
lib/manager.ts:282:16
-         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },
+         console: {},
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ArrowFunction
lib/manager.ts:282:85
-         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },
+         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: () => undefined },
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ArrowFunction
lib/manager.ts:282:23
-         console: { log: (...a: unknown[]) => console.log('[db-script]', ...a), error: (...a: unknown[]) => console.error('[db-script]', ...a) },
+         console: { log: () => undefined, error: (...a: unknown[]) => console.error('[db-script]', ...a) },
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] BlockStatement
lib/manager.ts:284:9
-       try {
-         const p = vm.runInNewContext(`(async () => {\n${src}\n})()`, sandbox, {
-           timeout: 60_000,
-           filename: 'db-script.js',
-         }) as Promise<unknown>;
-         return await Promise.race([
-           p,
-           new Promise<never>((_, rej) => {
-             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', '脚本执行超时（60s）')), 60_000);
-             t.unref?.();
-           }),
-         ]);
-       } catch (e) {
+       try {} catch (e) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 3 more tests!

[Survived] ArrayDeclaration
lib/manager.ts:289:33
-         return await Promise.race([
-           p,
-           new Promise<never>((_, rej) => {
-             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', '脚本执行超时（60s）')), 60_000);
-             t.unref?.();
-           }),
-         ]);
+         return await Promise.race([]);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 2 more tests!

[Survived] BlockStatement
lib/manager.ts:291:40
-           new Promise<never>((_, rej) => {
-             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', '脚本执行超时（60s）')), 60_000);
-             t.unref?.();
-           }),
+           new Promise<never>((_, rej) => {}),
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 2 more tests!

[Survived] ArrowFunction
lib/manager.ts:292:32
-             const t = setTimeout(() => rej(new DbToolError('SCRIPT_TIMEOUT', '脚本执行超时（60s）')), 60_000);
+             const t = setTimeout(() => undefined, 60_000);
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 2 more tests!

[Survived] OptionalChaining
lib/manager.ts:293:11
-             t.unref?.();
+             t.unref();
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 2 more tests!
