[Killed] CallExpression
lib/store/connections.ts:145:46
       secretPatch.url = input.url;
     }
     if (password !== undefined) secretPatch.password = password;
-    if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+    if (Object.keys(secretPatch).length > 0) ;
 
     data.connections.push(rec);
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: ENOENT: no such file or directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-ynCwkk\db-tool\secrets.json'

[Killed] EqualityOperator
lib/store/connections.ts:145:9
       secretPatch.url = input.url;
     }
     if (password !== undefined) secretPatch.password = password;
-    if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+    if (Object.keys(secretPatch).length <= 0) this.secrets.set(input.id, secretPatch);
 
     data.connections.push(rec);
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: ENOENT: no such file or directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-wpwSGW\db-tool\secrets.json'

[Killed] CallExpression
lib/store/connections.ts:147:5
     if (password !== undefined) secretPatch.password = password;
     if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
 
-    data.connections.push(rec);
+    ;
     this.save(data);
     return toMeta(rec);
killedBy: ConnectionStore create 重复 id 抛错
statusReason: expected [Function] to throw an error

[Killed] CallExpression
lib/store/connections.ts:148:5
     if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
 
     data.connections.push(rec);
-    this.save(data);
+    ;
     return toMeta(rec);
   }
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: ENOENT: no such file or directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-lUVRPs\db-tool\connections.json'

[Killed] BlockStatement
lib/store/connections.ts:153:80
   }
 
   /** 部分更新；不存在返回 undefined。url/fields 变更时同步拆分 secrets */
-  update(id: string, patch: ConnectionUpdateInput): ConnectionMeta | undefined {
-    const data = this.load();
-    const rec = this.findRec(data, id);
-    if (!rec) return undefined;
-
-    if (patch.name !== undefined) rec.name = patch.name;
-    if (patch.ssl !== undefined) rec.ssl = patch.ssl;
-    if (patch.fields !== undefined) {
-      const { clean, password } = splitPassword(patch.fields);
-      rec.fields = clean;
-      if (password !== undefined) this.secrets.set(id, { password });
-    }
-    if (patch.url !== undefined) {
-      rec.urlSafe = redactUrl(patch.url);
-      this.secrets.set(id, { url: patch.url });
-    }
-    this.save(data);
-    return toMeta(rec);
-  }
+  update(id: string, patch: ConnectionUpdateInput): ConnectionMeta | undefined {}
 
   /** 删除连接，级联删除 secrets 与该连接的所有项目授权。
killedBy: ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
statusReason: expected undefined to match object { name: '新名字', …(1) }

[Killed] ConditionalExpression
lib/store/connections.ts:156:9
   update(id: string, patch: ConnectionUpdateInput): ConnectionMeta | undefined {
     const data = this.load();
     const rec = this.findRec(data, id);
-    if (!rec) return undefined;
+    if (false) return undefined;
 
     if (patch.name !== undefined) rec.name = patch.name;
killedBy: ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
statusReason: Cannot set properties of undefined (setting 'name')

[Killed] BooleanLiteral
lib/store/connections.ts:156:9
   update(id: string, patch: ConnectionUpdateInput): ConnectionMeta | undefined {
     const data = this.load();
     const rec = this.findRec(data, id);
-    if (!rec) return undefined;
+    if (rec) return undefined;
 
     if (patch.name !== undefined) rec.name = patch.name;
killedBy: ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
statusReason: expected undefined to match object { name: '新名字', …(1) }

[Killed] ConditionalExpression
lib/store/connections.ts:158:9
     const rec = this.findRec(data, id);
     if (!rec) return undefined;
 
-    if (patch.name !== undefined) rec.name = patch.name;
+    if (false) rec.name = patch.name;
     if (patch.ssl !== undefined) rec.ssl = patch.ssl;
     if (patch.fields !== undefined) {
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: expected undefined to be 'renamed' // Object.is equality

[Killed] EqualityOperator
lib/store/connections.ts:158:9
     const rec = this.findRec(data, id);
     if (!rec) return undefined;
 
-    if (patch.name !== undefined) rec.name = patch.name;
+    if (patch.name === undefined) rec.name = patch.name;
     if (patch.ssl !== undefined) rec.ssl = patch.ssl;
     if (patch.fields !== undefined) {
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: expected undefined to be 'renamed' // Object.is equality

[Survived] EqualityOperator
lib/store/connections.ts:159:9
     if (!rec) return undefined;
 
     if (patch.name !== undefined) rec.name = patch.name;
-    if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+    if (patch.ssl === undefined) rec.ssl = patch.ssl;
     if (patch.fields !== undefined) {
       const { clean, password } = splitPassword(patch.fields);

[Survived] ConditionalExpression
lib/store/connections.ts:159:9
     if (!rec) return undefined;
 
     if (patch.name !== undefined) rec.name = patch.name;
-    if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+    if (true) rec.ssl = patch.ssl;
     if (patch.fields !== undefined) {
       const { clean, password } = splitPassword(patch.fields);

[Survived] ConditionalExpression
lib/store/connections.ts:160:9
 
     if (patch.name !== undefined) rec.name = patch.name;
     if (patch.ssl !== undefined) rec.ssl = patch.ssl;
-    if (patch.fields !== undefined) {
+    if (true) {
       const { clean, password } = splitPassword(patch.fields);
       rec.fields = clean;

[Survived] EqualityOperator
lib/store/connections.ts:160:9
 
     if (patch.name !== undefined) rec.name = patch.name;
     if (patch.ssl !== undefined) rec.ssl = patch.ssl;
-    if (patch.fields !== undefined) {
+    if (patch.fields === undefined) {
       const { clean, password } = splitPassword(patch.fields);
       rec.fields = clean;

[Survived] ConditionalExpression
lib/store/connections.ts:163:11
     if (patch.fields !== undefined) {
       const { clean, password } = splitPassword(patch.fields);
       rec.fields = clean;
-      if (password !== undefined) this.secrets.set(id, { password });
+      if (true) this.secrets.set(id, { password });
     }
     if (patch.url !== undefined) {

[Survived] ConditionalExpression
lib/store/connections.ts:163:11
     if (patch.fields !== undefined) {
       const { clean, password } = splitPassword(patch.fields);
       rec.fields = clean;
-      if (password !== undefined) this.secrets.set(id, { password });
+      if (false) this.secrets.set(id, { password });
     }
     if (patch.url !== undefined) {

[Killed] ConditionalExpression
lib/store/connections.ts:165:9
       rec.fields = clean;
       if (password !== undefined) this.secrets.set(id, { password });
     }
-    if (patch.url !== undefined) {
+    if (true) {
       rec.urlSafe = redactUrl(patch.url);
       this.secrets.set(id, { url: patch.url });
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
lib/store/connections.ts:165:34
       rec.fields = clean;
       if (password !== undefined) this.secrets.set(id, { password });
     }
-    if (patch.url !== undefined) {
-      rec.urlSafe = redactUrl(patch.url);
-      this.secrets.set(id, { url: patch.url });
-    }
+    if (patch.url !== undefined) {}
     this.save(data);
     return toMeta(rec);
killedBy: ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
statusReason: expected { id: 'a', kind: 'postgresql', …(4) } to match object { name: '新名字', …(1) }
(4 matching properties omitted from actual)

[Survived] CallExpression
lib/store/connections.ts:169:5
       rec.urlSafe = redactUrl(patch.url);
       this.secrets.set(id, { url: patch.url });
     }
-    this.save(data);
+    ;
     return toMeta(rec);
   }

[Killed] BlockStatement
lib/store/connections.ts:176:31
   /** 删除连接，级联删除 secrets 与该连接的所有项目授权。
    *  顺序按"失败开放"原则：先删权限（grants），再删机密（secrets），最后改
    *  连接表——中途崩溃最多残留垃圾机密，绝不残留可用授权。 */
-  remove(id: string): boolean {
-    const data = this.load();
-    const idx = data.connections.findIndex((c) => c.id === id);
-    if (idx < 0) return false;
-    this.grants.removeConn(id);
-    this.secrets.delete(id);
-    data.connections.splice(idx, 1);
-    this.save(data);
-    return true;
-  }
+  remove(id: string): boolean {}
 
   /**
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
lib/store/connections.ts:178:44
    *  连接表——中途崩溃最多残留垃圾机密，绝不残留可用授权。 */
   remove(id: string): boolean {
     const data = this.load();
-    const idx = data.connections.findIndex((c) => c.id === id);
+    const idx = data.connections.findIndex(() => undefined);
     if (idx < 0) return false;
     this.grants.removeConn(id);
killedBy: 连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/store/connections.ts:178:51
    *  连接表——中途崩溃最多残留垃圾机密，绝不残留可用授权。 */
   remove(id: string): boolean {
     const data = this.load();
-    const idx = data.connections.findIndex((c) => c.id === id);
+    const idx = data.connections.findIndex((c) => true);
     if (idx < 0) return false;
     this.grants.removeConn(id);
killedBy: DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
lib/store/connections.ts:179:25
   remove(id: string): boolean {
     const data = this.load();
     const idx = data.connections.findIndex((c) => c.id === id);
-    if (idx < 0) return false;
+    if (idx < 0) return true;
     this.grants.removeConn(id);
     this.secrets.delete(id);
killedBy: DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
lib/store/connections.ts:179:9
   remove(id: string): boolean {
     const data = this.load();
     const idx = data.connections.findIndex((c) => c.id === id);
-    if (idx < 0) return false;
+    if (true) return false;
     this.grants.removeConn(id);
     this.secrets.delete(id);
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
lib/store/connections.ts:180:5
     const data = this.load();
     const idx = data.connections.findIndex((c) => c.id === id);
     if (idx < 0) return false;
-    this.grants.removeConn(id);
+    ;
     this.secrets.delete(id);
     data.connections.splice(idx, 1);
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected 'ro' to be undefined

[Killed] CallExpression
lib/store/connections.ts:181:5
     const idx = data.connections.findIndex((c) => c.id === id);
     if (idx < 0) return false;
     this.grants.removeConn(id);
-    this.secrets.delete(id);
+    ;
     data.connections.splice(idx, 1);
     this.save(data);
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected { Object (url) } to be undefined

[Killed] CallExpression
lib/store/connections.ts:182:5
     if (idx < 0) return false;
     this.grants.removeConn(id);
     this.secrets.delete(id);
-    data.connections.splice(idx, 1);
+    ;
     this.save(data);
     return true;
killedBy: DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
statusReason: expected [ { id: 'c1', kind: 'mysql', …(1) } ] to have a length of +0 but got 1

[Killed] CallExpression
lib/store/connections.ts:183:5
     this.grants.removeConn(id);
     this.secrets.delete(id);
     data.connections.splice(idx, 1);
-    this.save(data);
+    ;
     return true;
   }
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected { id: 'a', kind: 'mysql', …(1) } to be undefined

[Killed] BooleanLiteral
lib/store/connections.ts:184:12
     this.secrets.delete(id);
     data.connections.splice(idx, 1);
     this.save(data);
-    return true;
+    return false;
   }
 
killedBy: DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
statusReason: 连接不存在: c1

[Killed] BlockStatement
lib/store/connections.ts:191:46
    * 组装适配器工厂所需的 ResolvedConnection（含真实密码，绝不返回给模型/HTTP）。
    * 不存在抛错——调用方（工具服务层）应先 get() 展示层校验。
    */
-  testTarget(id: string): ResolvedConnection {
-    const rec = this.findRec(this.load(), id);
-    if (!rec) throw new Error(`连接不存在: ${id}`);
-    const meta = toMeta(rec);
-    const rc: ResolvedConnection = { meta };
-    const sec = this.secrets.get(id);
-    if (sec?.url !== undefined) rc.url = sec.url;
-    let fields = rec.fields ? { ...rec.fields } : undefined;
-    if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
-    if (fields !== undefined) rc.fields = fields;
-    if (rec.ssl !== undefined) rc.ssl = rec.ssl;
-    return rc;
-  }
+  testTarget(id: string): ResolvedConnection {}
 }
 
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: Cannot read properties of undefined (reading 'meta')

[Killed] ConditionalExpression
lib/store/connections.ts:193:9
    */
   testTarget(id: string): ResolvedConnection {
     const rec = this.findRec(this.load(), id);
-    if (!rec) throw new Error(`连接不存在: ${id}`);
+    if (false) throw new Error(`连接不存在: ${id}`);
     const meta = toMeta(rec);
     const rc: ResolvedConnection = { meta };
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected [Function] to throw error including '连接不存在' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
lib/store/connections.ts:193:9
    */
   testTarget(id: string): ResolvedConnection {
     const rec = this.findRec(this.load(), id);
-    if (!rec) throw new Error(`连接不存在: ${id}`);
+    if (true) throw new Error(`连接不存在: ${id}`);
     const meta = toMeta(rec);
     const rc: ResolvedConnection = { meta };
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: 连接不存在: c1

[Killed] ConditionalExpression
lib/store/connections.ts:197:9
     const meta = toMeta(rec);
     const rc: ResolvedConnection = { meta };
     const sec = this.secrets.get(id);
-    if (sec?.url !== undefined) rc.url = sec.url;
+    if (false) rc.url = sec.url;
     let fields = rec.fields ? { ...rec.fields } : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to be 'mysql://root:TOPSECRET@localhost:3306…' // Object.is equality

[Killed] EqualityOperator
lib/store/connections.ts:197:9
     const meta = toMeta(rec);
     const rc: ResolvedConnection = { meta };
     const sec = this.secrets.get(id);
-    if (sec?.url !== undefined) rc.url = sec.url;
+    if (sec?.url === undefined) rc.url = sec.url;
     let fields = rec.fields ? { ...rec.fields } : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to be 'mysql://root:TOPSECRET@localhost:3306…' // Object.is equality

[Killed] ObjectLiteral
lib/store/connections.ts:198:31
     const rc: ResolvedConnection = { meta };
     const sec = this.secrets.get(id);
     if (sec?.url !== undefined) rc.url = sec.url;
-    let fields = rec.fields ? { ...rec.fields } : undefined;
+    let fields = rec.fields ? {} : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
     if (fields !== undefined) rc.fields = fields;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected { password: 'FIELDSECRET' } to deeply equal { host: 'localhost', …(1) }

[Killed] ConditionalExpression
lib/store/connections.ts:199:9
     const sec = this.secrets.get(id);
     if (sec?.url !== undefined) rc.url = sec.url;
     let fields = rec.fields ? { ...rec.fields } : undefined;
-    if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+    if (false) (fields ??= {}).password = sec.password;
     if (fields !== undefined) rc.fields = fields;
     if (rec.ssl !== undefined) rc.ssl = rec.ssl;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected { host: 'localhost' } to deeply equal { host: 'localhost', …(1) }

[Killed] AssignmentOperator
lib/store/connections.ts:199:39
     const sec = this.secrets.get(id);
     if (sec?.url !== undefined) rc.url = sec.url;
     let fields = rec.fields ? { ...rec.fields } : undefined;
-    if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+    if (sec?.password !== undefined) (fields &&= {}).password = sec.password;
     if (fields !== undefined) rc.fields = fields;
     if (rec.ssl !== undefined) rc.ssl = rec.ssl;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected { password: 'FIELDSECRET' } to deeply equal { host: 'localhost', …(1) }

[Killed] EqualityOperator
lib/store/connections.ts:200:9
     if (sec?.url !== undefined) rc.url = sec.url;
     let fields = rec.fields ? { ...rec.fields } : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
-    if (fields !== undefined) rc.fields = fields;
+    if (fields === undefined) rc.fields = fields;
     if (rec.ssl !== undefined) rc.ssl = rec.ssl;
     return rc;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to deeply equal { host: 'localhost', …(1) }

[Killed] ConditionalExpression
lib/store/connections.ts:200:9
     if (sec?.url !== undefined) rc.url = sec.url;
     let fields = rec.fields ? { ...rec.fields } : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
-    if (fields !== undefined) rc.fields = fields;
+    if (false) rc.fields = fields;
     if (rec.ssl !== undefined) rc.ssl = rec.ssl;
     return rc;
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to deeply equal { host: 'localhost', …(1) }

[Killed] EqualityOperator
lib/store/connections.ts:201:9
     let fields = rec.fields ? { ...rec.fields } : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
     if (fields !== undefined) rc.fields = fields;
-    if (rec.ssl !== undefined) rc.ssl = rec.ssl;
+    if (rec.ssl === undefined) rc.ssl = rec.ssl;
     return rc;
   }
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
lib/store/connections.ts:201:9
     let fields = rec.fields ? { ...rec.fields } : undefined;
     if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
     if (fields !== undefined) rc.fields = fields;
-    if (rec.ssl !== undefined) rc.ssl = rec.ssl;
+    if (false) rc.ssl = rec.ssl;
     return rc;
   }
killedBy: ConnectionStore testTarget 返回含机密的 ResolvedConnection；不存在抛错
statusReason: expected undefined to be true // Object.is equality
