[Survived] BlockStatement
lib/manager.ts:296:17
-       } catch (e) {
-         if (e instanceof DbToolError) throw e;
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:297:11
-         if (e instanceof DbToolError) throw e;
+         if (true) throw e;
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:297:11
-         if (e instanceof DbToolError) throw e;
+         if (false) throw e;
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] BlockStatement
lib/manager.ts:304:76
-     auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {
-       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
-       const key = normalizeProjectKey(projectPath);
-       return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
-     }
+     auditTail(projectPath: string | undefined, limit?: number): AuditEntry[] {}
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] MethodExpression
lib/manager.ts:305:15
-       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+       const n = Math.min(1, Math.min(500, Math.floor(Number(limit) || 50)));
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] MethodExpression
lib/manager.ts:305:27
-       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+       const n = Math.max(1, Math.max(500, Math.floor(Number(limit) || 50)));
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:305:52
-       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+       const n = Math.max(1, Math.min(500, Math.floor(true)));
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:305:52
-       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+       const n = Math.max(1, Math.min(500, Math.floor(false)));
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] LogicalOperator
lib/manager.ts:305:52
-       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) || 50)));
+       const n = Math.max(1, Math.min(500, Math.floor(Number(limit) && 50)));
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:306:9
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (true) return this.store.audit.tail(n);
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:306:9
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (false) return this.store.audit.tail(n);
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] LogicalOperator
lib/manager.ts:306:9
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (!projectPath && projectPath.trim() === '') return this.store.audit.tail(n);
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:306:25
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (!projectPath || false) return this.store.audit.tail(n);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] EqualityOperator
lib/manager.ts:306:25
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (!projectPath || projectPath.trim() !== '') return this.store.audit.tail(n);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] MethodExpression
lib/manager.ts:306:25
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (!projectPath || projectPath === '') return this.store.audit.tail(n);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] BooleanLiteral
lib/manager.ts:306:9
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 3 more tests!

[Survived] StringLiteral
lib/manager.ts:306:48
-       if (!projectPath || projectPath.trim() === '') return this.store.audit.tail(n);
+       if (!projectPath || projectPath.trim() === "Stryker was here!") return this.store.audit.tail(n);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] MethodExpression
lib/manager.ts:308:12
-       return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+       return this.store.audit.tail(n);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] ArrowFunction
lib/manager.ts:308:44
-       return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+       return this.store.audit.tail(n).filter(() => undefined);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] ConditionalExpression
lib/manager.ts:308:51
-       return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+       return this.store.audit.tail(n).filter((e) => true);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] ConditionalExpression
lib/manager.ts:308:51
-       return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+       return this.store.audit.tail(n).filter((e) => false);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] EqualityOperator
lib/manager.ts:308:51
-       return this.store.audit.tail(n).filter((e) => e.projectPathKey === key);
+       return this.store.audit.tail(n).filter((e) => e.projectPathKey !== key);
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] BlockStatement
lib/manager.ts:315:5
-     } {
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
-       return {
-         connections: this.listConnections(),
-         grants,
-         auditTail: this.auditTail(projectPath, 50),
-       };
-     }
+     } {}
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:316:20
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = true ? this.grantsFor(projectPath) : [];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:316:20
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = false ? this.grantsFor(projectPath) : [];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 1 more test!

[Survived] LogicalOperator
lib/manager.ts:316:20
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = projectPath || projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 1 more test!

[Survived] EqualityOperator
lib/manager.ts:316:35
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = projectPath && projectPath.trim() === '' ? this.grantsFor(projectPath) : [];
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] ConditionalExpression
lib/manager.ts:316:35
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = projectPath && true ? this.grantsFor(projectPath) : [];
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] StringLiteral
lib/manager.ts:316:58
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = projectPath && projectPath.trim() !== "Stryker was here!" ? this.grantsFor(projectPath) : [];
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] MethodExpression
lib/manager.ts:316:35
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = projectPath && projectPath !== '' ? this.grantsFor(projectPath) : [];
Tests ran:
    业务路由与确认流程 GET /api/audit 与 /api/state

[Survived] ArrayDeclaration
lib/manager.ts:316:93
-       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : [];
+       const grants = projectPath && projectPath.trim() !== '' ? this.grantsFor(projectPath) : ["Stryker was here"];
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）

[Survived] ObjectLiteral
lib/manager.ts:317:12
-       return {
-         connections: this.listConnections(),
-         grants,
-         auditTail: this.auditTail(projectPath, 50),
-       };
+       return {};
Tests ran:
    fenced 校验 无 Origin/Referer（本地脚本）放行
    handleDbToolRequest 直调（prefix 挂载形态 + trust） loopback 同端口 + prefix 路径 /dsh-db-tool/api/state → 200
    handleDbToolRequest 直调（prefix 挂载形态 + trust） trustedHosts 条目放行（非 loopback Host + 受信 Origin）
  and 1 more test!

[Survived] BlockStatement
lib/manager.ts:342:93
-     private requireConn(connId: string): ReturnType<DbToolStore['connections']['testTarget']> {
-       try {
-         return this.store.connections.testTarget(connId);
-       } catch {
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
-       }
-     }
+     private requireConn(connId: string): ReturnType<DbToolStore['connections']['testTarget']> {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 13 more tests!

[Survived] BlockStatement
lib/manager.ts:343:9
-       try {
-         return this.store.connections.testTarget(connId);
-       } catch {
+       try {} catch {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 13 more tests!

[Survived] ConditionalExpression
lib/manager.ts:356:9
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (true) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] BlockStatement
lib/manager.ts:355:76
-     ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
-       if (!projectPath || projectPath.trim() === '') {
-         throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
-       }
-       const key = normalizeProjectKey(projectPath);
-       const mode = this.store.grants.check(key, connId);
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
-       if (needWrite && mode === 'ro') {
-         throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
-       }
-       const adapter = await this.adapterFor(connId, mode);
-       return { key, mode, adapter };
-     }
+     ): Promise<{ key: string; mode: 'ro' | 'rw'; adapter: DatabaseAdapter }> {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:356:9
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (false) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:357:9
-       if (!projectPath || projectPath.trim() === '') {
+       if (true) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:357:9
-       if (!projectPath || projectPath.trim() === '') {
+       if (false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] LogicalOperator
lib/manager.ts:357:9
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath && projectPath.trim() === '') {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] BooleanLiteral
lib/manager.ts:357:9
-       if (!projectPath || projectPath.trim() === '') {
+       if (projectPath || projectPath.trim() === '') {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:357:25
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] EqualityOperator
lib/manager.ts:357:25
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || projectPath.trim() !== '') {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] MethodExpression
lib/manager.ts:357:25
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || projectPath === '') {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] BlockStatement
lib/manager.ts:357:52
-       if (!projectPath || projectPath.trim() === '') {
-         throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
-       }
+       if (!projectPath || projectPath.trim() === '') {}
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝

[Survived] StringLiteral
lib/manager.ts:358:29
-         throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
+         throw new DbToolError("", '业务操作需要 projectPath（匿名项目仅可管理连接）');
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝

[Survived] StringLiteral
lib/manager.ts:358:53
-         throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
+         throw new DbToolError('UNAUTHORIZED_PROJECT', "");
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝

[Survived] StringLiteral
lib/manager.ts:357:48
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || projectPath.trim() === "Stryker was here!") {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] BooleanLiteral
lib/manager.ts:362:9
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+       if (mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:362:9
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+       if (true) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] StringLiteral
lib/manager.ts:362:38
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+       if (!mode) throw new DbToolError("", `项目未授权该连接: ${connId}`);
Tests ran:
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:362:9
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+       if (false) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
  and 22 more tests!

[Survived] StringLiteral
lib/manager.ts:362:62
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', ``);
Tests ran:
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:363:9
-       if (needWrite && mode === 'ro') {
+       if (true) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] ConditionalExpression
lib/manager.ts:363:9
-       if (needWrite && mode === 'ro') {
+       if (false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] LogicalOperator
lib/manager.ts:363:9
-       if (needWrite && mode === 'ro') {
+       if (needWrite || mode === 'ro') {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] ConditionalExpression
lib/manager.ts:363:22
-       if (needWrite && mode === 'ro') {
+       if (needWrite && true) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] BlockStatement
lib/manager.ts:363:37
-       if (needWrite && mode === 'ro') {
-         throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
-       }
+       if (needWrite && mode === 'ro') {}
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 危险确认与 challenge ro 连接对危险语句也先报 READ_ONLY（授权优先于 guard）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] EqualityOperator
lib/manager.ts:363:22
-       if (needWrite && mode === 'ro') {
+       if (needWrite && mode !== 'ro') {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] StringLiteral
lib/manager.ts:364:29
-         throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
+         throw new DbToolError("", '该连接对本项目为只读授权（ro），拒绝写操作');
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 危险确认与 challenge ro 连接对危险语句也先报 READ_ONLY（授权优先于 guard）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:363:31
-       if (needWrite && mode === 'ro') {
+       if (needWrite && mode === "") {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 14 more tests!

[Survived] StringLiteral
lib/manager.ts:364:42
-         throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
+         throw new DbToolError('READ_ONLY', "");
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 危险确认与 challenge ro 连接对危险语句也先报 READ_ONLY（授权优先于 guard）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ObjectLiteral
lib/manager.ts:367:12
-       return { key, mode, adapter };
+       return {};
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 17 more tests!

[Survived] BlockStatement
lib/manager.ts:370:83
-     private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {
-       let p = this.adapterCache.get(connId);
-       if (!p) {
-         p = (async () => {
-           const rc = this.requireConn(connId);
-           const factory = await this.resolver(rc.meta.kind);
-           return factory(rc, { mode });
-         })().catch((e) => {
-           this.adapterCache.delete(connId);
-           throw e instanceof DbToolError ? e : this.toDriverError(e);
-         });
-         this.adapterCache.set(connId, p);
-       }
-       return p;
-     }
+     private adapterFor(connId: string, mode: 'ro' | 'rw'): Promise<DatabaseAdapter> {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 17 more tests!

[Survived] BooleanLiteral
lib/manager.ts:372:9
-       if (!p) {
+       if (p) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 17 more tests!

[Survived] ConditionalExpression
lib/manager.ts:372:9
-       if (!p) {
+       if (true) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 17 more tests!

[Survived] BlockStatement
lib/manager.ts:372:13
-       if (!p) {
-         p = (async () => {
-           const rc = this.requireConn(connId);
-           const factory = await this.resolver(rc.meta.kind);
-           return factory(rc, { mode });
-         })().catch((e) => {
-           this.adapterCache.delete(connId);
-           throw e instanceof DbToolError ? e : this.toDriverError(e);
-         });
-         this.adapterCache.set(connId, p);
-       }
+       if (!p) {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 13 more tests!

[Survived] ConditionalExpression
lib/manager.ts:372:9
-       if (!p) {
+       if (false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 17 more tests!

[Survived] BlockStatement
lib/manager.ts:373:24
-         p = (async () => {
-           const rc = this.requireConn(connId);
-           const factory = await this.resolver(rc.meta.kind);
-           return factory(rc, { mode });
-         })().catch((e) => {
+         p = (async () => {})().catch((e) => {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 13 more tests!

[Survived] ObjectLiteral
lib/manager.ts:376:28
-           return factory(rc, { mode });
+           return factory(rc, {});
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 13 more tests!
