[Killed] BlockStatement
lib/store/index.ts:40:33
   readonly grants: GrantStore;
   readonly audit: AuditLog;
 
-  constructor(homeDir?: string) {
-    const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
-    this.dir = path.join(home, 'db-tool');
-    fs.mkdirSync(this.dir, { recursive: true });
-    chmodBestEffort(this.dir, 0o700);
-    this.secrets = new SecretsBox(this.dir);
-    this.grants = new GrantStore(this.dir);
-    this.audit = new AuditLog(this.dir);
-    this.connections = new ConnectionStore(this.dir, this.secrets, this.grants);
-  }
+  constructor(homeDir?: string) {}
 }
 
killedBy: GrantStore grant 后 grantsFor/check 可见
statusReason: Cannot read properties of undefined (reading 'grant')

[Killed] LogicalOperator
lib/store/index.ts:41:18
   readonly audit: AuditLog;
 
   constructor(homeDir?: string) {
-    const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
+    const home = homeDir && process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
     this.dir = path.join(home, 'db-tool');
     fs.mkdirSync(this.dir, { recursive: true });
killedBy: DbToolService.dispose dispose 关闭所有缓存适配器（含加载失败项不炸）
statusReason: 连接已存在: c1

[Killed] LogicalOperator
lib/store/index.ts:41:18
   readonly audit: AuditLog;
 
   constructor(homeDir?: string) {
-    const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
+    const home = (homeDir ?? process.env['DSH_HOME']) && path.join(os.homedir(), '.dsh');
     this.dir = path.join(home, 'db-tool');
     fs.mkdirSync(this.dir, { recursive: true });
killedBy: ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
statusReason: 连接已存在: main

[Killed] StringLiteral
lib/store/index.ts:42:32
 
   constructor(homeDir?: string) {
     const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
-    this.dir = path.join(home, 'db-tool');
+    this.dir = path.join(home, "");
     fs.mkdirSync(this.dir, { recursive: true });
     chmodBestEffort(this.dir, 0o700);
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] BooleanLiteral
lib/store/index.ts:43:41
   constructor(homeDir?: string) {
     const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
     this.dir = path.join(home, 'db-tool');
-    fs.mkdirSync(this.dir, { recursive: true });
+    fs.mkdirSync(this.dir, { recursive: false });
     chmodBestEffort(this.dir, 0o700);
     this.secrets = new SecretsBox(this.dir);
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: EEXIST: file already exists, mkdir 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-ODhhoP\db-tool'

[Killed] ObjectLiteral
lib/store/index.ts:43:28
   constructor(homeDir?: string) {
     const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
     this.dir = path.join(home, 'db-tool');
-    fs.mkdirSync(this.dir, { recursive: true });
+    fs.mkdirSync(this.dir, {});
     chmodBestEffort(this.dir, 0o700);
     this.secrets = new SecretsBox(this.dir);
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: EEXIST: file already exists, mkdir 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-cqgYzm\db-tool'

[Survived] CallExpression
lib/store/index.ts:44:5
     const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
     this.dir = path.join(home, 'db-tool');
     fs.mkdirSync(this.dir, { recursive: true });
-    chmodBestEffort(this.dir, 0o700);
+    ;
     this.secrets = new SecretsBox(this.dir);
     this.grants = new GrantStore(this.dir);
