[Survived] CallExpression
lib/manager.ts:381:7
-         this.adapterCache.set(connId, p);
+         ;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
  and 13 more tests!

[Survived] BlockStatement
lib/manager.ts:395:32
-     }): Promise<T | NeedConfirm> {
-       const { projectPath, connId, op, statement, challengeId } = args;
-       const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
-       const kind = adapter.kind;
-       const verdict = classifyStatement(kind, statement, op);
-       if (verdict.level === 'danger') {
-         if (!challengeId) {
-           const { id: cid } = this.challenges.create(statement);
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
-         }
-         if (!this.challenges.consume(challengeId, statement)) {
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
-           throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
-         }
-       }
-       try {
-         const result = await args.run(adapter);
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
-         return result;
-       } catch (e) {
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
-         throw this.toDriverError(e);
-       }
-     }
+     }): Promise<T | NeedConfirm>

[Survived] ConditionalExpression
lib/manager.ts:397:72
-       const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] ConditionalExpression
lib/manager.ts:397:72
-       const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
+       const { key, adapter } = await this.authorize(projectPath, connId, false);
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] StringLiteral
lib/manager.ts:397:79
-       const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
+       const { key, adapter } = await this.authorize(projectPath, connId, op === "");
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] EqualityOperator
lib/manager.ts:397:72
-       const { key, adapter } = await this.authorize(projectPath, connId, op === 'execute');
+       const { key, adapter } = await this.authorize(projectPath, connId, op !== 'execute');
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 18 more tests!

[Survived] ConditionalExpression
lib/manager.ts:401:9
-       if (verdict.level === 'danger') {
+       if (true) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 13 more tests!

[Survived] ConditionalExpression
lib/manager.ts:401:9
-       if (verdict.level === 'danger') {
+       if (false) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 13 more tests!

[Survived] EqualityOperator
lib/manager.ts:401:9
-       if (verdict.level === 'danger') {
+       if (verdict.level !== 'danger') {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 13 more tests!

[Survived] StringLiteral
lib/manager.ts:401:27
-       if (verdict.level === 'danger') {
+       if (verdict.level === "") {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
  and 13 more tests!

[Survived] BooleanLiteral
lib/manager.ts:402:11
-         if (!challengeId) {
+         if (challengeId) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BlockStatement
lib/manager.ts:401:37
-       if (verdict.level === 'danger') {
-         if (!challengeId) {
-           const { id: cid } = this.challenges.create(statement);
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
-         }
-         if (!this.challenges.consume(challengeId, statement)) {
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
-           throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
-         }
-       }
+       if (verdict.level === 'danger') {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/manager.ts:402:11
-         if (!challengeId) {
+         if (true) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/manager.ts:402:11
-         if (!challengeId) {
+         if (false) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BlockStatement
lib/manager.ts:402:25
-         if (!challengeId) {
-           const { id: cid } = this.challenges.create(statement);
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
-         }
+         if (!challengeId) {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] StringLiteral
lib/manager.ts:404:48
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
+           this.audit(key, connId, op, statement, "", false, false, 'NEEDS_CONFIRMATION');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BooleanLiteral
lib/manager.ts:404:58
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
+           this.audit(key, connId, op, statement, 'danger', true, false, 'NEEDS_CONFIRMATION');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BooleanLiteral
lib/manager.ts:404:65
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
+           this.audit(key, connId, op, statement, 'danger', false, true, 'NEEDS_CONFIRMATION');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] StringLiteral
lib/manager.ts:404:72
-           this.audit(key, connId, op, statement, 'danger', false, false, 'NEEDS_CONFIRMATION');
+           this.audit(key, connId, op, statement, 'danger', false, false, "");
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ObjectLiteral
lib/manager.ts:405:16
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return {};
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BooleanLiteral
lib/manager.ts:405:36
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return { needConfirmation: false, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] StringLiteral
lib/manager.ts:405:79
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return { needConfirmation: true, challengeId: cid, statement, danger: "", reason: verdict.reason ?? '危险操作，需要用户确认' };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] BooleanLiteral
lib/manager.ts:407:11
-         if (!this.challenges.consume(challengeId, statement)) {
+         if (this.challenges.consume(challengeId, statement)) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 5 more tests!

[Survived] LogicalOperator
lib/manager.ts:405:97
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason && '危险操作，需要用户确认' };
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/manager.ts:407:11
-         if (!this.challenges.consume(challengeId, statement)) {
+         if (true) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 5 more tests!

[Survived] ConditionalExpression
lib/manager.ts:407:11
-         if (!this.challenges.consume(challengeId, statement)) {
+         if (false) {
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 5 more tests!

[Survived] BlockStatement
lib/manager.ts:407:61
-         if (!this.challenges.consume(challengeId, statement)) {
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
-           throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
-         }
+         if (!this.challenges.consume(challengeId, statement)) {}
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:408:48
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, "", false, false, 'INVALID_CHALLENGE');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] BooleanLiteral
lib/manager.ts:408:58
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, 'danger', true, false, 'INVALID_CHALLENGE');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] BooleanLiteral
lib/manager.ts:408:65
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, 'danger', false, true, 'INVALID_CHALLENGE');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:408:72
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, 'danger', false, false, "");
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:409:31
-           throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
+           throw new DbToolError("", '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:409:52
-           throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
+           throw new DbToolError('INVALID_CHALLENGE', "");
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
  and 2 more tests!

[Survived] BlockStatement
lib/manager.ts:413:9
-       try {
-         const result = await args.run(adapter);
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
-         return result;
-       } catch (e) {
+       try {} catch (e) {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] CallExpression
lib/manager.ts:415:7
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         ;
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] ConditionalExpression
lib/manager.ts:415:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, true, true, undefined, args.rowsAffected?.(result));
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] ConditionalExpression
lib/manager.ts:415:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, false, true, undefined, args.rowsAffected?.(result));
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] EqualityOperator
lib/manager.ts:415:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level !== 'danger', true, undefined, args.rowsAffected?.(result));
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] StringLiteral
lib/manager.ts:415:94
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === "", true, undefined, args.rowsAffected?.(result));
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] BooleanLiteral
lib/manager.ts:415:104
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, undefined, args.rowsAffected?.(result));
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] OptionalChaining
lib/manager.ts:415:121
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected(result));
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 9 more tests!

[Survived] BlockStatement
lib/manager.ts:424:48
-     private unwrapForScript(r: unknown): unknown {
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
-         const nc = r as NeedConfirm;
-         throw new DbToolError('NEEDS_CONFIRMATION', JSON.stringify(nc));
-       }
-       return r;
-     }
+     private unwrapForScript(r: unknown): unknown {}
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:425:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (false) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:425:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] LogicalOperator
lib/manager.ts:425:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && typeof r === 'object' || (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:425:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (true && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] LogicalOperator
lib/manager.ts:425:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r || typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:425:14
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && true && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] EqualityOperator
lib/manager.ts:425:14
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && typeof r !== 'object' && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] StringLiteral
lib/manager.ts:425:27
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && typeof r === "" && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:425:39
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && typeof r === 'object' && true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] EqualityOperator
lib/manager.ts:425:39
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation !== true) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] BooleanLiteral
lib/manager.ts:425:79
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === false) {
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 1 more test!

[Survived] BlockStatement
lib/manager.ts:425:85
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
-         const nc = r as NeedConfirm;
-         throw new DbToolError('NEEDS_CONFIRMATION', JSON.stringify(nc));
-       }
+       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {}
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）

[Survived] StringLiteral
lib/manager.ts:427:29
-         throw new DbToolError('NEEDS_CONFIRMATION', JSON.stringify(nc));
+         throw new DbToolError("", JSON.stringify(nc));
Tests ran:
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）

[Survived] BlockStatement
lib/manager.ts:442:11
-     ): void {
-       try {
-         this.store.audit.append({
-           projectPathKey, connId, action, statement, danger, confirmed, ok,
-           ...(error !== undefined ? { error } : {}),
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
-         });
-       } catch {
-         // 审计失败不阻塞业务（best-effort）
-       }
-     }
+     ): void {}
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] ObjectLiteral
lib/manager.ts:444:31
-         this.store.audit.append({
-           projectPathKey, connId, action, statement, danger, confirmed, ok,
-           ...(error !== undefined ? { error } : {}),
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
-         });
+         this.store.audit.append({});
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] BlockStatement
lib/manager.ts:443:9
-       try {
-         this.store.audit.append({
-           projectPathKey, connId, action, statement, danger, confirmed, ok,
-           ...(error !== undefined ? { error } : {}),
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
-         });
-       } catch {
+       try {} catch {
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] ConditionalExpression
lib/manager.ts:446:13
-           ...(error !== undefined ? { error } : {}),
+           ...(true ? { error } : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!
