[Survived] ConditionalExpression
lib/manager.ts:446:13
-           ...(error !== undefined ? { error } : {}),
+           ...(false ? { error } : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] ObjectLiteral
lib/manager.ts:446:35
-           ...(error !== undefined ? { error } : {}),
+           ...(error !== undefined ? {} : {}),
Tests ran:
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
    业务路由与确认流程 改语句带原 challengeId → INVALID_CHALLENGE
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）
  and 8 more tests!

[Survived] ConditionalExpression
lib/manager.ts:447:13
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(false ? { rowsAffected } : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] EqualityOperator
lib/manager.ts:446:13
-           ...(error !== undefined ? { error } : {}),
+           ...(error === undefined ? { error } : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] ConditionalExpression
lib/manager.ts:447:13
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(true ? { rowsAffected } : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] BlockStatement
lib/manager.ts:454:39
-     private errText(e: unknown): string {
-       return e instanceof Error ? e.message : String(e);
-     }
+     private errText(e: unknown): string {}
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] BlockStatement
lib/manager.ts:458:44
-     private toDriverError(e: unknown): Error {
-       if (e instanceof DbToolError) return e;
-       return new DbToolError('DRIVER_ERROR', this.errText(e));
-     }
+     private toDriverError(e: unknown): Error {}
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] EqualityOperator
lib/manager.ts:447:13
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(rowsAffected === undefined ? { rowsAffected } : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE
  and 20 more tests!

[Survived] ObjectLiteral
lib/manager.ts:447:42
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(rowsAffected !== undefined ? {} : {}),
Tests ran:
    handleDbToolRequest 直调（prefix 挂载形态 + trust） POST body 直打：query 路由经 handler 正常返回
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
    业务路由与确认流程 危险 execute → NEEDS_CONFIRMATION；携 challengeId 重发放行；重放被拒
  and 11 more tests!

[Survived] ConditionalExpression
lib/manager.ts:459:9
-       if (e instanceof DbToolError) return e;
+       if (true) return e;
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] ConditionalExpression
lib/manager.ts:459:9
-       if (e instanceof DbToolError) return e;
+       if (false) return e;
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] StringLiteral
lib/manager.ts:460:28
-       return new DbToolError('DRIVER_ERROR', this.errText(e));
+       return new DbToolError("", this.errText(e));
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] BlockStatement
lib/manager.ts:485:92
-   function pick(args: ToolActionArgs, snake: 'conn_id' | 'challenge_id'): string | undefined {
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
-   }
+   function pick(args: ToolActionArgs, snake: 'conn_id' | 'challenge_id'): string | undefined {}
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] LogicalOperator
lib/manager.ts:486:10
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] && (snake === 'conn_id' ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] ConditionalExpression
lib/manager.ts:486:26
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (true ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] ConditionalExpression
lib/manager.ts:486:26
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (false ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] EqualityOperator
lib/manager.ts:486:26
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (snake !== 'conn_id' ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:486:36
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (snake === "" ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:499:29
-     const connId = pick(args, 'conn_id');
+     const connId = pick(args, "");
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:500:34
-     const challengeId = pick(args, 'challenge_id');
+     const challengeId = pick(args, "");
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] ArrowFunction
lib/manager.ts:501:13
-     const j = (v: unknown) => JSON.stringify(v, null, 2);
+     const j = () => undefined;
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] ConditionalExpression
lib/manager.ts:505:7
-         case 'list_connections':
-           return j(service.listConnections());
+         case 'list_connections':
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本

[Survived] StringLiteral
lib/manager.ts:505:12
-         case 'list_connections':
+         case "":
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:508:12
-         case 'query': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:508:7
-         case 'query': {
-           const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
-           return needConfirmText(r) ?? j(r);
-         }
+         case 'query':
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] BlockStatement
lib/manager.ts:508:21
-         case 'query': {
-           const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
-           return needConfirmText(r) ?? j(r);
-         }
+         case 'query': {}
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] StringLiteral
lib/manager.ts:509:93
-           const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
+           const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, ""), args.params, challengeId);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）

[Survived] ConditionalExpression
lib/manager.ts:513:7
-         case 'execute': {
-           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
-           return needConfirmText(r) ?? j(r);
-         }
+         case 'execute':
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] LogicalOperator
lib/manager.ts:510:16
-           return needConfirmText(r) ?? j(r);
+           return needConfirmText(r) && j(r);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] StringLiteral
lib/manager.ts:513:12
-         case 'execute': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BlockStatement
lib/manager.ts:513:23
-         case 'execute': {
-           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
-           return needConfirmText(r) ?? j(r);
-         }
+         case 'execute': {}
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] LogicalOperator
lib/manager.ts:514:85
-           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
+           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement && args.sql, 'statement'), args.params, challengeId);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] StringLiteral
lib/manager.ts:514:113
-           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
+           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, ""), args.params, challengeId);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] LogicalOperator
lib/manager.ts:515:16
-           return needConfirmText(r) ?? j(r);
+           return needConfirmText(r) && j(r);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] StringLiteral
lib/manager.ts:525:12
-         case 'preview': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:518:12
-         case 'schema': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:530:7
-         case 'run_script': {
-           const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
-           return needConfirmText(r) ?? j(r);
-         }
+         case 'run_script':
Tests ran:
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:530:12
-         case 'run_script': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:531:98
-           const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
+           const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, ""), challengeId);
Tests ran:
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BlockStatement
lib/manager.ts:530:26
-         case 'run_script': {
-           const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
-           return needConfirmText(r) ?? j(r);
-         }
+         case 'run_script': {}
Tests ran:
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] LogicalOperator
lib/manager.ts:532:16
-           return needConfirmText(r) ?? j(r);
+           return needConfirmText(r) && j(r);
Tests ran:
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:535:7
-         default:
-           throw new DbToolError('INVALID_ARGUMENT', `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
+         default:
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] StringLiteral
lib/manager.ts:536:31
-           throw new DbToolError('INVALID_ARGUMENT', `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
+           throw new DbToolError("", `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] StringLiteral
lib/manager.ts:536:51
-           throw new DbToolError('INVALID_ARGUMENT', `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
+           throw new DbToolError('INVALID_ARGUMENT', ``);
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] BlockStatement
lib/manager.ts:538:15
-     } catch (e) {
-       const code = e instanceof DbToolError ? e.code : 'DRIVER_ERROR';
-       return j({ ok: false, error: e instanceof Error ? e.message : String(e), code });
-     }
+     } catch (e) {}
Tests ran:
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ObjectLiteral
lib/manager.ts:540:14
-       return j({ ok: false, error: e instanceof Error ? e.message : String(e), code });
+       return j({});
Tests ran:
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BooleanLiteral
lib/manager.ts:540:20
-       return j({ ok: false, error: e instanceof Error ? e.message : String(e), code });
+       return j({ ok: true, error: e instanceof Error ? e.message : String(e), code });
Tests ran:
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BlockStatement
lib/manager.ts:544:58
-   function requireConn(connId: string | undefined): string {
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
-     return connId;
-   }
+   function requireConn(connId: string | undefined): string {}
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:545:7
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (true) throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:545:7
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (false) throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] LogicalOperator
lib/manager.ts:545:7
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId && connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] BooleanLiteral
lib/manager.ts:545:7
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:545:18
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || false) throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] EqualityOperator
lib/manager.ts:545:18
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId.trim() !== '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] MethodExpression
lib/manager.ts:545:18
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:545:36
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId.trim() === "Stryker was here!") throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:545:62
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId.trim() === '') throw new DbToolError("", '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] StringLiteral
lib/manager.ts:545:82
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', "");
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] BlockStatement
lib/manager.ts:549:66
-   function assertArg(v: string | undefined, label: string): string {
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
-     return v;
-   }
+   function assertArg(v: string | undefined, label: string): string {}
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:550:7
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (true) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:550:7
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (false) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] LogicalOperator
lib/manager.ts:550:7
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v && v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:550:13
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || false) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BooleanLiteral
lib/manager.ts:550:7
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] EqualityOperator
lib/manager.ts:550:13
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() !== '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] MethodExpression
lib/manager.ts:550:13
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BlockStatement
lib/manager.ts:554:53
-   function needConfirmText(r: unknown): string | null {
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
-     const nc = r as NeedConfirm;
-     return JSON.stringify({
-       ok: false,
-       code: 'NEEDS_CONFIRMATION',
-       ...nc,
-       hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
-     }, null, 2);
-   }
+   function needConfirmText(r: unknown): string | null {}
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:550:26
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === "Stryker was here!") throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BooleanLiteral
lib/manager.ts:555:7
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:555:7
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (false) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:555:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:555:7
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (true) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:555:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(false)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] LogicalOperator
lib/manager.ts:555:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r || typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] LogicalOperator
lib/manager.ts:555:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === 'object' || (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:555:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(true && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:555:14
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && true && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
