[Killed] BlockStatement
lib/store/io.ts:11:69
  * 尽力而为地设置 POSIX 权限。
  * Windows 的 chmod 仅支持只读位，失败时静默忽略，绝不崩溃。
  */
-export function chmodBestEffort(target: string, mode: number): void {
-  try {
-    fs.chmodSync(target, mode);
-  } catch {
-    // 权限设置失败（Windows 等）不影响功能
-  }
-}
+export function chmodBestEffort(target: string, mode: number): void {}
 
 /**
killedBy: io：原子写与损坏容错 writeJsonAtomic 的 fileMode 生效：0o444 只读落盘；缺省不得收紧权限
statusReason: expected 146 to be +0 // Object.is equality

[Killed] BlockStatement
lib/store/io.ts:12:7
  * Windows 的 chmod 仅支持只读位，失败时静默忽略，绝不崩溃。
  */
 export function chmodBestEffort(target: string, mode: number): void {
-  try {
-    fs.chmodSync(target, mode);
-  } catch {
+  try {} catch {
     // 权限设置失败（Windows 等）不影响功能
   }
killedBy: io：原子写与损坏容错 writeJsonAtomic 的 fileMode 生效：0o444 只读落盘；缺省不得收紧权限
statusReason: expected 146 to be +0 // Object.is equality

[Killed] CallExpression
lib/store/io.ts:13:5
  */
 export function chmodBestEffort(target: string, mode: number): void {
   try {
-    fs.chmodSync(target, mode);
+    ;
   } catch {
     // 权限设置失败（Windows 等）不影响功能
killedBy: io：原子写与损坏容错 writeJsonAtomic 的 fileMode 生效：0o444 只读落盘；缺省不得收紧权限
statusReason: expected 146 to be +0 // Object.is equality

[Killed] BlockStatement
lib/store/io.ts:24:88
  * rename 在同一文件系统内是原子操作，进程崩溃也不会留下半个 JSON。
  * fileMode 提供时写完设置文件权限（secrets.json 传 0o600）。
  */
-export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {
-  const dir = path.dirname(file);
-  fs.mkdirSync(dir, { recursive: true });
-  const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
-  fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
-  try {
-    fs.renameSync(tmp, file);
-  } catch (err) {
-    try {
-      fs.rmSync(tmp, { force: true });
-    } catch {
-      // 清理失败不掩盖原始错误
-    }
-    throw err;
-  }
-  if (fileMode !== undefined) chmodBestEffort(file, fileMode);
-}
+export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {}
 
 /**
killedBy: io：原子写与损坏容错 writeJsonAtomic 落盘内容正确且无临时文件残留
statusReason: ENOENT: no such file or directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-ulJPFt\data.json'

[Killed] BooleanLiteral
lib/store/io.ts:26:34
  */
 export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {
   const dir = path.dirname(file);
-  fs.mkdirSync(dir, { recursive: true });
+  fs.mkdirSync(dir, { recursive: false });
   const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
   fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
killedBy: io：原子写与损坏容错 writeJsonAtomic 落盘内容正确且无临时文件残留
statusReason: EEXIST: file already exists, mkdir 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-xR57aT'

[Killed] ObjectLiteral
lib/store/io.ts:26:21
  */
 export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {
   const dir = path.dirname(file);
-  fs.mkdirSync(dir, { recursive: true });
+  fs.mkdirSync(dir, {});
   const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
   fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
killedBy: DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
statusReason: EEXIST: file already exists, mkdir 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-bCsgBr\db-tool'

[Killed] StringLiteral
lib/store/io.ts:27:30
 export function writeJsonAtomic(file: string, value: unknown, fileMode?: number): void {
   const dir = path.dirname(file);
   fs.mkdirSync(dir, { recursive: true });
-  const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
+  const tmp = path.join(dir, ``);
   fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
   try {
killedBy: io：原子写与损坏容错 writeJsonAtomic 落盘内容正确且无临时文件残留
statusReason: EISDIR: illegal operation on a directory, open 'C:\Users\ASUS\AppData\Local\Temp\dsh-db-tool-test-guhbGu'

[Survived] StringLiteral
lib/store/io.ts:28:58
   const dir = path.dirname(file);
   fs.mkdirSync(dir, { recursive: true });
   const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
-  fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
+  fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + "", 'utf8');
   try {
     fs.renameSync(tmp, file);

[Killed] BlockStatement
lib/store/io.ts:29:7
   fs.mkdirSync(dir, { recursive: true });
   const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
   fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
-  try {
-    fs.renameSync(tmp, file);
-  } catch (err) {
+  try {} catch (err) {
     try {
       fs.rmSync(tmp, { force: true });
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 项目未授权该连接: c1 { code: 'U…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[Killed] CallExpression
lib/store/io.ts:30:5
   const tmp = path.join(dir, `.${path.basename(file)}.${process.pid}.${Date.now()}.tmp`);
   fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
   try {
-    fs.renameSync(tmp, file);
+    ;
   } catch (err) {
     try {
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 项目未授权该连接: c1 { code: 'U…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[NoCoverage] BlockStatement
lib/store/io.ts:31:17
   fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
   try {
     fs.renameSync(tmp, file);
-  } catch (err) {
-    try {
-      fs.rmSync(tmp, { force: true });
-    } catch {
-      // 清理失败不掩盖原始错误
-    }
-    throw err;
-  }
+  } catch (err) {}
   if (fileMode !== undefined) chmodBestEffort(file, fileMode);
 }

[NoCoverage] BlockStatement
lib/store/io.ts:32:9
   try {
     fs.renameSync(tmp, file);
   } catch (err) {
-    try {
-      fs.rmSync(tmp, { force: true });
-    } catch {
+    try {} catch {
       // 清理失败不掩盖原始错误
     }

[NoCoverage] BooleanLiteral
lib/store/io.ts:33:31
     fs.renameSync(tmp, file);
   } catch (err) {
     try {
-      fs.rmSync(tmp, { force: true });
+      fs.rmSync(tmp, { force: false });
     } catch {
       // 清理失败不掩盖原始错误

[Killed] ConditionalExpression
lib/store/io.ts:39:7
     }
     throw err;
   }
-  if (fileMode !== undefined) chmodBestEffort(file, fileMode);
+  if (false) chmodBestEffort(file, fileMode);
 }
 
killedBy: io：原子写与损坏容错 writeJsonAtomic 的 fileMode 生效：0o444 只读落盘；缺省不得收紧权限
statusReason: expected 146 to be +0 // Object.is equality

[Killed] CallExpression
lib/store/io.ts:39:31
     }
     throw err;
   }
-  if (fileMode !== undefined) chmodBestEffort(file, fileMode);
+  if (fileMode !== undefined) ;
 }
 
killedBy: io：原子写与损坏容错 writeJsonAtomic 的 fileMode 生效：0o444 只读落盘；缺省不得收紧权限
statusReason: expected 146 to be +0 // Object.is equality

[Killed] BlockStatement
lib/store/io.ts:48:59
  *  - 解析失败（文件损坏/被截断）→ 将原文件备份为 `<file>.bak` 后返回 fallback，
  *    让调用方以空数据继续工作，损坏现场保留在 .bak 供人工恢复。
  */
-export function readJson<T>(file: string, fallback: T): T {
-  if (!fs.existsSync(file)) return fallback;
-  try {
-    return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
-  } catch {
-    try {
-      fs.rmSync(`${file}.bak`, { force: true });
-      fs.renameSync(file, `${file}.bak`);
-    } catch {
-      // 备份失败也要继续重建
-    }
-    return fallback;
-  }
-}
+export function readJson<T>(file: string, fallback: T): T {}
 
killedBy: io：原子写与损坏容错 readJson：文件不存在返回 fallback
statusReason: expected undefined to deeply equal { fallback: true }

[Killed] ConditionalExpression
lib/store/io.ts:49:7
  *    让调用方以空数据继续工作，损坏现场保留在 .bak 供人工恢复。
  */
 export function readJson<T>(file: string, fallback: T): T {
-  if (!fs.existsSync(file)) return fallback;
+  if (true) return fallback;
   try {
     return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 项目未授权该连接: c1 { code: 'U…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/store/io.ts:49:7
  *    让调用方以空数据继续工作，损坏现场保留在 .bak 供人工恢复。
  */
 export function readJson<T>(file: string, fallback: T): T {
-  if (!fs.existsSync(file)) return fallback;
+  if (fs.existsSync(file)) return fallback;
   try {
     return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
killedBy: io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
lib/store/io.ts:50:7
  */
 export function readJson<T>(file: string, fallback: T): T {
   if (!fs.existsSync(file)) return fallback;
-  try {
-    return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
-  } catch {
+  try {} catch {
     try {
       fs.rmSync(`${file}.bak`, { force: true });
killedBy: DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'UNAUTHORIZED_PROJECT' }

[Killed] BlockStatement
lib/store/io.ts:52:11
   if (!fs.existsSync(file)) return fallback;
   try {
     return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
-  } catch {
-    try {
-      fs.rmSync(`${file}.bak`, { force: true });
-      fs.renameSync(file, `${file}.bak`);
-    } catch {
-      // 备份失败也要继续重建
-    }
-    return fallback;
-  }
+  } catch {}
 }
 
killedBy: io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
statusReason: Cannot read properties of undefined (reading 'connections')

[Killed] BlockStatement
lib/store/io.ts:53:9
   try {
     return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
   } catch {
-    try {
-      fs.rmSync(`${file}.bak`, { force: true });
-      fs.renameSync(file, `${file}.bak`);
-    } catch {
+    try {} catch {
       // 备份失败也要继续重建
     }
killedBy: io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
lib/store/io.ts:54:41
     return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
   } catch {
     try {
-      fs.rmSync(`${file}.bak`, { force: true });
+      fs.rmSync(`${file}.bak`, { force: false });
       fs.renameSync(file, `${file}.bak`);
     } catch {
killedBy: io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
lib/store/io.ts:54:32
     return JSON.parse(fs.readFileSync(file, 'utf8')) as T;
   } catch {
     try {
-      fs.rmSync(`${file}.bak`, { force: true });
+      fs.rmSync(`${file}.bak`, {});
       fs.renameSync(file, `${file}.bak`);
     } catch {
killedBy: io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
statusReason: expected false to be true // Object.is equality
