[Survived] ConditionalExpression
lib/manager.ts:555:39
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === 'object' && true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] EqualityOperator
lib/manager.ts:555:14
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r !== 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:555:27
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === "" && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] EqualityOperator
lib/manager.ts:555:39
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation !== true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BooleanLiteral
lib/manager.ts:555:79
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === false)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BooleanLiteral
lib/manager.ts:558:9
-       ok: false,
+       ok: true,
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] ObjectLiteral
lib/manager.ts:557:25
-     return JSON.stringify({
-       ok: false,
-       code: 'NEEDS_CONFIRMATION',
-       ...nc,
-       hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
-     }, null, 2);
+     return JSON.stringify({}, null, 2);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] StringLiteral
lib/manager.ts:559:11
-       code: 'NEEDS_CONFIRMATION',
+       code: "",
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] StringLiteral
lib/manager.ts:561:11
-       hint: `该操作危险（${nc.reason}）。请先向用户说明并征得确认，用户同意后携带 challenge_id=${nc.challengeId} 重试同一语句；challenge 一次性、5 分钟内有效、绑定本语句。`,
+       hint: ``,
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] BlockStatement
lib/manager.ts:325:34
-     async dispose(): Promise<void> {
-       this.disposed = true;
-       this.challenges.dispose();
-       const pending = [...this.adapterCache.values()];
-       this.adapterCache.clear();
-       for (const p of pending) {
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
-           // 缓存里的加载失败项直接忽略
-         }
-       }
-     }
+     async dispose(): Promise<void> {}
Ran all tests for this mutant.

[Survived] BooleanLiteral
lib/manager.ts:326:21
-       this.disposed = true;
+       this.disposed = false;
Ran all tests for this mutant.

[Survived] CallExpression
lib/manager.ts:327:5
-       this.challenges.dispose();
+       ;
Ran all tests for this mutant.

[Survived] ArrayDeclaration
lib/manager.ts:328:21
-       const pending = [...this.adapterCache.values()];
+       const pending = [];
Ran all tests for this mutant.

[Survived] CallExpression
lib/manager.ts:329:5
-       this.adapterCache.clear();
+       ;
Ran all tests for this mutant.

[Survived] BlockStatement
lib/manager.ts:330:30
-       for (const p of pending) {
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
-           // 缓存里的加载失败项直接忽略
-         }
-       }
+       for (const p of pending) {}
Ran all tests for this mutant.

[Survived] BlockStatement
lib/manager.ts:331:11
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
+         try {} catch {
Ran all tests for this mutant.
