[Killed] BlockStatement
lib/store/grants.ts:22:28
 export class GrantStore {
   private readonly file: string;
 
-  constructor(dir: string) {
-    this.file = path.join(dir, 'grants.json');
-  }
+  constructor(dir: string) {}
 
   private load(): GrantsFile {
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
lib/store/grants.ts:26:30
     this.file = path.join(dir, 'grants.json');
   }
 
-  private load(): GrantsFile {
-    return readJson<GrantsFile>(this.file, { grants: {} });
-  }
+  private load(): GrantsFile {}
 
   private save(data: GrantsFile): void {
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: Cannot read properties of undefined (reading 'grants')

[Killed] ObjectLiteral
lib/store/grants.ts:27:44
   }
 
   private load(): GrantsFile {
-    return readJson<GrantsFile>(this.file, { grants: {} });
+    return readJson<GrantsFile>(this.file, {});
   }
 
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: Cannot read properties of undefined (reading '/p1')

[Killed] BlockStatement
lib/store/grants.ts:30:40
     return readJson<GrantsFile>(this.file, { grants: {} });
   }
 
-  private save(data: GrantsFile): void {
-    writeJsonAtomic(this.file, data);
-  }
+  private save(data: GrantsFile): void {}
 
   /** 某项目的全部授权（不含 grantedAt，展示层无需时间戳） */
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 项目未授权该连接: c1 { code: 'U…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[Killed] CallExpression
lib/store/grants.ts:31:5
   }
 
   private save(data: GrantsFile): void {
-    writeJsonAtomic(this.file, data);
+    ;
   }
 
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] BlockStatement
lib/store/grants.ts:35:73
   }
 
   /** 某项目的全部授权（不含 grantedAt，展示层无需时间戳） */
-  grantsFor(projectKey: string): { connId: string; mode: AccessMode }[] {
-    return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
-  }
+  grantsFor(projectKey: string): { connId: string; mode: AccessMode }[] {}
 
   /** 授权或改授权（同连接重复授权视为更新模式） */
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected undefined to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] ArrowFunction
lib/store/grants.ts:36:55
 
   /** 某项目的全部授权（不含 grantedAt，展示层无需时间戳） */
   grantsFor(projectKey: string): { connId: string; mode: AccessMode }[] {
-    return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
+    return (this.load().grants[projectKey] ?? []).map(() => undefined);
   }
 
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ null ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] LogicalOperator
lib/store/grants.ts:36:13
 
   /** 某项目的全部授权（不含 grantedAt，展示层无需时间戳） */
   grantsFor(projectKey: string): { connId: string; mode: AccessMode }[] {
-    return (this.load().grants[projectKey] ?? []).map(({ connId, mode }) => ({ connId, mode }));
+    return (this.load().grants[projectKey] && []).map(({ connId, mode }) => ({ connId, mode }));
   }
 
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] BlockStatement
lib/store/grants.ts:40:69
   }
 
   /** 授权或改授权（同连接重复授权视为更新模式） */
-  grant(projectKey: string, connId: string, mode: AccessMode): void {
-    const data = this.load();
-    const list = data.grants[projectKey] ?? [];
-    const existing = list.find((g) => g.connId === connId);
-    if (existing) {
-      existing.mode = mode;
-      existing.grantedAt = new Date().toISOString();
-    } else {
-      list.push({ connId, mode, grantedAt: new Date().toISOString() });
-    }
-    data.grants[projectKey] = list;
-    this.save(data);
-  }
+  grant(projectKey: string, connId: string, mode: AccessMode): void {}
 
   /** 撤销某项目对某连接的授权。不存在时静默返回 */
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 项目未授权该连接: c1 { code: 'U…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[Killed] LogicalOperator
lib/store/grants.ts:42:18
   /** 授权或改授权（同连接重复授权视为更新模式） */
   grant(projectKey: string, connId: string, mode: AccessMode): void {
     const data = this.load();
-    const list = data.grants[projectKey] ?? [];
+    const list = data.grants[projectKey] && [];
     const existing = list.find((g) => g.connId === connId);
     if (existing) {
killedBy: fenced 校验 跨站 Origin → 403 FORBIDDEN
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
lib/store/grants.ts:43:39
   grant(projectKey: string, connId: string, mode: AccessMode): void {
     const data = this.load();
     const list = data.grants[projectKey] ?? [];
-    const existing = list.find((g) => g.connId === connId);
+    const existing = list.find((g) => false);
     if (existing) {
       existing.mode = mode;
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ { connId: 'c1', mode: 'rw' }, …(1) ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] ArrowFunction
lib/store/grants.ts:43:32
   grant(projectKey: string, connId: string, mode: AccessMode): void {
     const data = this.load();
     const list = data.grants[projectKey] ?? [];
-    const existing = list.find((g) => g.connId === connId);
+    const existing = list.find(() => undefined);
     if (existing) {
       existing.mode = mode;
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ { connId: 'c1', mode: 'rw' }, …(1) ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] ConditionalExpression
lib/store/grants.ts:44:9
     const data = this.load();
     const list = data.grants[projectKey] ?? [];
     const existing = list.find((g) => g.connId === connId);
-    if (existing) {
+    if (false) {
       existing.mode = mode;
       existing.grantedAt = new Date().toISOString();
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ { connId: 'c1', mode: 'rw' }, …(1) ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] BlockStatement
lib/store/grants.ts:44:19
     const data = this.load();
     const list = data.grants[projectKey] ?? [];
     const existing = list.find((g) => g.connId === connId);
-    if (existing) {
-      existing.mode = mode;
-      existing.grantedAt = new Date().toISOString();
-    } else {
+    if (existing) {} else {
       list.push({ connId, mode, grantedAt: new Date().toISOString() });
     }
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [ { connId: 'c1', mode: 'rw' } ] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] BlockStatement
lib/store/grants.ts:47:12
     if (existing) {
       existing.mode = mode;
       existing.grantedAt = new Date().toISOString();
-    } else {
-      list.push({ connId, mode, grantedAt: new Date().toISOString() });
-    }
+    } else {}
     data.grants[projectKey] = list;
     this.save(data);
killedBy: DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
statusReason: expected DbToolError: 项目未授权该连接: c1 { code: 'U…' } to match object { code: 'READ_ONLY' }
(1 matching property omitted from actual)

[Killed] CallExpression
lib/store/grants.ts:51:5
       list.push({ connId, mode, grantedAt: new Date().toISOString() });
     }
     data.grants[projectKey] = list;
-    this.save(data);
+    ;
   }
 
killedBy: 连接管理与授权路由 grants PUT/GET/DELETE
statusReason: expected [] to deeply equal [ { connId: 'c1', mode: 'ro' } ]

[Killed] BlockStatement
lib/store/grants.ts:55:52
   }
 
   /** 撤销某项目对某连接的授权。不存在时静默返回 */
-  revoke(projectKey: string, connId: string): void {
-    const data = this.load();
-    const list = data.grants[projectKey];
-    if (!list) return;
-    const next = list.filter((g) => g.connId !== connId);
-    if (next.length === list.length) return;
-    if (next.length === 0) delete data.grants[projectKey];
-    else data.grants[projectKey] = next;
-    this.save(data);
-  }
+  revoke(projectKey: string, connId: string): void {}
 
   /** 检查授权模式；未授权返回 undefined（ro < rw，rw 覆盖 ro） */
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected 'ro' to be undefined

[Killed] BooleanLiteral
lib/store/grants.ts:58:9
   revoke(projectKey: string, connId: string): void {
     const data = this.load();
     const list = data.grants[projectKey];
-    if (!list) return;
+    if (list) return;
     const next = list.filter((g) => g.connId !== connId);
     if (next.length === list.length) return;
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected 'ro' to be undefined

[Killed] ConditionalExpression
lib/store/grants.ts:58:9
   revoke(projectKey: string, connId: string): void {
     const data = this.load();
     const list = data.grants[projectKey];
-    if (!list) return;
+    if (false) return;
     const next = list.filter((g) => g.connId !== connId);
     if (next.length === list.length) return;
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ArrowFunction
lib/store/grants.ts:59:30
     const data = this.load();
     const list = data.grants[projectKey];
     if (!list) return;
-    const next = list.filter((g) => g.connId !== connId);
+    const next = list.filter(() => undefined);
     if (next.length === list.length) return;
     if (next.length === 0) delete data.grants[projectKey];
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] ConditionalExpression
lib/store/grants.ts:59:37
     const data = this.load();
     const list = data.grants[projectKey];
     if (!list) return;
-    const next = list.filter((g) => g.connId !== connId);
+    const next = list.filter((g) => false);
     if (next.length === list.length) return;
     if (next.length === 0) delete data.grants[projectKey];
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] EqualityOperator
lib/store/grants.ts:60:9
     const list = data.grants[projectKey];
     if (!list) return;
     const next = list.filter((g) => g.connId !== connId);
-    if (next.length === list.length) return;
+    if (next.length !== list.length) return;
     if (next.length === 0) delete data.grants[projectKey];
     else data.grants[projectKey] = next;
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected 'ro' to be undefined

[Killed] ConditionalExpression
lib/store/grants.ts:60:9
     const list = data.grants[projectKey];
     if (!list) return;
     const next = list.filter((g) => g.connId !== connId);
-    if (next.length === list.length) return;
+    if (true) return;
     if (next.length === 0) delete data.grants[projectKey];
     else data.grants[projectKey] = next;
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected 'ro' to be undefined

[Killed] ConditionalExpression
lib/store/grants.ts:61:9
     if (!list) return;
     const next = list.filter((g) => g.connId !== connId);
     if (next.length === list.length) return;
-    if (next.length === 0) delete data.grants[projectKey];
+    if (true) delete data.grants[projectKey];
     else data.grants[projectKey] = next;
     this.save(data);
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] EqualityOperator
lib/store/grants.ts:61:9
     if (!list) return;
     const next = list.filter((g) => g.connId !== connId);
     if (next.length === list.length) return;
-    if (next.length === 0) delete data.grants[projectKey];
+    if (next.length !== 0) delete data.grants[projectKey];
     else data.grants[projectKey] = next;
     this.save(data);
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] CallExpression
lib/store/grants.ts:63:5
     if (next.length === list.length) return;
     if (next.length === 0) delete data.grants[projectKey];
     else data.grants[projectKey] = next;
-    this.save(data);
+    ;
   }
 
killedBy: GrantStore revoke 撤销后不可见；撤销不存在者静默
statusReason: expected 'ro' to be undefined

[Killed] BlockStatement
lib/store/grants.ts:67:69
   }
 
   /** 检查授权模式；未授权返回 undefined（ro < rw，rw 覆盖 ro） */
-  check(projectKey: string, connId: string): AccessMode | undefined {
-    const modes = (this.load().grants[projectKey] ?? [])
-      .filter((g) => g.connId === connId)
-      .map((g) => g.mode);
-    if (modes.includes('rw')) return 'rw';
-    return modes.includes('ro') ? 'ro' : undefined;
-  }
+  check(projectKey: string, connId: string): AccessMode | undefined {}
 
   /** 级联清理：删除某连接在全项目范围的授权（由 ConnectionStore.remove 调用） */
killedBy: GrantStore grant 后 grantsFor/check 可见
statusReason: expected undefined to be 'ro' // Object.is equality

[Killed] MethodExpression
lib/store/grants.ts:68:19
 
   /** 检查授权模式；未授权返回 undefined（ro < rw，rw 覆盖 ro） */
   check(projectKey: string, connId: string): AccessMode | undefined {
-    const modes = (this.load().grants[projectKey] ?? [])
-      .filter((g) => g.connId === connId)
+    const modes = this.load().grants[projectKey] ?? []
       .map((g) => g.mode);
     if (modes.includes('rw')) return 'rw';
killedBy: DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
statusReason: expected DbToolError: 连接不存在: nope { code: 'NO…' } to match object { code: 'UNAUTHORIZED_PROJECT' }
(1 matching property omitted from actual)

[Killed] LogicalOperator
lib/store/grants.ts:68:20
 
   /** 检查授权模式；未授权返回 undefined（ro < rw，rw 覆盖 ro） */
   check(projectKey: string, connId: string): AccessMode | undefined {
-    const modes = (this.load().grants[projectKey] ?? [])
+    const modes = (this.load().grants[projectKey] && [])
       .filter((g) => g.connId === connId)
       .map((g) => g.mode);
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
lib/store/grants.ts:69:22
   /** 检查授权模式；未授权返回 undefined（ro < rw，rw 覆盖 ro） */
   check(projectKey: string, connId: string): AccessMode | undefined {
     const modes = (this.load().grants[projectKey] ?? [])
-      .filter((g) => g.connId === connId)
+      .filter((g) => true)
       .map((g) => g.mode);
     if (modes.includes('rw')) return 'rw';
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected 'rw' to be undefined

[Killed] ArrowFunction
lib/store/grants.ts:69:15
   /** 检查授权模式；未授权返回 undefined（ro < rw，rw 覆盖 ro） */
   check(projectKey: string, connId: string): AccessMode | undefined {
     const modes = (this.load().grants[projectKey] ?? [])
-      .filter((g) => g.connId === connId)
+      .filter(() => undefined)
       .map((g) => g.mode);
     if (modes.includes('rw')) return 'rw';
killedBy: GrantStore grant 后 grantsFor/check 可见
statusReason: expected undefined to be 'ro' // Object.is equality

[Killed] ArrowFunction
lib/store/grants.ts:70:12
   check(projectKey: string, connId: string): AccessMode | undefined {
     const modes = (this.load().grants[projectKey] ?? [])
       .filter((g) => g.connId === connId)
-      .map((g) => g.mode);
+      .map(() => undefined);
     if (modes.includes('rw')) return 'rw';
     return modes.includes('ro') ? 'ro' : undefined;
killedBy: GrantStore grant 后 grantsFor/check 可见
statusReason: expected undefined to be 'ro' // Object.is equality

[Killed] ConditionalExpression
lib/store/grants.ts:71:9
     const modes = (this.load().grants[projectKey] ?? [])
       .filter((g) => g.connId === connId)
       .map((g) => g.mode);
-    if (modes.includes('rw')) return 'rw';
+    if (true) return 'rw';
     return modes.includes('ro') ? 'ro' : undefined;
   }
killedBy: DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
statusReason: promise resolved "{ columns: [ 'answer' ], …(2) }" instead of rejecting

[Killed] ConditionalExpression
lib/store/grants.ts:71:9
     const modes = (this.load().grants[projectKey] ?? [])
       .filter((g) => g.connId === connId)
       .map((g) => g.mode);
-    if (modes.includes('rw')) return 'rw';
+    if (false) return 'rw';
     return modes.includes('ro') ? 'ro' : undefined;
   }
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] StringLiteral
lib/store/grants.ts:72:35
       .filter((g) => g.connId === connId)
       .map((g) => g.mode);
     if (modes.includes('rw')) return 'rw';
-    return modes.includes('ro') ? 'ro' : undefined;
+    return modes.includes('ro') ? "" : undefined;
   }
 
killedBy: GrantStore grant 后 grantsFor/check 可见
statusReason: expected '' to be 'ro' // Object.is equality

[Killed] BlockStatement
lib/store/grants.ts:76:36
   }
 
   /** 级联清理：删除某连接在全项目范围的授权（由 ConnectionStore.remove 调用） */
-  removeConn(connId: string): void {
-    const data = this.load();
-    let dirty = false;
-    for (const key of Object.keys(data.grants)) {
-      const list = data.grants[key];
-      if (!list) continue;
-      const next = list.filter((g) => g.connId !== connId);
-      if (next.length !== list.length) {
-        dirty = true;
-        if (next.length === 0) delete data.grants[key];
-        else data.grants[key] = next;
-      }
-    }
-    if (dirty) this.save(data);
-  }
+  removeConn(connId: string): void {}
 }
 
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] BooleanLiteral
lib/store/grants.ts:78:17
   /** 级联清理：删除某连接在全项目范围的授权（由 ConnectionStore.remove 调用） */
   removeConn(connId: string): void {
     const data = this.load();
-    let dirty = false;
+    let dirty = true;
     for (const key of Object.keys(data.grants)) {
       const list = data.grants[key];
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected '{\n  "grants": {\n    "k1": [],\n    …' to be '{"grants":{"k1":[],"k2":[{"connId":"a…' // Object.is equality

[Killed] BlockStatement
lib/store/grants.ts:79:49
   removeConn(connId: string): void {
     const data = this.load();
     let dirty = false;
-    for (const key of Object.keys(data.grants)) {
-      const list = data.grants[key];
-      if (!list) continue;
-      const next = list.filter((g) => g.connId !== connId);
-      if (next.length !== list.length) {
-        dirty = true;
-        if (next.length === 0) delete data.grants[key];
-        else data.grants[key] = next;
-      }
-    }
+    for (const key of Object.keys(data.grants)) {}
     if (dirty) this.save(data);
   }
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected 'ro' to be undefined

[Killed] BooleanLiteral
lib/store/grants.ts:81:11
     let dirty = false;
     for (const key of Object.keys(data.grants)) {
       const list = data.grants[key];
-      if (!list) continue;
+      if (list) continue;
       const next = list.filter((g) => g.connId !== connId);
       if (next.length !== list.length) {
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] ConditionalExpression
lib/store/grants.ts:81:11
     let dirty = false;
     for (const key of Object.keys(data.grants)) {
       const list = data.grants[key];
-      if (!list) continue;
+      if (true) continue;
       const next = list.filter((g) => g.connId !== connId);
       if (next.length !== list.length) {
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] MethodExpression
lib/store/grants.ts:82:20
     for (const key of Object.keys(data.grants)) {
       const list = data.grants[key];
       if (!list) continue;
-      const next = list.filter((g) => g.connId !== connId);
+      const next = list;
       if (next.length !== list.length) {
         dirty = true;
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] ConditionalExpression
lib/store/grants.ts:82:39
     for (const key of Object.keys(data.grants)) {
       const list = data.grants[key];
       if (!list) continue;
-      const next = list.filter((g) => g.connId !== connId);
+      const next = list.filter((g) => false);
       if (next.length !== list.length) {
         dirty = true;
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected '{\n  "grants": {\n    "k1": []\n  }\n…' to be '{"grants":{"k1":[],"k2":[{"connId":"a…' // Object.is equality

[Killed] ConditionalExpression
lib/store/grants.ts:83:11
       const list = data.grants[key];
       if (!list) continue;
       const next = list.filter((g) => g.connId !== connId);
-      if (next.length !== list.length) {
+      if (false) {
         dirty = true;
         if (next.length === 0) delete data.grants[key];
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] BlockStatement
lib/store/grants.ts:83:40
       const list = data.grants[key];
       if (!list) continue;
       const next = list.filter((g) => g.connId !== connId);
-      if (next.length !== list.length) {
-        dirty = true;
-        if (next.length === 0) delete data.grants[key];
-        else data.grants[key] = next;
-      }
+      if (next.length !== list.length) {}
     }
     if (dirty) this.save(data);
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] BooleanLiteral
lib/store/grants.ts:84:17
       if (!list) continue;
       const next = list.filter((g) => g.connId !== connId);
       if (next.length !== list.length) {
-        dirty = true;
+        dirty = false;
         if (next.length === 0) delete data.grants[key];
         else data.grants[key] = next;
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] ConditionalExpression
lib/store/grants.ts:85:13
       const next = list.filter((g) => g.connId !== connId);
       if (next.length !== list.length) {
         dirty = true;
-        if (next.length === 0) delete data.grants[key];
+        if (true) delete data.grants[key];
         else data.grants[key] = next;
       }
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected undefined to be 'rw' // Object.is equality

[Killed] EqualityOperator
lib/store/grants.ts:85:13
       const next = list.filter((g) => g.connId !== connId);
       if (next.length !== list.length) {
         dirty = true;
-        if (next.length === 0) delete data.grants[key];
+        if (next.length !== 0) delete data.grants[key];
         else data.grants[key] = next;
       }
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]

[Killed] ConditionalExpression
lib/store/grants.ts:89:9
         else data.grants[key] = next;
       }
     }
-    if (dirty) this.save(data);
+    if (true) this.save(data);
   }
 }
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected '{\n  "grants": {\n    "k1": [],\n    …' to be '{"grants":{"k1":[],"k2":[{"connId":"a…' // Object.is equality

[Killed] ConditionalExpression
lib/store/grants.ts:89:9
         else data.grants[key] = next;
       }
     }
-    if (dirty) this.save(data);
+    if (false) this.save(data);
   }
 }
killedBy: GrantStore 无变化操作不落盘：revoke 未命中 / removeConn 未命中时文件字节保持原样
statusReason: expected [ 'k1', 'k2' ] to deeply equal [ 'k1' ]
