[Killed] ArithmeticOperator
lib/store/audit.ts:49:18
     if (!fs.existsSync(this.file)) return [];
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
-    for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+    for (let i = lines.length + 1; i >= 0 && out.length < n; i--) {
       const line = lines[i]?.trim();
       if (!line) continue;
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0
