[Killed] BlockStatement
lib/store/normalize.ts:17:56
  */
 import * as path from 'node:path';
 
-export function normalizeProjectKey(p: string): string {
-  let key = path.resolve(p).replace(/\\/g, '/');
-  key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
-  if (key.length > 1) key = key.replace(/\/+$/, '');
-  return key;
-}
+export function normalizeProjectKey(p: string): string {}
 
killedBy: DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
statusReason: promise resolved "{ columns: [ 'answer' ], …(2) }" instead of rejecting

[Killed] MethodExpression
lib/store/normalize.ts:19:60
 
 export function normalizeProjectKey(p: string): string {
   let key = path.resolve(p).replace(/\\/g, '/');
-  key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
+  key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toUpperCase()}:`);
   if (key.length > 1) key = key.replace(/\/+$/, '');
   return key;
killedBy: normalizeProjectKey 同一目录不同写法归一化为同一 key（分隔符/尾分隔符）
statusReason: expected 'C:/Code/Proj' to be 'c:/Code/Proj' // Object.is equality

[Killed] ArrowFunction
lib/store/normalize.ts:19:34
 
 export function normalizeProjectKey(p: string): string {
   let key = path.resolve(p).replace(/\\/g, '/');
-  key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
+  key = key.replace(/^([A-Z]):/, () => undefined);
   if (key.length > 1) key = key.replace(/\/+$/, '');
   return key;
killedBy: DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
statusReason: 项目未授权该连接: c1

[Killed] EqualityOperator
lib/store/normalize.ts:20:7
 export function normalizeProjectKey(p: string): string {
   let key = path.resolve(p).replace(/\\/g, '/');
   key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
-  if (key.length > 1) key = key.replace(/\/+$/, '');
+  if (key.length <= 1) key = key.replace(/\/+$/, '');
   return key;
 }
killedBy: normalizeProjectKey 盘符根目录去尾：C:\ → c:（尾分隔符必须移除）
statusReason: expected 'c:/' to be 'c:' // Object.is equality

[Killed] ConditionalExpression
lib/store/normalize.ts:20:7
 export function normalizeProjectKey(p: string): string {
   let key = path.resolve(p).replace(/\\/g, '/');
   key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
-  if (key.length > 1) key = key.replace(/\/+$/, '');
+  if (false) key = key.replace(/\/+$/, '');
   return key;
 }
killedBy: normalizeProjectKey 盘符根目录去尾：C:\ → c:（尾分隔符必须移除）
statusReason: expected 'c:/' to be 'c:' // Object.is equality
