[Killed] BlockStatement
lib/store/audit.ts:30:28
 export class AuditLog {
   private readonly file: string;
 
-  constructor(dir: string) {
-    this.file = path.join(dir, 'audit.jsonl');
-  }
+  constructor(dir: string) {}
 
   /** 追加一条审计；ts 省略时自动填充当前 UTC 时间 */
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
lib/store/audit.ts:31:32
   private readonly file: string;
 
   constructor(dir: string) {
-    this.file = path.join(dir, 'audit.jsonl');
+    this.file = path.join(dir, "");
   }
 
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: EISDIR: illegal operation on a directory, read

[Killed] BlockStatement
lib/store/audit.ts:35:46
   }
 
   /** 追加一条审计；ts 省略时自动填充当前 UTC 时间 */
-  append(entry: AuditEntryInput): AuditEntry {
-    const full: AuditEntry = { ...entry, ts: entry.ts ?? new Date().toISOString() };
-    fs.appendFileSync(this.file, JSON.stringify(full) + '\n', 'utf8');
-    return full;
-  }
+  append(entry: AuditEntryInput): AuditEntry {}
 
   /** 最近 n 条（时间正序）。文件不存在返回空数组；损坏行跳过。
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected 0 to be greater than or equal to 1

[Killed] LogicalOperator
lib/store/audit.ts:36:46
 
   /** 追加一条审计；ts 省略时自动填充当前 UTC 时间 */
   append(entry: AuditEntryInput): AuditEntry {
-    const full: AuditEntry = { ...entry, ts: entry.ts ?? new Date().toISOString() };
+    const full: AuditEntry = { ...entry, ts: entry.ts && new Date().toISOString() };
     fs.appendFileSync(this.file, JSON.stringify(full) + '\n', 'utf8');
     return full;
killedBy: AuditLog append 落盘为 JSONL，ts 省略时自动补当前时间
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
lib/store/audit.ts:36:30
 
   /** 追加一条审计；ts 省略时自动填充当前 UTC 时间 */
   append(entry: AuditEntryInput): AuditEntry {
-    const full: AuditEntry = { ...entry, ts: entry.ts ?? new Date().toISOString() };
+    const full: AuditEntry = {};
     fs.appendFileSync(this.file, JSON.stringify(full) + '\n', 'utf8');
     return full;
killedBy: DbToolService: 浏览与审计 危险确认与执行都留审计
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
lib/store/audit.ts:45:33
    *  设计取舍：tail 全量读入后取尾。审计日志不轮转（保留完整历史是审计语义），
    *  单用户桌面工具的量级（数十万行 ≈ 数十 MB）一次性读取在可接受范围；
    *  反向块读的复杂度不值得。若未来出现服务端长驻场景再优化。 */
-  tail(n: number): AuditEntry[] {
-    if (!fs.existsSync(this.file)) return [];
-    const lines = fs.readFileSync(this.file, 'utf8').split('\n');
-    const out: AuditEntry[] = [];
-    for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
-      const line = lines[i]?.trim();
-      if (!line) continue;
-      try {
-        out.push(JSON.parse(line) as AuditEntry);
-      } catch {
-        // 跳过损坏行
-      }
-    }
-    return out.reverse();
-  }
+  tail(n: number): AuditEntry[] {}
 }
 
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/store/audit.ts:46:9
    *  单用户桌面工具的量级（数十万行 ≈ 数十 MB）一次性读取在可接受范围；
    *  反向块读的复杂度不值得。若未来出现服务端长驻场景再优化。 */
   tail(n: number): AuditEntry[] {
-    if (!fs.existsSync(this.file)) return [];
+    if (false) return [];
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
killedBy: fenced 校验 无 Origin/Referer（本地脚本）放行
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/store/audit.ts:46:9
    *  单用户桌面工具的量级（数十万行 ≈ 数十 MB）一次性读取在可接受范围；
    *  反向块读的复杂度不值得。若未来出现服务端长驻场景再优化。 */
   tail(n: number): AuditEntry[] {
-    if (!fs.existsSync(this.file)) return [];
+    if (true) return [];
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
killedBy: 端到端全链路（mock 适配器） 连接(密码入 secrets)→授权→state→query→危险→challenge 重放拒→确认成功→审计
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/store/audit.ts:49:36
     if (!fs.existsSync(this.file)) return [];
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
-    for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+    for (let i = lines.length - 1; i >= 0 || out.length < n; i--) {
       const line = lines[i]?.trim();
       if (!line) continue;
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
lib/store/audit.ts:49:36
     if (!fs.existsSync(this.file)) return [];
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
-    for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
+    for (let i = lines.length - 1; true && out.length < n; i--) {
       const line = lines[i]?.trim();
       if (!line) continue;
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] OptionalChaining
lib/store/audit.ts:50:20
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
     for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
-      const line = lines[i]?.trim();
+      const line = lines[i].trim();
       if (!line) continue;
       try {
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
lib/store/audit.ts:50:20
     const lines = fs.readFileSync(this.file, 'utf8').split('\n');
     const out: AuditEntry[] = [];
     for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
-      const line = lines[i]?.trim();
+      const line = lines[i];
       if (!line) continue;
       try {
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
lib/store/audit.ts:51:11
     const out: AuditEntry[] = [];
     for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
       const line = lines[i]?.trim();
-      if (!line) continue;
+      if (false) continue;
       try {
         out.push(JSON.parse(line) as AuditEntry);
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
lib/store/audit.ts:51:11
     const out: AuditEntry[] = [];
     for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
       const line = lines[i]?.trim();
-      if (!line) continue;
+      if (line) continue;
       try {
         out.push(JSON.parse(line) as AuditEntry);
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
lib/store/audit.ts:52:11
     for (let i = lines.length - 1; i >= 0 && out.length < n; i--) {
       const line = lines[i]?.trim();
       if (!line) continue;
-      try {
-        out.push(JSON.parse(line) as AuditEntry);
-      } catch {
+      try {} catch {
         // 跳过损坏行
       }
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] CallExpression
lib/store/audit.ts:53:9
       const line = lines[i]?.trim();
       if (!line) continue;
       try {
-        out.push(JSON.parse(line) as AuditEntry);
+        ;
       } catch {
         // 跳过损坏行
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
lib/store/audit.ts:58:12
         // 跳过损坏行
       }
     }
-    return out.reverse();
+    return out;
   }
 }
killedBy: 业务路由与确认流程 GET /api/audit 与 /api/state
statusReason: expected 0 to be greater than 0
