[Killed] BlockStatement
lib/store/secrets.ts:28:28
 export class SecretsBox {
   private readonly file: string;
 
-  constructor(dir: string) {
-    this.file = path.join(dir, 'secrets.json');
-  }
+  constructor(dir: string) {}
 
   private load(): SecretsFile {
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
lib/store/secrets.ts:32:31
     this.file = path.join(dir, 'secrets.json');
   }
 
-  private load(): SecretsFile {
-    return readJson<SecretsFile>(this.file, { secrets: {} });
-  }
+  private load(): SecretsFile {}
 
   private save(data: SecretsFile): void {
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: Cannot read properties of undefined (reading 'secrets')

[Killed] BlockStatement
lib/store/secrets.ts:36:41
     return readJson<SecretsFile>(this.file, { secrets: {} });
   }
 
-  private save(data: SecretsFile): void {
-    writeJsonAtomic(this.file, data, FILE_MODE);
-  }
+  private save(data: SecretsFile): void {}
 
   /** 读取某连接的机密（浅拷贝）。不存在返回 undefined。 */
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: expected undefined to deeply equal { password: 'q' }

[Killed] CallExpression
lib/store/secrets.ts:37:5
   }
 
   private save(data: SecretsFile): void {
-    writeJsonAtomic(this.file, data, FILE_MODE);
+    ;
   }
 
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: expected undefined to deeply equal { password: 'q' }

[Killed] BlockStatement
lib/store/secrets.ts:41:48
   }
 
   /** 读取某连接的机密（浅拷贝）。不存在返回 undefined。 */
-  get(connId: string): SecretEntry | undefined {
-    const entry = this.load().secrets[connId];
-    return entry ? { ...entry } : undefined;
-  }
+  get(connId: string): SecretEntry | undefined {}
 
   /** 合并写入机密（保留未提及的旧键） */
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: expected undefined to deeply equal { password: 'q' }

[Killed] BlockStatement
lib/store/secrets.ts:47:49
   }
 
   /** 合并写入机密（保留未提及的旧键） */
-  set(connId: string, patch: SecretEntry): void {
-    const data = this.load();
-    data.secrets[connId] = { ...(data.secrets[connId] ?? {}), ...patch };
-    this.save(data);
-  }
+  set(connId: string, patch: SecretEntry): void {}
 
   /** 删除某连接的全部机密。不存在时静默返回。 */
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: expected undefined to deeply equal { password: 'q' }

[Killed] LogicalOperator
lib/store/secrets.ts:49:34
   /** 合并写入机密（保留未提及的旧键） */
   set(connId: string, patch: SecretEntry): void {
     const data = this.load();
-    data.secrets[connId] = { ...(data.secrets[connId] ?? {}), ...patch };
+    data.secrets[connId] = { ...(data.secrets[connId] && {}), ...patch };
     this.save(data);
   }
killedBy: SecretsBox set 合并写入并保留旧键，get/delete 正常
statusReason: expected { url: 'mysql://u:p1@h/db' } to deeply equal { password: 'p1', …(1) }

[Killed] CallExpression
lib/store/secrets.ts:50:5
   set(connId: string, patch: SecretEntry): void {
     const data = this.load();
     data.secrets[connId] = { ...(data.secrets[connId] ?? {}), ...patch };
-    this.save(data);
+    ;
   }
 
killedBy: io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）
statusReason: expected undefined to deeply equal { password: 'q' }

[Killed] BlockStatement
lib/store/secrets.ts:54:32
   }
 
   /** 删除某连接的全部机密。不存在时静默返回。 */
-  delete(connId: string): void {
-    const data = this.load();
-    if (!(connId in data.secrets)) return;
-    delete data.secrets[connId];
-    this.save(data);
-  }
+  delete(connId: string): void {}
 }
 
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected { Object (url) } to be undefined

[Killed] BooleanLiteral
lib/store/secrets.ts:56:9
   /** 删除某连接的全部机密。不存在时静默返回。 */
   delete(connId: string): void {
     const data = this.load();
-    if (!(connId in data.secrets)) return;
+    if (connId in data.secrets) return;
     delete data.secrets[connId];
     this.save(data);
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected { Object (url) } to be undefined

[Killed] ConditionalExpression
lib/store/secrets.ts:56:9
   /** 删除某连接的全部机密。不存在时静默返回。 */
   delete(connId: string): void {
     const data = this.load();
-    if (!(connId in data.secrets)) return;
+    if (true) return;
     delete data.secrets[connId];
     this.save(data);
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected { Object (url) } to be undefined

[Killed] CallExpression
lib/store/secrets.ts:58:5
     const data = this.load();
     if (!(connId in data.secrets)) return;
     delete data.secrets[connId];
-    this.save(data);
+    ;
   }
 }
killedBy: ConnectionStore remove 级联删除 secrets 与全部项目的 grants
statusReason: expected { Object (url) } to be undefined
