[Survived] EqualityOperator
lib/guard/index.ts:197:9
-       if (interval > 0) {
+       if (interval <= 0) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] ObjectLiteral
lib/guard/index.ts:212:19
-         ...(scope ? { connId: scope.connId, projectKey: scope.projectKey } : {}),
+         ...(scope ? {} : {}),
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
  and 11 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:223:9
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (this.nowFn() >= ch.expiresAt) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
  and 12 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:226:9
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (false) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:226:9
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (true && ch.connId !== scope?.connId) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:226:9
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (ch.connId === undefined && ch.connId !== scope?.connId) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:226:50
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (ch.connId !== undefined && ch.connId !== scope.connId) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 5 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:227:9
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (false) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:227:9
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (true && ch.projectKey !== scope?.projectKey) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] BlockStatement
lib/guard/index.ts:232:17
-     sweep(): void {
-       const now = this.nowFn();
-       for (const [id, ch] of this.map) {
-         if (now > ch.expiresAt) this.map.delete(id);
-       }
-     }
+     sweep(): void {}
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:227:9
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (ch.projectKey === undefined && ch.projectKey !== scope?.projectKey) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:235:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (true) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] ConditionalExpression
lib/guard/index.ts:235:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (false) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] BlockStatement
lib/guard/index.ts:234:38
-       for (const [id, ch] of this.map) {
-         if (now > ch.expiresAt) this.map.delete(id);
-       }
+       for (const [id, ch] of this.map) {}
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:235:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now >= ch.expiresAt) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] CallExpression
lib/guard/index.ts:235:31
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now > ch.expiresAt) ;
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:235:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now <= ch.expiresAt) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] OptionalChaining
lib/guard/index.ts:227:58
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (ch.projectKey !== undefined && ch.projectKey !== scope.projectKey) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 5 more tests!

[Survived] StringLiteral
lib/guard/index.ts:40:11
-     'find', 'findOne', 'count', 'countDocuments', 'estimatedDocumentCount',
+     'find', "", 'count', 'countDocuments', 'estimatedDocumentCount',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:40:22
-     'find', 'findOne', 'count', 'countDocuments', 'estimatedDocumentCount',
+     'find', 'findOne', "", 'countDocuments', 'estimatedDocumentCount',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:40:31
-     'find', 'findOne', 'count', 'countDocuments', 'estimatedDocumentCount',
+     'find', 'findOne', 'count', "", 'estimatedDocumentCount',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:40:49
-     'find', 'findOne', 'count', 'countDocuments', 'estimatedDocumentCount',
+     'find', 'findOne', 'count', 'countDocuments', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:41:3
-     'distinct', 'aggregate', 'listCollections', 'listIndexes',
+     "", 'aggregate', 'listCollections', 'listIndexes',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:41:15
-     'distinct', 'aggregate', 'listCollections', 'listIndexes',
+     'distinct', "", 'listCollections', 'listIndexes',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:41:28
-     'distinct', 'aggregate', 'listCollections', 'listIndexes',
+     'distinct', 'aggregate', "", 'listIndexes',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:41:47
-     'distinct', 'aggregate', 'listCollections', 'listIndexes',
+     'distinct', 'aggregate', 'listCollections', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:46:13
-     'insert', 'insertOne', 'insertMany',
+     'insert', "", 'insertMany',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:46:26
-     'insert', 'insertOne', 'insertMany',
+     'insert', 'insertOne', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:47:3
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     "", 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:47:16
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', "", 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:47:30
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', "", 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:47:44
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', "", 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:47:64
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', "", 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:47:81
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:48:3
-     'deleteOne',
+     "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:49:3
-     'createCollection', 'renameCollection', 'mapReduce',
+     "", 'renameCollection', 'mapReduce',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:49:23
-     'createCollection', 'renameCollection', 'mapReduce',
+     'createCollection', "", 'mapReduce',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:49:43
-     'createCollection', 'renameCollection', 'mapReduce',
+     'createCollection', 'renameCollection', "",
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/guard/index.ts:241:9
-       if (this.timer) {
+       if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/guard/index.ts:241:9
-       if (this.timer) {
+       if (false) {
Ran all tests for this mutant.

[Survived] CallExpression
lib/guard/index.ts:245:5
-       this.map.clear();
+       ;
Ran all tests for this mutant.

[NoCoverage] BlockStatement
lib/manager.ts:275:78
-       const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {
-         throw e instanceof DbToolError ? e : this.toDriverError(e);
-       });
+       const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {});

[NoCoverage] ConditionalExpression
lib/manager.ts:287:11
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             true ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] ConditionalExpression
lib/manager.ts:287:11
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             false ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] EqualityOperator
lib/manager.ts:287:11
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level !== 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] StringLiteral
lib/manager.ts:287:21
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level === "" ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] StringLiteral
lib/manager.ts:287:45
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level === 'error' ? console.error("", text) : console.log('[db-script]', text),

[NoCoverage] StringLiteral
lib/manager.ts:287:80
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level === 'error' ? console.error('[db-script]', text) : console.log("", text),

[NoCoverage] BlockStatement
lib/manager.ts:288:26
-           onTimeout: () => {
-             void sessionAdapter.close().catch(() => {});
-           },
+           onTimeout: () => {},

[NoCoverage] BlockStatement
lib/manager.ts:348:13
-       } catch {
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
-       }
+       } catch {}

[NoCoverage] StringLiteral
lib/manager.ts:349:29
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
+         throw new DbToolError("", `连接不存在: ${connId}`);

[NoCoverage] StringLiteral
lib/manager.ts:349:42
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
+         throw new DbToolError('NOT_FOUND', ``);

[NoCoverage] StringLiteral
lib/manager.ts:359:46
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (this.disposed) throw new DbToolError("", '服务已关闭');

[NoCoverage] StringLiteral
lib/manager.ts:359:66
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', "");

[NoCoverage] BlockStatement
lib/manager.ts:397:25
-         })().catch((e) => {
-           this.adapterCache.delete(cacheKey);
-           throw e instanceof DbToolError ? e : this.toDriverError(e);
-         });
+         })().catch((e) => {});

[NoCoverage] CallExpression
lib/manager.ts:398:9
-           this.adapterCache.delete(cacheKey);
+           ;

[NoCoverage] BooleanLiteral
lib/manager.ts:418:38
-       if (args.params !== undefined && !Array.isArray(args.params)) {
+       if (args.params !== undefined && Array.isArray(args.params)) {

[NoCoverage] BlockStatement
lib/manager.ts:418:67
-       if (args.params !== undefined && !Array.isArray(args.params)) {
-         throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
-       }
+       if (args.params !== undefined && !Array.isArray(args.params)) {}

[NoCoverage] StringLiteral
lib/manager.ts:419:29
-         throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
+         throw new DbToolError("", 'params 必须是数组（绑定参数）');

[NoCoverage] StringLiteral
lib/manager.ts:419:49
-         throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
+         throw new DbToolError('INVALID_ARGUMENT', "");

[NoCoverage] StringLiteral
lib/manager.ts:430:115
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? "" };

[NoCoverage] ConditionalExpression
lib/manager.ts:543:7
-         case 'schema': {
-           const conn = requireConn(connId);
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
-           return j(await service.databases(projectPath, conn));
-         }
+         case 'schema':

[NoCoverage] BlockStatement
lib/manager.ts:543:22
-         case 'schema': {
-           const conn = requireConn(connId);
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
-           return j(await service.databases(projectPath, conn));
-         }
+         case 'schema': {}

[NoCoverage] ConditionalExpression
lib/manager.ts:545:13
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+           if (true) return j(await service.schema(projectPath, conn, args.table, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:545:13
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+           if (false) return j(await service.schema(projectPath, conn, args.table, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:546:13
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
+           if (true) return j(await service.tables(projectPath, conn, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:546:13
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
+           if (false) return j(await service.tables(projectPath, conn, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:550:7
-         case 'preview': {
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database);
-           return j(r);
-         }
+         case 'preview':

[NoCoverage] BlockStatement
lib/manager.ts:550:23
-         case 'preview': {
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database);
-           return j(r);
-         }
+         case 'preview': {}

[NoCoverage] StringLiteral
lib/manager.ts:551:97
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database);
+           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, ""), args.limit, args.database);

[NoCoverage] StringLiteral
lib/manager.ts:564:54
-       const code = e instanceof DbToolError ? e.code : 'DRIVER_ERROR';
+       const code = e instanceof DbToolError ? e.code : "";

[NoCoverage] StringLiteral
lib/manager.ts:575:52
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === '') throw new DbToolError("", `缺少必填参数: ${label}`);

[NoCoverage] StringLiteral
lib/manager.ts:575:72
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', ``);

[Survived] StringLiteral
lib/manager.ts:202:37
-       const t = assertNonEmpty(table, 'table');
+       const t = assertNonEmpty(table, "");
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:224:43
-       const statement = assertNonEmpty(sql, 'sql');
+       const statement = assertNonEmpty(sql, "");
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 15 more tests!

[Survived] ArrowFunction
lib/manager.ts:232:21
-         rowsAffected: (r) => r.rowCount,
+         rowsAffected: () => undefined,
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 15 more tests!

[Survived] StringLiteral
lib/manager.ts:243:44
-       const stmt = assertNonEmpty(statement, 'statement');
+       const stmt = assertNonEmpty(statement, "");
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 13 more tests!

[Survived] ArrowFunction
lib/manager.ts:251:21
-         rowsAffected: (r) => r.affectedRows,
+         rowsAffected: () => undefined,
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 13 more tests!

[Survived] StringLiteral
lib/manager.ts:269:38
-       const src = assertNonEmpty(code, 'code');
+       const src = assertNonEmpty(code, "");
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 4 more tests!

[Survived] ObjectLiteral
lib/manager.ts:275:46
-       const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {
+       const sessionAdapter = await factory(rc, {}).catch((e: unknown) => {
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] ArrowFunction
lib/manager.ts:286:16
-           onLog: (level, text) =>
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+           onLog: () => undefined,
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] BooleanLiteral
lib/manager.ts:295:11
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION') {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:295:11
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (true) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:295:11
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (false) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:295:13
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(true)) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:295:13
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(false)) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:295:41
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(e instanceof DbToolError && true)) {
Tests ran:
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）

[Survived] LogicalOperator
lib/manager.ts:295:13
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(e instanceof DbToolError || e.code === 'NEEDS_CONFIRMATION')) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] EqualityOperator
lib/manager.ts:295:41
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(e instanceof DbToolError && e.code !== 'NEEDS_CONFIRMATION')) {
Tests ran:
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）

[Survived] StringLiteral
lib/manager.ts:295:52
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(e instanceof DbToolError && e.code === "")) {
Tests ran:
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    业务路由与确认流程 POST /api/script：正常脚本与 NEEDS_CONFIRMATION（message JSON 还原为扁平响应）

[Survived] ConditionalExpression
lib/manager.ts:298:11
-         if (e instanceof DbToolError) throw e;
+         if (false) throw e;
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] BlockStatement
lib/manager.ts:300:15
-       } finally {
-         await sessionAdapter.close().catch(() => {});
-       }
+       } finally {}
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:359:9
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (false) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] ConditionalExpression
lib/manager.ts:360:25
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || false) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] StringLiteral
lib/manager.ts:361:53
-         throw new DbToolError('UNAUTHORIZED_PROJECT', '业务操作需要 projectPath（匿名项目仅可管理连接）');
+         throw new DbToolError('UNAUTHORIZED_PROJECT', "");
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝

[Survived] StringLiteral
lib/manager.ts:360:48
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || projectPath.trim() === "Stryker was here!") {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] MethodExpression
lib/manager.ts:360:25
-       if (!projectPath || projectPath.trim() === '') {
+       if (!projectPath || projectPath === '') {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] StringLiteral
lib/manager.ts:365:62
-       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', `项目未授权该连接: ${connId}`);
+       if (!mode) throw new DbToolError('UNAUTHORIZED_PROJECT', ``);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:367:42
-         throw new DbToolError('READ_ONLY', '该连接对本项目为只读授权（ro），拒绝写操作');
+         throw new DbToolError('READ_ONLY', "");
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 危险确认与 challenge ro 连接对危险语句也先报 READ_ONLY（授权优先于 guard）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
