[Survived] BlockStatement
lib/manager.ts:374:61
-     private async dropAdapters(connId: string): Promise<void> {
-       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
-       for (const k of keys) {
-         const p = this.adapterCache.get(k);
-         this.adapterCache.delete(k);
-         if (!p) continue;
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
-           // 加载失败或已断开的旧实例直接忽略
-         }
-       }
-     }
+     private async dropAdapters(connId: string): Promise<void> {}
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] MethodExpression
lib/manager.ts:375:18
-       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+       const keys = [...this.adapterCache.keys()];
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] ArrayDeclaration
lib/manager.ts:375:18
-       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+       const keys = [].filter((k) => k.startsWith(`${connId}@mode=`));
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] ArrowFunction
lib/manager.ts:375:55
-       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+       const keys = [...this.adapterCache.keys()].filter(() => undefined);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] MethodExpression
lib/manager.ts:375:62
-       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+       const keys = [...this.adapterCache.keys()].filter((k) => k.endsWith(`${connId}@mode=`));
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:375:75
-       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(`${connId}@mode=`));
+       const keys = [...this.adapterCache.keys()].filter((k) => k.startsWith(``));
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BlockStatement
lib/manager.ts:376:27
-       for (const k of keys) {
-         const p = this.adapterCache.get(k);
-         this.adapterCache.delete(k);
-         if (!p) continue;
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
-           // 加载失败或已断开的旧实例直接忽略
-         }
-       }
+       for (const k of keys) {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] CallExpression
lib/manager.ts:378:7
-         this.adapterCache.delete(k);
+         ;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:379:11
-         if (!p) continue;
+         if (p) continue;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] ConditionalExpression
lib/manager.ts:379:11
-         if (!p) continue;
+         if (true) continue;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] ConditionalExpression
lib/manager.ts:379:11
-         if (!p) continue;
+         if (false) continue;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BlockStatement
lib/manager.ts:380:11
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
+         try {} catch {
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:390:22
-       const cacheKey = `${connId}@mode=${mode}`;
+       const cacheKey = ``;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 24 more tests!

[Survived] ConditionalExpression
lib/manager.ts:392:9
-       if (!p) {
+       if (true) {
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 24 more tests!

[Survived] CallExpression
lib/manager.ts:401:7
-         this.adapterCache.set(cacheKey, p);
+         ;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 15 more tests!

[Survived] ConditionalExpression
lib/manager.ts:418:9
-       if (args.params !== undefined && !Array.isArray(args.params)) {
+       if (false) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 26 more tests!

[Survived] ObjectLiteral
lib/manager.ts:426:37
-         const scope: ChallengeScope = { connId, projectKey: key };
+         const scope: ChallengeScope = {};
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
  and 11 more tests!

[Survived] StringLiteral
lib/manager.ts:434:52
-           throw new DbToolError('INVALID_CHALLENGE', '确认凭据无效（不存在、已使用、已过期或语句已变更），请重新发起');
+           throw new DbToolError('INVALID_CHALLENGE', "");
Tests ran:
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 5 more tests!

[Survived] ConditionalExpression
lib/manager.ts:450:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (true && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] LogicalOperator
lib/manager.ts:450:9
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r || typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:450:14
-       if (r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true) {
+       if (r && true && (r as NeedConfirm).needConfirmation === true) {
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:471:13
-           ...(error !== undefined ? { error } : {}),
+           ...(true ? { error } : {}),
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 27 more tests!

[Survived] ConditionalExpression
lib/manager.ts:472:13
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(true ? { rowsAffected } : {}),
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 27 more tests!

[Survived] ConditionalExpression
lib/manager.ts:472:13
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(false ? { rowsAffected } : {}),
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 27 more tests!

[Survived] EqualityOperator
lib/manager.ts:472:13
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(rowsAffected === undefined ? { rowsAffected } : {}),
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 27 more tests!

[Survived] BlockStatement
lib/manager.ts:479:39
-     private errText(e: unknown): string {
-       return e instanceof Error ? e.message : String(e);
-     }
+     private errText(e: unknown): string {}
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] ConditionalExpression
lib/manager.ts:484:9
-       if (e instanceof DbToolError) return e;
+       if (false) return e;
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] ObjectLiteral
lib/manager.ts:472:42
-           ...(rowsAffected !== undefined ? { rowsAffected } : {}),
+           ...(rowsAffected !== undefined ? {} : {}),
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 18 more tests!

[Survived] ConditionalExpression
lib/manager.ts:511:26
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (true ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] ConditionalExpression
lib/manager.ts:511:26
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (false ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] EqualityOperator
lib/manager.ts:511:26
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (snake !== 'conn_id' ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:511:36
-     return args[snake] ?? (snake === 'conn_id' ? args.connId : args.challengeId);
+     return args[snake] ?? (snake === "" ? args.connId : args.challengeId);
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:525:34
-     const challengeId = pick(args, 'challenge_id');
+     const challengeId = pick(args, "");
Tests ran:
    handleToolAction（工具分发层） list_connections 返回脱敏 JSON 文本
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
  and 2 more tests!

[Survived] StringLiteral
lib/manager.ts:534:93
-           const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, 'sql'), args.params, challengeId);
+           const r = await service.query(projectPath, requireConn(connId), assertArg(args.sql, ""), args.params, challengeId);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）

[Survived] StringLiteral
lib/manager.ts:539:113
-           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, 'statement'), args.params, challengeId);
+           const r = await service.execute(projectPath, requireConn(connId), assertArg(args.statement ?? args.sql, ""), args.params, challengeId);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] StringLiteral
lib/manager.ts:550:12
-         case 'preview': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:543:12
-         case 'schema': {
+         case "": {
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:556:98
-           const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, 'code'), challengeId);
+           const r = await service.runScript(projectPath, requireConn(connId), assertArg(args.code, ""), challengeId);
Tests ran:
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:561:51
-           throw new DbToolError('INVALID_ARGUMENT', `未知 action: ${action}（可用: list_connections/query/execute/schema/preview/run_script）`);
+           throw new DbToolError('INVALID_ARGUMENT', ``);
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] BooleanLiteral
lib/manager.ts:565:20
-       return j({ ok: false, error: e instanceof Error ? e.message : String(e), code });
+       return j({ ok: true, error: e instanceof Error ? e.message : String(e), code });
Tests ran:
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:570:7
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (false) throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:570:18
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || false) throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] MethodExpression
lib/manager.ts:570:18
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:570:36
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId.trim() === "Stryker was here!") throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:570:82
-     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', '缺少必填参数: conn_id');
+     if (!connId || connId.trim() === '') throw new DbToolError('INVALID_ARGUMENT', "");
Tests ran:
    handleToolAction（工具分发层） 缺参数 / 未知 action → INVALID_ARGUMENT 错误 JSON

[Survived] LogicalOperator
lib/manager.ts:575:7
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v && v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:575:7
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (false) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:575:13
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || false) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] MethodExpression
lib/manager.ts:575:13
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] StringLiteral
lib/manager.ts:575:26
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === "Stryker was here!") throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:580:7
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (false) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:580:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] LogicalOperator
lib/manager.ts:580:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === 'object' || (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:580:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(true && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] LogicalOperator
lib/manager.ts:580:9
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r || typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:580:14
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && true && (r as NeedConfirm).needConfirmation === true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] ConditionalExpression
lib/manager.ts:580:39
-     if (!(r && typeof r === 'object' && (r as NeedConfirm).needConfirmation === true)) return null;
+     if (!(r && typeof r === 'object' && true)) return null;
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒

[Survived] BooleanLiteral
lib/manager.ts:583:9
-       ok: false,
+       ok: true,
Tests ran:
    handleToolAction（工具分发层） query 直通与 NEEDS_CONFIRMATION 带 hint 指引

[Survived] BlockStatement
lib/manager.ts:328:34
-     async dispose(): Promise<void> {
-       this.disposed = true;
-       this.challenges.dispose();
-       const pending = [...this.adapterCache.values()];
-       this.adapterCache.clear();
-       for (const p of pending) {
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
-           // 缓存里的加载失败项直接忽略
-         }
-       }
-     }
+     async dispose(): Promise<void> {}
Ran all tests for this mutant.

[Survived] BooleanLiteral
lib/manager.ts:329:21
-       this.disposed = true;
+       this.disposed = false;
Ran all tests for this mutant.

[Survived] CallExpression
lib/manager.ts:330:5
-       this.challenges.dispose();
+       ;
Ran all tests for this mutant.

[Survived] ArrayDeclaration
lib/manager.ts:331:21
-       const pending = [...this.adapterCache.values()];
+       const pending = [];
Ran all tests for this mutant.

[Survived] CallExpression
lib/manager.ts:332:5
-       this.adapterCache.clear();
+       ;
Ran all tests for this mutant.

[Survived] BlockStatement
lib/manager.ts:333:30
-       for (const p of pending) {
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
-           // 缓存里的加载失败项直接忽略
-         }
-       }
+       for (const p of pending) {}
Ran all tests for this mutant.

[Survived] BlockStatement
lib/manager.ts:334:11
-         try {
-           const a = await p;
-           await a.close().catch(() => {});
-         } catch {
+         try {} catch {
Ran all tests for this mutant.
