[NoCoverage] BlockStatement
lib/manager.ts:209:17
-       } catch (e) {
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:210:31
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:210:42
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', ``, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:210:74
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:210:82
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:210:89
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, this.errText(e));

[NoCoverage] MethodExpression
lib/manager.ts:279:42
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = src.length > 200 ? src + '…' : src;

[NoCoverage] StringLiteral
lib/manager.ts:279:62
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = src.length > 200 ? src.slice(0, 200) + "" : src;

[NoCoverage] BlockStatement
lib/manager.ts:442:17
-       } catch (e) {
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] CallExpression
lib/manager.ts:443:7
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         ;

[NoCoverage] ConditionalExpression
lib/manager.ts:443:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, true, false, this.errText(e));

[NoCoverage] ConditionalExpression
lib/manager.ts:443:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, false, false, this.errText(e));

[NoCoverage] EqualityOperator
lib/manager.ts:443:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level !== 'danger', false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:443:94
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === "", false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:443:104
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, this.errText(e));

[Survived] BooleanLiteral
lib/manager.ts:204:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:207:31
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, "", `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:207:42
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', ``, 'none', false, true, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:207:74
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, "", false, true, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:207:82
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', true, true, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:207:89
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped}`, 'none', false, false, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] ConditionalExpression
lib/manager.ts:279:23
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = true ? src.slice(0, 200) + '…' : src;
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] ConditionalExpression
lib/manager.ts:279:23
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = false ? src.slice(0, 200) + '…' : src;
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] EqualityOperator
lib/manager.ts:279:23
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = src.length >= 200 ? src.slice(0, 200) + '…' : src;
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] EqualityOperator
lib/manager.ts:279:23
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = src.length <= 200 ? src.slice(0, 200) + '…' : src;
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] StringLiteral
lib/manager.ts:292:31
-         this.audit(key, connId, 'script', auditStmt, 'none', false, true);
+         this.audit(key, connId, "", auditStmt, 'none', false, true);
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] StringLiteral
lib/manager.ts:292:52
-         this.audit(key, connId, 'script', auditStmt, 'none', false, true);
+         this.audit(key, connId, 'script', auditStmt, "", false, true);
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] BooleanLiteral
lib/manager.ts:292:60
-         this.audit(key, connId, 'script', auditStmt, 'none', false, true);
+         this.audit(key, connId, 'script', auditStmt, 'none', true, true);
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] BooleanLiteral
lib/manager.ts:292:67
-         this.audit(key, connId, 'script', auditStmt, 'none', false, true);
+         this.audit(key, connId, 'script', auditStmt, 'none', false, false);
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    handleToolAction（工具分发层） run_script action 返回脚本结果；ro 被拒
  and 1 more test!

[Survived] BlockStatement
lib/manager.ts:295:75
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
-           this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
-         }
+         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {}
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] StringLiteral
lib/manager.ts:296:33
-           this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
+           this.audit(key, connId, "", auditStmt, 'none', false, false, this.errText(e));
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] StringLiteral
lib/manager.ts:296:54
-           this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
+           this.audit(key, connId, 'script', auditStmt, "", false, false, this.errText(e));
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] BooleanLiteral
lib/manager.ts:296:69
-           this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
+           this.audit(key, connId, 'script', auditStmt, 'none', false, true, this.errText(e));
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] BooleanLiteral
lib/manager.ts:296:62
-           this.audit(key, connId, 'script', auditStmt, 'none', false, false, this.errText(e));
+           this.audit(key, connId, 'script', auditStmt, 'none', true, false, this.errText(e));
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃

[Survived] StringLiteral
lib/manager.ts:433:48
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, "", false, false, 'INVALID_CHALLENGE');
Tests ran:
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 5 more tests!

[Survived] BooleanLiteral
lib/manager.ts:433:58
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, 'danger', true, false, 'INVALID_CHALLENGE');
Tests ran:
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 5 more tests!

[Survived] BooleanLiteral
lib/manager.ts:433:65
-           this.audit(key, connId, op, statement, 'danger', false, false, 'INVALID_CHALLENGE');
+           this.audit(key, connId, op, statement, 'danger', false, true, 'INVALID_CHALLENGE');
Tests ran:
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
    DbToolService: 浏览与审计 INVALID_CHALLENGE 也留审计
  and 5 more tests!

[Survived] ConditionalExpression
lib/manager.ts:440:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, true, true, undefined, args.rowsAffected?.(result));
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 16 more tests!

[Survived] OptionalChaining
lib/manager.ts:440:121
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected?.(result));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, undefined, args.rowsAffected(result));
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 16 more tests!
