[NoCoverage] ObjectLiteral
lib/store/connections.ts:163:56
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (password !== undefined) this.secrets.set(id, {});

[Survived] ConditionalExpression
lib/store/connections.ts:73:18
-     if (!fields || typeof fields[PASSWORD_KEY] !== 'string') {
+     if (!fields || false) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ObjectLiteral
lib/store/connections.ts:74:12
-       return { clean: fields, password: undefined };
+       return {};
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:134:9
-       if (input.ssl !== undefined) rec.ssl = input.ssl;
+       if (true) rec.ssl = input.ssl;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 32 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:144:9
-       if (password !== undefined) secretPatch.password = password;
+       if (true) secretPatch.password = password;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 32 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:145:9
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (true) this.secrets.set(input.id, secretPatch);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 32 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:145:9
-       if (Object.keys(secretPatch).length > 0) this.secrets.set(input.id, secretPatch);
+       if (Object.keys(secretPatch).length >= 0) this.secrets.set(input.id, secretPatch);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 32 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:159:9
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+       if (true) rec.ssl = patch.ssl;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:159:9
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+       if (patch.ssl === undefined) rec.ssl = patch.ssl;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:159:9
-       if (patch.ssl !== undefined) rec.ssl = patch.ssl;
+       if (false) rec.ssl = patch.ssl;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] BlockStatement
lib/store/connections.ts:160:37
-       if (patch.fields !== undefined) {
-         const { clean, password } = splitPassword(patch.fields);
-         rec.fields = clean;
-         if (password !== undefined) this.secrets.set(id, { password });
-       }
+       if (patch.fields !== undefined) {}
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:163:11
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (true) this.secrets.set(id, { password });
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:163:11
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (false) this.secrets.set(id, { password });
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:163:11
-         if (password !== undefined) this.secrets.set(id, { password });
+         if (password === undefined) this.secrets.set(id, { password });
Tests ran:
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:199:9
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (true) (fields ??= {}).password = sec.password;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 17 more tests!

[Survived] OptionalChaining
lib/store/connections.ts:199:9
-       if (sec?.password !== undefined) (fields ??= {}).password = sec.password;
+       if (sec.password !== undefined) (fields ??= {}).password = sec.password;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 17 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:201:9
-       if (rec.ssl !== undefined) rc.ssl = rec.ssl;
+       if (true) rc.ssl = rec.ssl;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 17 more tests!

[NoCoverage] BlockStatement
lib/manager.ts:164:17
-       } catch (e) {
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:165:31
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", 'listDatabases', 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:165:44
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', "", 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:165:61
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', 'listDatabases', "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:165:69
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:165:76
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:176:17
-       } catch (e) {
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:177:31
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", database ?? 'default', 'none', false, false, this.errText(e));

[NoCoverage] LogicalOperator
lib/manager.ts:177:41
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database && 'default', 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:177:53
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? "", 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:177:64
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? 'default', "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:177:72
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:177:79
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:189:17
-       } catch (e) {
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:190:31
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", t, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:190:44
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'schema', t, "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:190:52
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'schema', t, 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:190:59
-         this.audit(key, connId, 'schema', t, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'schema', t, 'none', false, true, this.errText(e));

[NoCoverage] BlockStatement
lib/manager.ts:211:17
-       } catch (e) {
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] StringLiteral
lib/manager.ts:212:31
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, "", `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:212:42
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', ``, 'none', false, false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:212:88
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, "", false, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:212:96
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', true, false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:212:103
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, false, this.errText(e));
+         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, this.errText(e));

[NoCoverage] MethodExpression
lib/manager.ts:281:42
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = src.length > 200 ? src + '…' : src;

[NoCoverage] StringLiteral
lib/manager.ts:281:62
-       const auditStmt = src.length > 200 ? src.slice(0, 200) + '…' : src;
+       const auditStmt = src.length > 200 ? src.slice(0, 200) + "" : src;

[NoCoverage] BlockStatement
lib/manager.ts:444:17
-       } catch (e) {
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] CallExpression
lib/manager.ts:445:7
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         ;

[NoCoverage] ConditionalExpression
lib/manager.ts:445:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, true, false, this.errText(e));

[NoCoverage] ConditionalExpression
lib/manager.ts:445:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, false, false, this.errText(e));

[NoCoverage] EqualityOperator
lib/manager.ts:445:76
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level !== 'danger', false, this.errText(e));

[NoCoverage] StringLiteral
lib/manager.ts:445:94
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === "", false, this.errText(e));

[NoCoverage] BooleanLiteral
lib/manager.ts:445:104
-         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', false, this.errText(e));
+         this.audit(key, connId, op, statement, verdict.level as DangerLevel, verdict.level === 'danger', true, this.errText(e));

[Survived] StringLiteral
lib/manager.ts:99:16
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit("Stryker was here!", input.id, 'create_connection', input.id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:99:30
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, "", input.id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:99:61
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, 'create_connection', input.id, "", false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:99:69
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, 'create_connection', input.id, 'none', true, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:99:76
-       this.audit('', input.id, 'create_connection', input.id, 'none', false, true);
+       this.audit('', input.id, 'create_connection', input.id, 'none', false, false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:108:16
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit("Stryker was here!", id, 'update_connection', id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:108:24
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, "", id, 'none', false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:108:49
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, 'update_connection', id, "", false, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:108:57
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, 'update_connection', id, 'none', true, true);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:108:64
-       this.audit('', id, 'update_connection', id, 'none', false, true);
+       this.audit('', id, 'update_connection', id, 'none', false, false);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:116:16
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit("Stryker was here!", id, 'remove_connection', id, 'none', false, true);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:116:24
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, "", id, 'none', false, true);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:116:49
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, 'remove_connection', id, "", false, true);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:116:57
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, 'remove_connection', id, 'none', true, true);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] BooleanLiteral
lib/manager.ts:116:64
-       this.audit('', id, 'remove_connection', id, 'none', false, true);
+       this.audit('', id, 'remove_connection', id, 'none', false, false);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:146:29
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, "", `${connId} -> ${mode}`, 'none', false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:146:62
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, "", false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:146:38
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', ``, 'none', false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:146:70
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', true, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:146:77
-       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, true);
+       this.audit(key, connId, 'grant', `${connId} -> ${mode}`, 'none', false, false);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:153:29
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, "", connId, 'none', false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:153:47
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, 'revoke', connId, "", false, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:153:55
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, 'revoke', connId, 'none', true, true);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:153:62
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
+       this.audit(key, connId, 'revoke', connId, 'none', false, false);
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BooleanLiteral
lib/manager.ts:159:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:162:31
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, "", 'listDatabases', 'none', false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:162:44
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', "", 'none', false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:162:61
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', 'listDatabases', "", false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:162:69
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', true, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:162:76
-         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, true);
+         this.audit(key, connId, 'databases', 'listDatabases', 'none', false, false);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:171:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:174:31
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, "", database ?? 'default', 'none', false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:174:53
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? "", 'none', false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] LogicalOperator
lib/manager.ts:174:41
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database && 'default', 'none', false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:174:64
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? 'default', "", false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:174:72
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', true, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:174:79
-         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, true);
+         this.audit(key, connId, 'tables', database ?? 'default', 'none', false, false);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:184:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:187:31
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, "", t, 'none', false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:187:52
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, 'schema', t, 'none', true, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:187:44
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, 'schema', t, "", false, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:187:59
-         this.audit(key, connId, 'schema', t, 'none', false, true);
+         this.audit(key, connId, 'schema', t, 'none', false, false);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] BooleanLiteral
lib/manager.ts:206:72
-       const { key, adapter } = await this.authorize(projectPath, connId, false);
+       const { key, adapter } = await this.authorize(projectPath, connId, true);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:209:31
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, "", `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:209:42
-         this.audit(key, connId, 'preview', `PREVIEW ${t} LIMIT ${capped} OFFSET ${off}`, 'none', false, true, undefined, result.rowCount);
+         this.audit(key, connId, 'preview', ``, 'none', false, true, undefined, result.rowCount);
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview
