[NoCoverage] StringLiteral
lib/guard/index.ts:57:35
-     return m?.[1]?.toLowerCase() ?? '';
+     return m?.[1]?.toLowerCase() ?? "Stryker was here!";

[NoCoverage] ObjectLiteral
lib/guard/index.ts:80:27
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === '') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:80:36
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === '') return { level: "", reason: '无法解析语句关键字，按危险语句处理' };

[NoCoverage] StringLiteral
lib/guard/index.ts:80:54
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === '') return { level: 'danger', reason: "" };

[NoCoverage] BlockStatement
lib/guard/index.ts:88:44
-       if (SQL_WRITE_BODY_RE.test(statement)) {
-         return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
-       }
+       if (SQL_WRITE_BODY_RE.test(statement)) {}

[NoCoverage] ObjectLiteral
lib/guard/index.ts:89:14
-         return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
+         return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:89:23
-         return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
+         return { level: "", reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };

[NoCoverage] StringLiteral
lib/guard/index.ts:89:41
-         return { level: 'danger', reason: '读语句体内包含写操作关键字（如 WITH...DELETE / EXPLAIN 写语句），需要确认' };
+         return { level: 'danger', reason: "" };

[NoCoverage] StringLiteral
lib/guard/index.ts:110:29
-     const head = (parts[0] ?? '').toUpperCase();
+     const head = (parts[0] ?? "Stryker was here!").toUpperCase();

[NoCoverage] ObjectLiteral
lib/guard/index.ts:111:27
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === '') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:111:36
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === '') return { level: "", reason: '无法解析 Redis 命令，按危险命令处理' };

[NoCoverage] StringLiteral
lib/guard/index.ts:111:54
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === '') return { level: 'danger', reason: "" };

[NoCoverage] ObjectLiteral
lib/guard/index.ts:117:32
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+       if (op === 'query') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:117:41
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+       if (op === 'query') return { level: "", reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };

[NoCoverage] StringLiteral
lib/guard/index.ts:117:59
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+       if (op === 'query') return { level: 'danger', reason: `` };

[NoCoverage] StringLiteral
lib/guard/index.ts:133:67
-         head = Object.keys(parsed as Record<string, unknown>)[0] ?? '';
+         head = Object.keys(parsed as Record<string, unknown>)[0] ?? "Stryker was here!";

[NoCoverage] ObjectLiteral
lib/guard/index.ts:138:27
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === '') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:138:36
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === '') return { level: "", reason: '无法解析 MongoDB 命令，按危险命令处理' };

[NoCoverage] StringLiteral
lib/guard/index.ts:138:54
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === '') return { level: 'danger', reason: "" };

[NoCoverage] ObjectLiteral
lib/guard/index.ts:144:32
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+       if (op === 'query') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:144:41
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+       if (op === 'query') return { level: "", reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };

[NoCoverage] StringLiteral
lib/guard/index.ts:144:59
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+       if (op === 'query') return { level: 'danger', reason: `` };

[NoCoverage] ConditionalExpression
lib/guard/index.ts:148:7
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (true) return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };

[NoCoverage] ConditionalExpression
lib/guard/index.ts:148:7
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (false) return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };

[NoCoverage] EqualityOperator
lib/guard/index.ts:148:7
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (op !== 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };

[NoCoverage] StringLiteral
lib/guard/index.ts:148:14
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (op === "") return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };

[NoCoverage] ObjectLiteral
lib/guard/index.ts:148:30
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (op === 'query') return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:148:39
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (op === 'query') return { level: "", reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };

[NoCoverage] StringLiteral
lib/guard/index.ts:148:57
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 MongoDB 操作（${head}），需要确认` };
+     if (op === 'query') return { level: 'danger', reason: `` };

[NoCoverage] ObjectLiteral
lib/guard/index.ts:149:10
-     return { level: 'none' };
+     return {};

[NoCoverage] StringLiteral
lib/guard/index.ts:149:19
-     return { level: 'none' };
+     return { level: "" };

[NoCoverage] ArithmeticOperator
lib/guard/index.ts:193:47
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+       const interval = opts?.sweepIntervalMs ?? 60 / 1000;

[NoCoverage] BlockStatement
lib/guard/index.ts:194:23
-       if (interval > 0) {
-         this.timer = setInterval(() => this.sweep(), interval);
-         this.timer.unref?.();
-       }
+       if (interval > 0) {}

[NoCoverage] ArrowFunction
lib/guard/index.ts:195:32
-         this.timer = setInterval(() => this.sweep(), interval);
+         this.timer = setInterval(() => undefined, interval);

[NoCoverage] OptionalChaining
lib/guard/index.ts:196:7
-         this.timer.unref?.();
+         this.timer.unref();

[NoCoverage] BooleanLiteral
lib/guard/index.ts:223:72
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (ch.connId !== undefined && ch.connId !== scope?.connId) return true;

[NoCoverage] BooleanLiteral
lib/guard/index.ts:224:84
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return true;

[NoCoverage] BlockStatement
lib/guard/index.ts:238:21
-       if (this.timer) {
-         clearInterval(this.timer);
-         this.timer = undefined;
-       }
+       if (this.timer) {}

[NoCoverage] CallExpression
lib/guard/index.ts:239:7
-         clearInterval(this.timer);
+         ;

[Survived] Regex
lib/guard/index.ts:52:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[^\s\S]*?\*\//g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] MethodExpression
lib/guard/index.ts:51:13
-     const s = statement
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
-       .replace(/--[^\n]*/g, ' ')
-       .replace(/#[^\n]*/g, ' ')
-       .trim();
+     const s = statement.replace(/\/\*[\s\S]*?\*\//g, ' ').replace(/--[^\n]*/g, ' ').replace(/#[^\n]*/g, ' ');
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:52:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\s\S]\*\//g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:52:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\S\S]*?\*\//g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:52:14
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\s\s]*?\*\//g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:53:14
-       .replace(/--[^\n]*/g, ' ')
+       .replace(/--[^\n]/g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:52:35
-       .replace(/\/\*[\s\S]*?\*\//g, ' ')
+       .replace(/\/\*[\s\S]*?\*\//g, "")
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:53:14
-       .replace(/--[^\n]*/g, ' ')
+       .replace(/--[\n]*/g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:54:14
-       .replace(/#[^\n]*/g, ' ')
+       .replace(/#[^\n]/g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:53:27
-       .replace(/--[^\n]*/g, ' ')
+       .replace(/--[^\n]*/g, "")
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:54:14
-       .replace(/#[^\n]*/g, ' ')
+       .replace(/#[\n]*/g, ' ')
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:54:26
-       .replace(/#[^\n]*/g, ' ')
+       .replace(/#[^\n]*/g, "")
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] Regex
lib/guard/index.ts:56:13
-     const m = /^[\s(]*([a-zA-Z_]+)/.exec(s);
+     const m = /[\s(]*([a-zA-Z_]+)/.exec(s);
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:57:10
-     return m?.[1]?.toLowerCase() ?? '';
+     return m?.[1].toLowerCase() ?? '';
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:57:10
-     return m?.[1]?.toLowerCase() ?? '';
+     return m[1]?.toLowerCase() ?? '';
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:62:56
-     return createHash('sha256').update(statement.trim(), 'utf8').digest('hex');
+     return createHash('sha256').update(statement.trim(), "").digest('hex');
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
  and 18 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:80:7
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (false) return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:80:16
-     if (head === '') return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
+     if (head === "Stryker was here!") return { level: 'danger', reason: '无法解析语句关键字，按危险语句处理' };
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 26 more tests!

[Survived] StringLiteral
lib/guard/index.ts:85:41
-         return { level: 'danger', reason: '读语句包含危险片段（多语句 / 文件读写 / 全局设置 / 锁读），需要确认' };
+         return { level: 'danger', reason: "" };
Tests ran:
    业务路由与确认流程 query 危险读（FOR UPDATE）→ NEEDS_CONFIRMATION；携 challengeId 重发放行；篡改语句与重放均被拒
    classifyStatement: SQL 系 读语句内的危险片段升级为 danger

[Survived] ConditionalExpression
lib/guard/index.ts:88:9
-       if (SQL_WRITE_BODY_RE.test(statement)) {
+       if (false) {
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 10 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:95:7
-     if (SQL_DML_RE.test(statement)) {
+     if (false) {
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 3 more tests!

[Survived] BlockStatement
lib/guard/index.ts:95:35
-     if (SQL_DML_RE.test(statement)) {
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
-       return { level: 'warning', reason: '写操作将修改数据' };
-     }
+     if (SQL_DML_RE.test(statement)) {}
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
  and 1 more test!

[Survived] StringLiteral
lib/guard/index.ts:96:59
-       if (op === 'query') return { level: 'danger', reason: '只读通道（query）出现写语句，需要确认' };
+       if (op === 'query') return { level: 'danger', reason: "" };
Tests ran:
    DbToolService: 危险确认与 challenge query 通道的写语句同样需要确认；SELECT 直通
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] StringLiteral
lib/guard/index.ts:97:40
-       return { level: 'warning', reason: '写操作将修改数据' };
+       return { level: 'warning', reason: "" };
Tests ran:
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    classifyStatement: SQL 系 DML 在 execute 通道为 warning，在 query 通道为 danger

[Survived] StringLiteral
lib/guard/index.ts:99:71
-     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: '维护/管理命令影响服务器状态，需要确认' };
+     if (SQL_MAINT_RE.test(statement)) return { level: 'danger', reason: "" };
Tests ran:
    classifyStatement: SQL 系 维护命令为 danger

[Survived] StringLiteral
lib/guard/index.ts:102:57
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现非读取语句（${head}），需要确认` };
+     if (op === 'query') return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:103:38
-     return { level: 'warning', reason: `未识别的语句类型（${head}），请确认后执行` };
+     return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: SQL 系 未知关键字：query 通道 danger，execute 通道 warning

[Survived] ConditionalExpression
lib/guard/index.ts:111:7
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (false) return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] StringLiteral
lib/guard/index.ts:111:16
-     if (head === '') return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
+     if (head === "Stryker was here!") return { level: 'danger', reason: '无法解析 Redis 命令，按危险命令处理' };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
  and 1 more test!

[Survived] StringLiteral
lib/guard/index.ts:114:39
-       return { level: 'danger', reason: `Redis 危险命令 ${head}，可能清空/重配置实例，需要确认` };
+       return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: Redis 危险命令 danger（13 项清单）
    classifyStatement: Redis JSON 数组形式同样解析

[Survived] ConditionalExpression
lib/guard/index.ts:116:7
-     if (WRITE_COMMANDS.has(head)) {
+     if (false) {
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning
    classifyStatement: Redis JSON 数组形式同样解析
    classifyStatement: Redis 未知命令 fail-closed：query 通道 danger、execute 通道 warning

[Survived] BlockStatement
lib/guard/index.ts:116:33
-     if (WRITE_COMMANDS.has(head)) {
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
-     }
+     if (WRITE_COMMANDS.has(head)) {}
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] ConditionalExpression
lib/guard/index.ts:117:9
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+       if (false) return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] StringLiteral
lib/guard/index.ts:117:16
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
+       if (op === "") return { level: 'danger', reason: `只读通道（query）出现 Redis 写命令 ${head}，需要确认` };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] StringLiteral
lib/guard/index.ts:118:40
-       return { level: 'warning', reason: `Redis 写命令 ${head} 将修改数据` };
+       return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: Redis 读命令 none、写命令 warning

[Survived] StringLiteral
lib/guard/index.ts:121:57
-     if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现未识别的 Redis 命令（${head}），需要确认` };
+     if (op === 'query') return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: Redis 未知命令 fail-closed：query 通道 danger、execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:122:38
-     return { level: 'warning', reason: `未识别的 Redis 命令（${head}），请确认后执行` };
+     return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: Redis 未知命令 fail-closed：query 通道 danger、execute 通道 warning

[Survived] StringLiteral
lib/guard/index.ts:129:14
-     let head = '';
+     let head = "Stryker was here!";
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none
    classifyStatement: MongoDB 非法 JSON danger

[Survived] ConditionalExpression
lib/guard/index.ts:132:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (true) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] LogicalOperator
lib/guard/index.ts:132:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && typeof parsed === 'object' || !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:132:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (true && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] LogicalOperator
lib/guard/index.ts:132:9
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed || typeof parsed === 'object' && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:132:19
-       if (parsed && typeof parsed === 'object' && !Array.isArray(parsed)) {
+       if (parsed && true && !Array.isArray(parsed)) {
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] BlockStatement
lib/guard/index.ts:135:11
-     } catch {
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
-     }
+     } catch {}
Tests ran:
    classifyStatement: MongoDB 非法 JSON danger

[Survived] StringLiteral
lib/guard/index.ts:136:39
-       return { level: 'danger', reason: 'MongoDB 命令不是合法 JSON 对象，按危险命令处理' };
+       return { level: 'danger', reason: "" };
Tests ran:
    classifyStatement: MongoDB 非法 JSON danger

[Survived] ConditionalExpression
lib/guard/index.ts:138:7
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (false) return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:138:16
-     if (head === '') return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
+     if (head === "Stryker was here!") return { level: 'danger', reason: '无法解析 MongoDB 命令，按危险命令处理' };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:141:39
-       return { level: 'danger', reason: `MongoDB 危险操作 ${head}，可能删库/删集合，需要确认` };
+       return { level: 'danger', reason: `` };
Tests ran:
    classifyStatement: MongoDB 危险操作 danger（8 项清单）

[Survived] ConditionalExpression
lib/guard/index.ts:144:9
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+       if (false) return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:144:16
-       if (op === 'query') return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
+       if (op === "") return { level: 'danger', reason: `只读通道（query）出现 MongoDB 写操作 ${head}，需要确认` };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] StringLiteral
lib/guard/index.ts:145:40
-       return { level: 'warning', reason: `MongoDB 写操作 ${head} 将修改数据` };
+       return { level: 'warning', reason: `` };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] ConditionalExpression
lib/guard/index.ts:147:7
-     if (MONGO_READ_OPS.has(head)) return { level: 'none' };
+     if (true) return { level: 'none' };
Tests ran:
    classifyStatement: MongoDB 写操作 warning、读操作 none

[Survived] OptionalChaining
lib/guard/index.ts:191:16
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+       this.ttl = opts.ttlMs ?? 5 * 60 * 1000;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] ArithmeticOperator
lib/guard/index.ts:191:31
-       this.ttl = opts?.ttlMs ?? 5 * 60 * 1000;
+       this.ttl = opts?.ttlMs ?? 5 / 60 * 1000;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 22 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:192:18
-       this.nowFn = opts?.now ?? (() => Date.now());
+       this.nowFn = opts.now ?? (() => Date.now());
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] ArrowFunction
lib/guard/index.ts:192:32
-       this.nowFn = opts?.now ?? (() => Date.now());
+       this.nowFn = opts?.now ?? (() => undefined);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 22 more tests!

[Survived] LogicalOperator
lib/guard/index.ts:193:22
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+       const interval = opts?.sweepIntervalMs && 60 * 1000;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:193:22
-       const interval = opts?.sweepIntervalMs ?? 60 * 1000;
+       const interval = opts.sweepIntervalMs ?? 60 * 1000;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:194:9
-       if (interval > 0) {
+       if (true) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:194:9
-       if (interval > 0) {
+       if (false) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:194:9
-       if (interval > 0) {
+       if (interval >= 0) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:194:9
-       if (interval > 0) {
+       if (interval <= 0) {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 29 more tests!
