[Survived] StringLiteral
lib/guard/index.ts:202:40
-       if (this.disposed) throw new Error('ChallengeStore 已关闭');
+       if (this.disposed) throw new Error("");
Tests ran:
    ChallengeStore dispose 后不可再用

[Survived] ObjectLiteral
lib/guard/index.ts:209:19
-         ...(scope ? { connId: scope.connId, projectKey: scope.projectKey } : {}),
+         ...(scope ? {} : {}),
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
  and 11 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:220:9
-       if (this.nowFn() > ch.expiresAt) return false;
+       if (this.nowFn() >= ch.expiresAt) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 危险确认与 challenge challenge 绑 hash：带 id 但语句已变更 → INVALID_CHALLENGE
  and 12 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:223:9
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (false) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:223:9
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (true && ch.connId !== scope?.connId) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:223:9
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (ch.connId === undefined && ch.connId !== scope?.connId) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] OptionalChaining
lib/guard/index.ts:223:50
-       if (ch.connId !== undefined && ch.connId !== scope?.connId) return false;
+       if (ch.connId !== undefined && ch.connId !== scope.connId) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 5 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:224:9
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (false) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] ConditionalExpression
lib/guard/index.ts:224:9
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (true && ch.projectKey !== scope?.projectKey) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] EqualityOperator
lib/guard/index.ts:224:9
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (ch.projectKey === undefined && ch.projectKey !== scope?.projectKey) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 7 more tests!

[Survived] BlockStatement
lib/guard/index.ts:229:17
-     sweep(): void {
-       const now = this.nowFn();
-       for (const [id, ch] of this.map) {
-         if (now > ch.expiresAt) this.map.delete(id);
-       }
-     }
+     sweep(): void {}
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] BlockStatement
lib/guard/index.ts:231:38
-       for (const [id, ch] of this.map) {
-         if (now > ch.expiresAt) this.map.delete(id);
-       }
+       for (const [id, ch] of this.map) {}
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] ConditionalExpression
lib/guard/index.ts:232:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (true) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] ConditionalExpression
lib/guard/index.ts:232:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (false) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:232:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now >= ch.expiresAt) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] EqualityOperator
lib/guard/index.ts:232:11
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now <= ch.expiresAt) this.map.delete(id);
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] OptionalChaining
lib/guard/index.ts:224:58
-       if (ch.projectKey !== undefined && ch.projectKey !== scope?.projectKey) return false;
+       if (ch.projectKey !== undefined && ch.projectKey !== scope.projectKey) return false;
Tests ran:
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
    DbToolService: 危险确认与 challenge challenge 一次性：重放同 id → INVALID_CHALLENGE
    DbToolService: 浏览与审计 危险确认与执行都留审计
  and 5 more tests!

[Survived] CallExpression
lib/guard/index.ts:232:31
-         if (now > ch.expiresAt) this.map.delete(id);
+         if (now > ch.expiresAt) ;
Tests ran:
    ChallengeStore sweep 清理过期项

[Survived] StringLiteral
lib/guard/index.ts:23:29
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', 'show', "", 'desc', 'explain', 'use', 'set', 'help', 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:21
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', "", 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:13
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', "", 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:41
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', 'show', 'describe', "", 'explain', 'use', 'set', 'help', 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:67
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', "", 'help', 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:60
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', 'show', 'describe', 'desc', 'explain', "", 'set', 'help', 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:74
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', "", 'table',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:23:82
-     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', 'table',
+     'select', 'with', 'show', 'describe', 'desc', 'explain', 'use', 'set', 'help', "",
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:27:20
-   const SQL_DDL_RE = /^\s*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
+   const SQL_DDL_RE = /\s*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:29:20
-   const SQL_DML_RE = /^\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
+   const SQL_DML_RE = /\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:27:20
-   const SQL_DDL_RE = /^\s*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
+   const SQL_DDL_RE = /^\S*(drop|truncate|alter|create|rename|comment|grant|revoke|flashback|purge)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:29:20
-   const SQL_DML_RE = /^\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
+   const SQL_DML_RE = /^\s(insert|update|delete|merge|replace|upsert|call|do)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:29:20
-   const SQL_DML_RE = /^\s*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
+   const SQL_DML_RE = /^\S*(insert|update|delete|merge|replace|upsert|call|do)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:31:22
-   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+   const SQL_MAINT_RE = /\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:31:22
-   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+   const SQL_MAINT_RE = /^\S*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:31:22
-   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\slog|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:31:22
-   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\S+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:31:22
-   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\stable|repair|lock|unlock|kill|flush)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:31:22
-   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\s+table|repair|lock|unlock|kill|flush)\b/i;
+   const SQL_MAINT_RE = /^\s*(shutdown|startup|archive\s+log|recover|analyze|optimize|check\S+table|repair|lock|unlock|kill|flush)\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\S*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\s|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\S*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\S+[\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[^\s\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\S\S]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\s]*\bfor\s+update\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\supdate\b/i;
Ran all tests for this mutant.

[Survived] Regex
lib/guard/index.ts:34:30
-   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\s+update\b/i;
+   const SQL_HIDDEN_DANGER_RE = /[;]\s*\S|into\s+(outfile|dumpfile)|load_file\s*\(|set\s+(global|persist)|select\s+[\s\S]*\bfor\S+update\b/i;
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:43:13
-     'insert', 'insertOne', 'insertMany',
+     'insert', "", 'insertMany',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:43:26
-     'insert', 'insertOne', 'insertMany',
+     'insert', 'insertOne', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:44:3
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     "", 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:44:16
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', "", 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:44:30
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', "", 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:44:44
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', "", 'findAndModify', 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:44:64
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', "", 'bulkWrite',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:44:81
-     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', 'bulkWrite',
+     'updateOne', 'updateMany', 'replaceOne', 'findOneAndUpdate', 'findAndModify', "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:45:3
-     'deleteOne',
+     "",
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:46:3
-     'createCollection', 'renameCollection', 'mapReduce',
+     "", 'renameCollection', 'mapReduce',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:46:23
-     'createCollection', 'renameCollection', 'mapReduce',
+     'createCollection', "", 'mapReduce',
Ran all tests for this mutant.

[Survived] StringLiteral
lib/guard/index.ts:46:43
-     'createCollection', 'renameCollection', 'mapReduce',
+     'createCollection', 'renameCollection', "",
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/guard/index.ts:238:9
-       if (this.timer) {
+       if (true) {
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/guard/index.ts:238:9
-       if (this.timer) {
+       if (false) {
Ran all tests for this mutant.

[Survived] CallExpression
lib/guard/index.ts:242:5
-       this.map.clear();
+       ;
Ran all tests for this mutant.

[NoCoverage] StringLiteral
lib/store/connections.ts:58:29
-     const authority = m[2] ?? '';
+     const authority = m[2] ?? "Stryker was here!";

[Survived] Regex
lib/store/connections.ts:56:23
-     const m = url.match(/^([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
+     const m = url.match(/([a-z][a-z0-9+.-]*:\/\/)([^/?#]*)/i);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 31 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:57:7
-     if (!m) return url;
+     if (false) return url;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 31 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:60:7
-     if (at < 0) return url; // 无 userinfo
+     if (false) return url; // 无 userinfo
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 31 more tests!

[Survived] EqualityOperator
lib/store/connections.ts:60:7
-     if (at < 0) return url; // 无 userinfo
+     if (at <= 0) return url; // 无 userinfo
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 31 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:83:7
-     if (rec.name !== undefined) meta.name = rec.name;
+     if (true) meta.name = rec.name;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:84:7
-     if (rec.urlSafe !== undefined) meta.safeUrl = rec.urlSafe;
+     if (true) meta.safeUrl = rec.urlSafe;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:87:9
-       if (typeof host === 'string') meta.host = host;
+       if (true) meta.host = host;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:88:9
-       if (typeof port === 'number') meta.port = port;
+       if (true) meta.port = port;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:89:9
-       if (typeof database === 'string') meta.database = database;
+       if (true) meta.database = database;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore create 返回脱敏 meta，密码不出现在 connections.json
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets
  and 2 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:133:9
-       if (input.name !== undefined) rec.name = input.name;
+       if (true) rec.name = input.name;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 32 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:137:9
-       if (clean !== undefined) rec.fields = clean;
+       if (true) rec.fields = clean;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 32 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:158:9
-       if (patch.name !== undefined) rec.name = patch.name;
+       if (true) rec.name = patch.name;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:160:9
-       if (patch.fields !== undefined) {
+       if (true) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:160:9
-       if (patch.fields !== undefined) {
+       if (false) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] EqualityOperator
lib/store/connections.ts:160:9
-       if (patch.fields !== undefined) {
+       if (patch.fields === undefined) {
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] CallExpression
lib/store/connections.ts:169:5
-       this.save(data);
+       ;
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore update 更新 name/ssl/fields/url 并同步 secrets

[Survived] ConditionalExpression
lib/store/connections.ts:197:9
-       if (sec?.url !== undefined) rc.url = sec.url;
+       if (true) rc.url = sec.url;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 17 more tests!

[Survived] OptionalChaining
lib/store/connections.ts:197:9
-       if (sec?.url !== undefined) rc.url = sec.url;
+       if (sec.url !== undefined) rc.url = sec.url;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 17 more tests!

[Survived] ConditionalExpression
lib/store/connections.ts:200:9
-       if (fields !== undefined) rc.fields = fields;
+       if (true) rc.fields = fields;
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 17 more tests!

[Survived] ConditionalExpression
lib/store/grants.ts:60:9
-       if (next.length === list.length) return;
+       if (false) return;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ConditionalExpression
lib/store/grants.ts:61:9
-       if (next.length === 0) delete data.grants[projectKey];
+       if (false) delete data.grants[projectKey];
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE
    GrantStore revoke 撤销后不可见；撤销不存在者静默
    GrantStore 同一连接多项目授权互不干扰

[Survived] ArrayDeclaration
lib/store/grants.ts:68:54
-       const modes = (this.load().grants[projectKey] ?? [])
+       const modes = (this.load().grants[projectKey] ?? ["Stryker was here"])
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    handleToolAction（工具分发层） 未授权在工具层也拒（错误 JSON 而非抛出）
    业务路由与确认流程 未授权项目 → UNAUTHORIZED_PROJECT
  and 3 more tests!

[Survived] BooleanLiteral
lib/store/grants.ts:78:17
-       let dirty = false;
+       let dirty = true;
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:81:11
-         if (!list) continue;
+         if (false) continue;
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:85:13
-           if (next.length === 0) delete data.grants[key];
+           if (false) delete data.grants[key];
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:83:11
-         if (next.length !== list.length) {
+         if (true) {
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants

[Survived] ConditionalExpression
lib/store/grants.ts:89:9
-       if (dirty) this.save(data);
+       if (true) this.save(data);
Tests ran:
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除
    ConnectionStore remove 级联删除 secrets 与全部项目的 grants
