[NoCoverage] StringLiteral
lib/store/index.ts:41:41
-       const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
+       const home = homeDir ?? process.env[""] ?? path.join(os.homedir(), '.dsh');

[NoCoverage] StringLiteral
lib/store/index.ts:41:80
-       const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), '.dsh');
+       const home = homeDir ?? process.env['DSH_HOME'] ?? path.join(os.homedir(), "");

[Survived] CallExpression
lib/store/index.ts:44:5
-       chmodBestEffort(this.dir, 0o700);
+       ;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 45 more tests!

[NoCoverage] BlockStatement
lib/store/io.ts:31:17
-     } catch (err) {
-       try {
-         fs.rmSync(tmp, { force: true });
-       } catch {
-         // 清理失败不掩盖原始错误
-       }
-       throw err;
-     }
+     } catch (err) {}

[NoCoverage] BlockStatement
lib/store/io.ts:32:9
-       try {
-         fs.rmSync(tmp, { force: true });
-       } catch {
+       try {} catch {

[NoCoverage] ObjectLiteral
lib/store/io.ts:33:22
-         fs.rmSync(tmp, { force: true });
+         fs.rmSync(tmp, {});

[NoCoverage] BooleanLiteral
lib/store/io.ts:33:31
-         fs.rmSync(tmp, { force: true });
+         fs.rmSync(tmp, { force: false });

[Survived] BlockStatement
lib/store/io.ts:11:69
-   export function chmodBestEffort(target: string, mode: number): void {
-     try {
-       fs.chmodSync(target, mode);
-     } catch {
-       // 权限设置失败（Windows 等）不影响功能
-     }
-   }
+   export function chmodBestEffort(target: string, mode: number): void {}
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 47 more tests!

[Survived] BlockStatement
lib/store/io.ts:12:7
-     try {
-       fs.chmodSync(target, mode);
-     } catch {
+     try {} catch {
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 47 more tests!

[Survived] CallExpression
lib/store/io.ts:13:5
-       fs.chmodSync(target, mode);
+       ;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 47 more tests!

[Survived] StringLiteral
lib/store/io.ts:28:58
-     fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
+     fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + "", 'utf8');
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] StringLiteral
lib/store/io.ts:28:64
-     fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', 'utf8');
+     fs.writeFileSync(tmp, JSON.stringify(value, null, 2) + '\n', "");
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] ConditionalExpression
lib/store/io.ts:39:7
-     if (fileMode !== undefined) chmodBestEffort(file, fileMode);
+     if (true) chmodBestEffort(file, fileMode);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] ConditionalExpression
lib/store/io.ts:39:7
-     if (fileMode !== undefined) chmodBestEffort(file, fileMode);
+     if (false) chmodBestEffort(file, fileMode);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] EqualityOperator
lib/store/io.ts:39:7
-     if (fileMode !== undefined) chmodBestEffort(file, fileMode);
+     if (fileMode === undefined) chmodBestEffort(file, fileMode);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 42 more tests!

[Survived] CallExpression
lib/store/io.ts:39:31
-     if (fileMode !== undefined) chmodBestEffort(file, fileMode);
+     if (fileMode !== undefined) ;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 33 more tests!

[Survived] StringLiteral
lib/store/io.ts:54:17
-         fs.rmSync(`${file}.bak`, { force: true });
+         fs.rmSync(``, { force: true });
Tests ran:
    io：原子写与损坏容错 损坏 JSON 备份为 .bak 并返回 fallback（store 级验证）
    io：原子写与损坏容错 secrets.json 损坏同样容错且重建后权限仍为 0600（POSIX）

[Survived] ConditionalExpression
lib/store/io.ts:49:7
-     if (!fs.existsSync(file)) return fallback;
+     if (false) return fallback;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 62 more tests!

[Survived] Regex
lib/store/normalize.ts:19:21
-     key = key.replace(/^([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
+     key = key.replace(/([A-Z]):/, (_m, drive: string) => `${drive.toLowerCase()}:`);
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/store/normalize.ts:20:7
-     if (key.length > 1) key = key.replace(/\/+$/, '');
+     if (true) key = key.replace(/\/+$/, '');
Ran all tests for this mutant.

[Survived] ConditionalExpression
lib/store/normalize.ts:20:7
-     if (key.length > 1) key = key.replace(/\/+$/, '');
+     if (false) key = key.replace(/\/+$/, '');
Ran all tests for this mutant.

[Survived] EqualityOperator
lib/store/normalize.ts:20:7
-     if (key.length > 1) key = key.replace(/\/+$/, '');
+     if (key.length >= 1) key = key.replace(/\/+$/, '');
Ran all tests for this mutant.

[Survived] EqualityOperator
lib/store/normalize.ts:20:7
-     if (key.length > 1) key = key.replace(/\/+$/, '');
+     if (key.length <= 1) key = key.replace(/\/+$/, '');
Ran all tests for this mutant.

[Survived] Regex
lib/store/normalize.ts:20:41
-     if (key.length > 1) key = key.replace(/\/+$/, '');
+     if (key.length > 1) key = key.replace(/\/$/, '');
Ran all tests for this mutant.

[Survived] StringLiteral
lib/store/normalize.ts:20:49
-     if (key.length > 1) key = key.replace(/\/+$/, '');
+     if (key.length > 1) key = key.replace(/\/+$/, "Stryker was here!");
Ran all tests for this mutant.

[NoCoverage] StringLiteral
lib/manager.ts:73:48
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = typeof v === 'string' ? v.trim() : "Stryker was here!";

[NoCoverage] StringLiteral
lib/manager.ts:74:39
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s === '') throw new DbToolError("", `缺少必填参数: ${label}`);

[NoCoverage] StringLiteral
lib/manager.ts:74:59
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s === '') throw new DbToolError('INVALID_ARGUMENT', ``);

[NoCoverage] StringLiteral
lib/manager.ts:105:38
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!meta) throw new DbToolError("", `连接不存在: ${id}`);

[NoCoverage] StringLiteral
lib/manager.ts:105:51
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!meta) throw new DbToolError('NOT_FOUND', ``);

[NoCoverage] BlockStatement
lib/manager.ts:120:64
-     async testConnection(id: string): Promise<TestConnectResult> {
-       const rc = this.requireConn(id);
-       try {
-         const factory = await this.resolver(rc.meta.kind);
-         const adapter = await factory(rc);
-         try {
-           return await adapter.testConnect();
-         } finally {
-           await adapter.close().catch(() => {});
-         }
-       } catch (e) {
-         throw this.toDriverError(e);
-       }
-     }
+     async testConnection(id: string): Promise<TestConnectResult> {}

[NoCoverage] BlockStatement
lib/manager.ts:122:9
-       try {
-         const factory = await this.resolver(rc.meta.kind);
-         const adapter = await factory(rc);
-         try {
-           return await adapter.testConnect();
-         } finally {
-           await adapter.close().catch(() => {});
-         }
-       } catch (e) {
+       try {} catch (e) {

[NoCoverage] BlockStatement
lib/manager.ts:125:11
-         try {
-           return await adapter.testConnect();
-         } finally {
+         try {} finally {

[NoCoverage] BlockStatement
lib/manager.ts:127:17
-         } finally {
-           await adapter.close().catch(() => {});
-         }
+         } finally {}

[NoCoverage] BlockStatement
lib/manager.ts:130:17
-       } catch (e) {
-         throw this.toDriverError(e);
-       }
+       } catch (e) {}

[NoCoverage] BlockStatement
lib/manager.ts:277:78
-       const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {
-         throw e instanceof DbToolError ? e : this.toDriverError(e);
-       });
+       const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {});

[NoCoverage] ConditionalExpression
lib/manager.ts:289:11
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             true ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] ConditionalExpression
lib/manager.ts:289:11
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             false ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] EqualityOperator
lib/manager.ts:289:11
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level !== 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] StringLiteral
lib/manager.ts:289:21
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level === "" ? console.error('[db-script]', text) : console.log('[db-script]', text),

[NoCoverage] StringLiteral
lib/manager.ts:289:45
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level === 'error' ? console.error("", text) : console.log('[db-script]', text),

[NoCoverage] StringLiteral
lib/manager.ts:289:80
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+             level === 'error' ? console.error('[db-script]', text) : console.log("", text),

[NoCoverage] BlockStatement
lib/manager.ts:290:26
-           onTimeout: () => {
-             void sessionAdapter.close().catch(() => {});
-           },
+           onTimeout: () => {},

[NoCoverage] BlockStatement
lib/manager.ts:350:13
-       } catch {
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
-       }
+       } catch {}

[NoCoverage] StringLiteral
lib/manager.ts:351:29
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
+         throw new DbToolError("", `连接不存在: ${connId}`);

[NoCoverage] StringLiteral
lib/manager.ts:351:42
-         throw new DbToolError('NOT_FOUND', `连接不存在: ${connId}`);
+         throw new DbToolError('NOT_FOUND', ``);

[NoCoverage] StringLiteral
lib/manager.ts:361:46
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (this.disposed) throw new DbToolError("", '服务已关闭');

[NoCoverage] StringLiteral
lib/manager.ts:361:66
-       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', '服务已关闭');
+       if (this.disposed) throw new DbToolError('INVALID_ARGUMENT', "");

[NoCoverage] BlockStatement
lib/manager.ts:399:25
-         })().catch((e) => {
-           this.adapterCache.delete(cacheKey);
-           throw e instanceof DbToolError ? e : this.toDriverError(e);
-         });
+         })().catch((e) => {});

[NoCoverage] CallExpression
lib/manager.ts:400:9
-           this.adapterCache.delete(cacheKey);
+           ;

[NoCoverage] BooleanLiteral
lib/manager.ts:420:38
-       if (args.params !== undefined && !Array.isArray(args.params)) {
+       if (args.params !== undefined && Array.isArray(args.params)) {

[NoCoverage] BlockStatement
lib/manager.ts:420:67
-       if (args.params !== undefined && !Array.isArray(args.params)) {
-         throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
-       }
+       if (args.params !== undefined && !Array.isArray(args.params)) {}

[NoCoverage] StringLiteral
lib/manager.ts:421:29
-         throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
+         throw new DbToolError("", 'params 必须是数组（绑定参数）');

[NoCoverage] StringLiteral
lib/manager.ts:421:49
-         throw new DbToolError('INVALID_ARGUMENT', 'params 必须是数组（绑定参数）');
+         throw new DbToolError('INVALID_ARGUMENT', "");

[NoCoverage] StringLiteral
lib/manager.ts:432:115
-           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? '危险操作，需要用户确认' };
+           return { needConfirmation: true, challengeId: cid, statement, danger: 'danger', reason: verdict.reason ?? "" };

[NoCoverage] ConditionalExpression
lib/manager.ts:546:7
-         case 'schema': {
-           const conn = requireConn(connId);
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
-           return j(await service.databases(projectPath, conn));
-         }
+         case 'schema':

[NoCoverage] BlockStatement
lib/manager.ts:546:22
-         case 'schema': {
-           const conn = requireConn(connId);
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
-           return j(await service.databases(projectPath, conn));
-         }
+         case 'schema': {}

[NoCoverage] ConditionalExpression
lib/manager.ts:548:13
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+           if (true) return j(await service.schema(projectPath, conn, args.table, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:548:13
-           if (args.table) return j(await service.schema(projectPath, conn, args.table, args.database));
+           if (false) return j(await service.schema(projectPath, conn, args.table, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:549:13
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
+           if (true) return j(await service.tables(projectPath, conn, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:549:13
-           if (args.database) return j(await service.tables(projectPath, conn, args.database));
+           if (false) return j(await service.tables(projectPath, conn, args.database));

[NoCoverage] ConditionalExpression
lib/manager.ts:553:7
-         case 'preview': {
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database, args.offset);
-           return j(r);
-         }
+         case 'preview':

[NoCoverage] BlockStatement
lib/manager.ts:553:23
-         case 'preview': {
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database, args.offset);
-           return j(r);
-         }
+         case 'preview': {}

[NoCoverage] StringLiteral
lib/manager.ts:554:97
-           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, 'table'), args.limit, args.database, args.offset);
+           const r = await service.preview(projectPath, requireConn(connId), assertArg(args.table, ""), args.limit, args.database, args.offset);

[NoCoverage] StringLiteral
lib/manager.ts:567:54
-       const code = e instanceof DbToolError ? e.code : 'DRIVER_ERROR';
+       const code = e instanceof DbToolError ? e.code : "";

[NoCoverage] StringLiteral
lib/manager.ts:578:52
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === '') throw new DbToolError("", `缺少必填参数: ${label}`);

[NoCoverage] StringLiteral
lib/manager.ts:578:72
-     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (!v || v.trim() === '') throw new DbToolError('INVALID_ARGUMENT', ``);

[Survived] StringLiteral
lib/manager.ts:53:17
-       this.name = 'DbToolError';
+       this.name = "";
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 21 more tests!

[Survived] ConditionalExpression
lib/manager.ts:73:13
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = true ? v.trim() : '';
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] MethodExpression
lib/manager.ts:73:37
-     const s = typeof v === 'string' ? v.trim() : '';
+     const s = typeof v === 'string' ? v : '';
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] ConditionalExpression
lib/manager.ts:74:7
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (false) throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] StringLiteral
lib/manager.ts:74:13
-     if (s === '') throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
+     if (s === "Stryker was here!") throw new DbToolError('INVALID_ARGUMENT', `缺少必填参数: ${label}`);
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 30 more tests!

[Survived] OptionalChaining
lib/manager.ts:87:21
-       this.resolver = opts?.adapterResolver ?? getAdapter;
+       this.resolver = opts.adapterResolver ?? getAdapter;
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 22 more tests!

[Survived] OptionalChaining
lib/manager.ts:88:23
-       this.challenges = opts?.challenges ?? new ChallengeStore();
+       this.challenges = opts.challenges ?? new ChallengeStore();
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 22 more tests!

[Survived] LogicalOperator
lib/manager.ts:88:23
-       this.challenges = opts?.challenges ?? new ChallengeStore();
+       this.challenges = opts?.challenges && new ChallengeStore();
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 22 more tests!

[Survived] ConditionalExpression
lib/manager.ts:105:9
-       if (!meta) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (false) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
Tests ran:
    连接管理与授权路由 POST /api/connections 创建 + PUT 更新 + DELETE 删除

[Survived] StringLiteral
lib/manager.ts:114:49
-       if (!ok) throw new DbToolError('NOT_FOUND', `连接不存在: ${id}`);
+       if (!ok) throw new DbToolError('NOT_FOUND', ``);
Tests ran:
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 连接管理与 secrets remove 级联；重复 remove → NOT_FOUND

[Survived] CallExpression
lib/manager.ts:151:5
-       this.store.grants.revoke(key, connId);
+       ;
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] BlockStatement
lib/manager.ts:149:58
-     revokeGrant(projectPath: string, connId: string): void {
-       const key = normalizeProjectKey(projectPath);
-       this.store.grants.revoke(key, connId);
-       void this.dropAdapters(connId);
-       this.audit(key, connId, 'revoke', connId, 'none', false, true);
-     }
+     revokeGrant(projectPath: string, connId: string): void {}
Tests ran:
    连接管理与授权路由 grants PUT/GET/DELETE

[Survived] StringLiteral
lib/manager.ts:183:37
-       const t = assertNonEmpty(table, 'table');
+       const t = assertNonEmpty(table, "");
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:203:37
-       const t = assertNonEmpty(table, 'table');
+       const t = assertNonEmpty(table, "");
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] MethodExpression
lib/manager.ts:205:17
-       const off = Math.max(0, Math.floor(Number(offset) || 0));
+       const off = Math.min(0, Math.floor(Number(offset) || 0));
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] ConditionalExpression
lib/manager.ts:205:40
-       const off = Math.max(0, Math.floor(Number(offset) || 0));
+       const off = Math.max(0, Math.floor(true));
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] ConditionalExpression
lib/manager.ts:205:40
-       const off = Math.max(0, Math.floor(Number(offset) || 0));
+       const off = Math.max(0, Math.floor(false));
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] LogicalOperator
lib/manager.ts:205:40
-       const off = Math.max(0, Math.floor(Number(offset) || 0));
+       const off = Math.max(0, Math.floor(Number(offset) && 0));
Tests ran:
    DbToolService: 浏览与审计 databases/tables/schema/preview 正常；preview limit 强制 ≤50
    业务路由与确认流程 GET /api/databases、/api/tables、/api/schema、/api/preview

[Survived] StringLiteral
lib/manager.ts:226:43
-       const statement = assertNonEmpty(sql, 'sql');
+       const statement = assertNonEmpty(sql, "");
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 15 more tests!

[Survived] ArrowFunction
lib/manager.ts:234:21
-         rowsAffected: (r) => r.rowCount,
+         rowsAffected: () => undefined,
Tests ran:
    DbToolService: 授权与只读 未授权项目 → UNAUTHORIZED_PROJECT；缺 projectPath 同样拒绝
    DbToolService: 授权与只读 未授权连接一概 UNAUTHORIZED_PROJECT（不泄露存在性）；已知项目下未知连接 remove → NOT_FOUND
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
  and 15 more tests!

[Survived] StringLiteral
lib/manager.ts:245:44
-       const stmt = assertNonEmpty(statement, 'statement');
+       const stmt = assertNonEmpty(statement, "");
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 13 more tests!

[Survived] ArrowFunction
lib/manager.ts:253:21
-         rowsAffected: (r) => r.affectedRows,
+         rowsAffected: () => undefined,
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: 授权与只读 rw 连接 mode=rw 透传，DML 直接执行
    DbToolService: 危险确认与 challenge 危险语句首次 → NEEDS_CONFIRMATION；带 challengeId 重试成功
  and 13 more tests!

[Survived] ObjectLiteral
lib/manager.ts:277:46
-       const sessionAdapter = await factory(rc, { mode }).catch((e: unknown) => {
+       const sessionAdapter = await factory(rc, {}).catch((e: unknown) => {
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] StringLiteral
lib/manager.ts:271:38
-       const src = assertNonEmpty(code, 'code');
+       const src = assertNonEmpty(code, "");
Tests ran:
    DbToolService: 授权与只读 ro 连接 execute / run_script → READ_ONLY；query 可用；mode 透传工厂
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
  and 4 more tests!

[Survived] ArrowFunction
lib/manager.ts:288:16
-           onLog: (level, text) =>
-             level === 'error' ? console.error('[db-script]', text) : console.log('[db-script]', text),
+           onLog: () => undefined,
Tests ran:
    DbToolService: run_script 沙箱 rw：脚本可 db.query / db.execute，结果返回
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
  and 3 more tests!

[Survived] BooleanLiteral
lib/manager.ts:297:11
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION') {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:297:11
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (true) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:297:11
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (false) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:297:13
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(true)) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!

[Survived] ConditionalExpression
lib/manager.ts:297:13
-         if (!(e instanceof DbToolError && e.code === 'NEEDS_CONFIRMATION')) {
+         if (!(false)) {
Tests ran:
    DbToolService: run_script 沙箱 沙箱内无 require/process/globalThis.fs 逃逸面
    DbToolService: run_script 沙箱 脚本内危险语句 → NEEDS_CONFIRMATION（challengeId 为空时生成新 challenge）
    DbToolService: run_script 沙箱 脚本语法错误 → DRIVER_ERROR 而非崩溃
  and 1 more test!
